{"data": [{"name": "azure margins", "questions": []}, {"name": "commercial licensing business", "questions": ["I just wanted to follow up, Amy. Your Commercial Other business continues to have fantastic growth. I'm wondering when you juxtapose that with the growth in the commercial licensing business -- I heard you in terms of the headwinds that you face -- but when we think about it more than one quarter out, we think about the revenue transition as you guys continue to build market share in the cloud, how do we think about the trend in the commercial licensing business in the next year or so?", "Two questions, one was related to the success of the sub-$250 machines that you guys and the market have been seeing. What geos have seen the best uptake for those so far? And just if there is a little bit more color you could share about the drivers of the commercial licensing business. I recognize, obviously, that you guys just give guidance for Q4. But as we look out over the next year or two, what are the big puts and takes, in particular, maybe, on the server and tool side that we need to think about?"]}, {"name": "azure revenue", "questions": []}, {"name": "commercial business", "questions": ["Thanks a lot, and my congratulations, as well. Amy, you said that Office 365 Home Premium was more than 15% of total consumer Office licenses sold. And I wonder if you think about your commercial business. And we either think about it as a percentage of total Office 365 or as a percentage of what's traditionally been transactional, whether you have a similar metric in terms of percentage of total Office licenses sold."]}, {"name": "business", "questions": ["Peter, I'd just like to echo others' thoughts here, it truly has been a pleasure and wish you the best going forward. My question is for Chris. Chris, just wanted to clarify something you said about inventories. I think you were talking about PC inventory, but with the Windows business can you give us your assessment of what Windows inventory is at OEMs? Especially given the disappointing PC shipment data this quarter.", "Peter, as you look at the PC data over the course of the quarter, could you give us any sense of how that trended? And following up on that, as you think about the business upgrade cycle, which should be over by this time next year, do we risk a real fall off again in the PC business because the upgrade cycle has aided what's been a difficult PC market the last couple of quarters? And best of luck by the way.", "Amy, you had discussed your increased CapEx this quarter, and I was wondering if you could address the margin profile of your cloud services. In the comments, you discussed how you have higher datacenter cost, and what I'd like to understand is whether this is temporary, as you are ramping up this transition towards subscription business, or whether this actually changes the gross margin profile of these revenues. Thanks.", "Amy, congrats on your first conference call as CFO. My question had to do with the Windows side of the business. I know that you had an impairment charge for the inventory clearance, but even if I add that back in, it looks like the operating margins in the Windows business were sequentially lower, quite materially. Just wanted to get some insight into what drove that from the March quarter into the June quarter. As you look further out into the operating margins of the Windows business, given that you're going to be focusing on Surface, how should we think about the margin structure? I guess you have a volume threshold to clear before you can start to make a margin, given that it's more of a product. But really two parts to that question. Love to get your insights, thank you so much.", "Amy, I just wanted to drill into the billings growth where we adjust for the unearned, and it's a lot higher for the Server and Tools business, which is obviously going through a transition towards more a subscription arrangement, a lot higher there than in the MBD segment. I'm just wondered if you could compare and contrast why that might be. I understand the consumer piece in MBD, but is the other piece of this just that there are more traditional licensing arrangements in MBD with enterprise customers, and so the impact from the transition is all the greater, and that's why you see that more subdued billings growth rate in MBD? Thanks.", "Amy, welcome on this first earnings call. I have a question on the business PC side, that was an area of strength for the Windows division, and you saw some growth there. Can you talk a little bit about if that's -- if you see that as a sustainable number, or is that still driven by the end of life for Windows XP? Thank you.", "Hi, guys. This is Ken Wong for Walter. We wanted to focus a bit on Windows. The OEM business was down just 7% this quarter versus down 15% last quarter, in what seemed like a really -- you guys had a lot of pressure on ASPs and what-not. What drove the quick turnaround from quarter to quarter? Maybe if you could just dig in a little bit there.", "Excellent. Thank you, guys, for taking the question. You saw a real market uptick in the advertising revenue with the search advertising revenue. Any particular catalyst you could point us to in what really catalyzed that part of the business and how sustainable that's going to be on a go forward basis?", "Just to follow-up on Mark's question, I believe there was a slide at [STAM] that showed about $150 million of negative impact in the quarter from the move to the cloud. Which, in and of itself, it's about 1% of revenue, so it's not a very big deal. And I think most of that was from Office versus server and tools. So, if you say it is about as expected -- I'm just looking for some clarification here -- is really the only impact we're seeing in the Office segment versus server and tools? Or was there much impact in that part of the business from the move to subscription?", "Thanks a lot. I have two questions. Just, first, on the device and consumer licensing business. Your forecast for Q2 suggests a moderating decline. And I was curious as to whether on the corporate OEM side, if you will, that is just a reflection of the ongoing stabilization trend. Or do you also expect to see improvement on the consumer OEM side? And related to that, how do you think about the impact of the end-of-life of XP on the corporate OEM side? Do you think that the improvement is completely unrelated to that end-of-life forthcoming or do you think there could be some impact related to that? Thanks.", "Thank you very much, that's helpful. And maybe one quick follow-up. Just on the Office business overall in the commercial segment, if you think about units, whether licensed or 365, when you just think of the aggregate pool of units, you alluded to it before, but did that perform in line with your expectation? Or was it actually slightly better on a unit basis? Thank you.", "Hi, thank you very much for all the details, as well. Maybe my math skills have gotten horribly weak, but I just took the midpoint, Amy, of your revenue guidance for the different line items, and also the midpoint of your cost of revenue inputs, and the midpoint of your OpEx. And I come up with what looks to be about a 10% reduction to where I think most sales side models are. Maybe I'm doing -- I'm hoping that I did something wrong here. But if that is the case, I get about 29% op margin relative to the 33% or so that you did last year. So can you just walk us through what are the items that you are assuming in your cost structure which effectively makes the op income flat. Although you are getting good revenue growth rate. I just wonder if there are any one-time items or if it is just emblematic of a shift in your business model to devices and consumer, especially with Nokia going forward. Wonder if we should not be thinking about op margins but really op income growth rate? Thank you.", "Thank you very much, and good afternoon, guys. Just two questions. First, Amy, if I recall correctly I believe last quarter you had mentioned an expectation for double-digit annuity growth in fiscal '14. Is that still how you're thinking about the annuity part of the business? And secondly, the year-over-year cloud revenue growth you reported was certainly impressive. But I was wondering if you could shed some light, perhaps, on how much of Azure billings or revenue are incremental versus cannibalistic?", "Thank you. Obviously nice upside on the hardware business and with Surface and Xbox. But my question is on the licensing business, so bear with me a little bit here. You had both licensing businesses, device and consumer and commercial licensing, they were both better than expected at least by about $100 million each. At the same time, deferred revenue was shy by something like $250 million. But there is some conflicting things. I am just trying to get my head around this. The contract not billed, Amy, you pointed out was really strong, saw a big jump by somewhere around $2 billion sequentially. And you also saw some nice traction, the commercial cloud services more than doubled. Assuming it's small. Here's my question. With all that happening, is there a shift happening with your on-premise corporate business to more transactional versus ratable contracts? That would help out, to help offset the financial implications as you shift to cloud services on the corporate side. Is that's what's happening with all these movements? Sorry about all the detail.", "Okay. And last quarter we talked a bit about, are there any metrics you can help us to understand better what the effect of your revenues is from the shift to the cloud? I think on Office it's more of a net, a delta that, I think you said it hurts you about $150 million in the previous quarter. Is there any way you can give us a sense of what the net impact is on the business from the shift to cloud?", "Hi. Thank you very much, Amy. I appreciate the fact that you are trying to improve the margins in each of the commercial and the consumer businesses. But the margin differential between these two businesses is still -- is a pretty wide one. It looks like the consumer business is growing. The two dynamics that I can see are the of consumer business -- the three are: one is the margin differential is too wide. You try to improve it. The marginal difference is too wide. The consumer business trend-wise is growing faster than commercial. And third is that you have the shift to the cloud. Unless you do something like an Adobe or Autodesk where you force transition to happen quickly, there is the risk that you get a lot of growth, which is fantastic. There's a lot of progress to share, but the margin inflection point could be delayed for several years. I think that what one of the questions that was spurred behind, I think presumably Heather's question, was -- that's what I'm trying to get at. So how long you are going to get this shift to result in a way that we may not see the earnings growth rate, but we have to wait to some point in time? Or are you at the point where you can actually force this shift to happen much quicker? Thank you very much.", "Thanks a lot, and my congratulations, as well. Amy, you said that Office 365 Home Premium was more than 15% of total consumer Office licenses sold. And I wonder if you think about your commercial business. And we either think about it as a percentage of total Office 365 or as a percentage of what's traditionally been transactional, whether you have a similar metric in terms of percentage of total Office licenses sold.", "I just think that would be helpful, especially as we think about it with respect to your traditional commercial transactional business. Maybe if I could slip in one other one just to go back on the contracted not billed. I just want to be clear in my own mind because I've heard two things. One thing I heard you say was we had stronger transactional business late in the quarter, but I also heard you say there were, frankly, more renewals on multi-year that would have resulted in that balance going up, especially if those were late in the quarter. Am I right to think it's those two factors that are at play here? Both stronger transactional and a larger pool, if you will, of multi-year renewals? And is it relatively evenly balanced between the two? Thank you.", "Amy, in the Q it talks about the Surface still losing money, even at the almost $900 million run rate of revenue in the quarter. Can you give us any sense of what type of volume you need for that business to have the scale to make some money?", "Thank you very much. Satya, welcome on board, and thanks for joining the call. If you don't mind, I'm going to ask an overall question either of Amy or of Satya. Looking at the commercial license business, how much of the shrinkage year-over-year in commercial license is driven by the move of traditional license players from license or -- licensed paying customers, from license to the cloud? How much is related to guys moving from software assurance, how much from license? Can you give any color in there?", "And Satya, again, thank you for joining the call. It's great to have your views and inputs here. One of the questions I get most often from investors is trying to understand sort of how you're going to approach the role, and what you're doing initially, in terms of, is there a strategic review that's going on? Are you reviewing the businesses, and should we expect any big changes in the strategy of Microsoft? So I'm going to pose that question to you, in terms of over the next couple of weeks, months, quarters, even, is there anything of a strategic review going on? Is there any big changes in the Microsoft strategy that we should be expecting from that review?", "First, Satya, on Platform-as-a-Service, I'm kind of curious how aggressively you plan to maybe change your business model to a subscription model and drive, like adobe did, less upfront revenue, more encouraging subscription and cloud-based, and whether we should begin to anticipate what it might look like to Microsoft as you make this transition to more of a subscription business. I'm just not sure what the margins are on your cloud business and as you transition, most SaaS companies have 70%, 80% gross margins, I'm not real sure where you are on your cloud businesses today. Do we think this is going to be a smooth transition, or might we expect it to be a little more disruptive, as you gain more and more traction on a subscription and cloud basis?", "Congratulations on a great quarter, and Satya, great to have you on the call, as well. I wanted to focus in on Office 365. If you compare this quarter to last quarter, you added 1.1 Home Premium users, last quarter, I think it was 500,000. In September, you talked about a run rate of I think $1.5 billion, now you're at $2.5 billion. I wonder if you can talk about the momentum that you're seeing in Office 365 and maybe give us a few thoughts on business versus the home/consumer side of that. And then, Amy, when you think about Office 365, how do you think about the difference in lifetime value of an Office 365 customer versus a traditional Office user?", "Amy, just a question for you, I know you're not providing updated guidance for Nokia. Just wondering, maybe a little bit of thought behind that decision. I know the deal closes tomorrow, you probably could have easily moved things around here a bit and reported on early next week, and had that benefit. Is the lack of guidance there, is it just simply you haven't been able to get your hands into that business at this point? Is there something else that's changed in that business, just trying to get a sense. It does open up quite a bit of variability, in terms of how people are going to model things over the next three months.", "I would like to focus on that server product revenue number of 10%, and Satya, I think you know a thing or two about this group, so perhaps I'll direct that to you. But that growth rate is so far still above what a lot of your megacap tech vendors, peers, I should say, are posting. I wanted to ask you if you could try to outline for us the couple of factors that have enabled Microsoft to continue growing that server business well above your peers, and secondly, if you think that 10%-ish growth is sustainable over FY15?", "I wouldn't mind focusing for a moment on the enterprise server-side. That's where at least for me much of the upside came. We haven't seen server product revenue growth in the mid-teens in a while, total Microsoft bookings, 20% ex-Nokia, haven't seen that in ages. Perhaps the answer to these questions are related, but what's happening with those two numbers to drive the upside. I'm sure a little bit came with Azure being strong, but that's relatively small. So clearly there was an inflection up on the on-prem server tools business. Maybe part of it was renewal rates, and if that's the answer how much room do we have to go on that? Thank you.", "Thanks, good afternoon. On the commercial revenue continues to grow an impressive double-digit rate. Many of your peers have not been doing quite as well as you have just in the last reported quarter. And Amy, I know you mentioned your confident about this business continuing. I'm curious if you could just maybe underscore what you feel you guys are doing differently than what's happening in the peer group, and underscoring that confidence going forward.", "Yes, thanks. I wanted to follow up on Phil's question. I think that Office transitions, our analysis suggests that that's a net benefit from here for you; I'd like to get Amy's comments and thoughts maybe about the transition for the rest of the business. If you've got server and tools, at some point -- I mean it continues to show really terrific growth, at some point I suppose that becomes cannibalized by your cloud business with Azure. Maybe Satya if you can share how you think that transition, how long, how does it transpire? Any thoughts and should it be net additive to the revenues and operating income as we've seen on the Office side? And maybe if you could talk on Windows as well, it looks like it was OEM down a little bit this quarter, which had been growing. Are we going to see a lower ASPs with these $200 devices coming out this fall?", "Hi, thank you for taking my question. Satya, I just wanted to get your perspective on the business mix, because clearly you have a very strong and growing consumer footprint especially with Nokia, and then you've got a very solid enterprise backbone. And it feels like the consumer side of the house is pulling away much faster, and obviously got some implications for how you look at the business in terms of margins and how they could potentially inflect some switchers. If you could just give us your thoughts Satya on how you see the business mix, that would be great. And also wondering, Amy, if you could shed some light on cost controls, and what were the things that specifically the Company engaged in? Because the marketing expenses came in at a nice surprise much lower than we expected. Thank you very much.", "Thanks. Question for Amy. Amy, just thinking through your guide by business segment, everything seems roughly in line but for the D&amp;C licensing guide which implies I think a 24% year-over-year decline, and given that that's a 90% gross margin business, I just want to make sure I understand what's happening there. And I have two questions, I'm wondering if you could help disaggregate how much of that is due to the tough XP related compare versus some other perhaps one-time issues that make for a tough comparison? And then secondly, when in your best judgment do you think that D&amp;C licensing revenue might turn positive? Thank you.", "Thanks, guys. I've got a question on the Commercial Other line. Obviously that continues to show strong growth. You've been calling out the cloud business, whether it be Azure or Office 365. I wanted to double-click on the Azure side. Wondering if you can help us parse through the infrastructure as a service and the platform as a service side, and the trends there, and any sort of joint benefit, I guess, that you're seeing in being able to offer both those two? Also Satya, as this business does scale -- and then Amy I'd love you to chime in here, too -- how do you think about the gross margin and operating margin characteristics, once again, as the revenue continues to grow here?", "I just wanted to follow up, Amy. Your Commercial Other business continues to have fantastic growth. I'm wondering when you juxtapose that with the growth in the commercial licensing business -- I heard you in terms of the headwinds that you face -- but when we think about it more than one quarter out, we think about the revenue transition as you guys continue to build market share in the cloud, how do we think about the trend in the commercial licensing business in the next year or so?", "Yes, thank you. Over the last several quarters, particular Satya, you've opened up a number of the products to different platforms, Office and Android. With Minecraft and Skype, you've got a number of really multi-platform products and services. Could you quantify so far to what extent you have seen benefit? As this plays into the free upgrade for Windows 10, at least for a limited period, how you expect this to play out benefiting the business case of your products across the portfolio?", "Thanks. It sounds like cloud Azure represents an opportunity to transition existing customers to a cloud model, but also to expand your customer base or penetrate -- penetration into your current customer base with -- incremental business is what I'm talking about. I think that most of Office 365, because most people were already on Office, represents transitions from the license model. But so far, and I know it's still early, but so far, what about the rest? Can you give us an idea of how much of this is new business and how much of this is transition business?", "Thanks. I want to be clear because you said something -- other than Office 365, did you say the majority of the cloud business is new business? Again, I know it can't be -- maybe you know exactly what it is, but I'm sure some of it is somewhat cloudy -- no pun intended -- or vague. Do you think most it at this point is new business? Is that what I heard you say?", "A follow-up to the question John had on Azure. Amazon released their profitability for the first time on AWS and it was higher than most people were expecting. I'm wondering how we should think about your mix of business in Azure, you're running Linux, you're running a lot of services based on open source software, you're also running some of your own IP there. How should we think about where your margins are today and should we think of Amazon's AWS margins as a good benchmark for where you could be at scale they are at today?", "Two questions, one was related to the success of the sub-$250 machines that you guys and the market have been seeing. What geos have seen the best uptake for those so far? And just if there is a little bit more color you could share about the drivers of the commercial licensing business. I recognize, obviously, that you guys just give guidance for Q4. But as we look out over the next year or two, what are the big puts and takes, in particular, maybe, on the server and tool side that we need to think about?", "Thank you. Satya, I'm wondering what inning you think we are in, in terms of building out the next generation data centers that you'll need to support the commercial cloud. For example, do you think you've built out data center capacity to support the commercial cloud business all the way to a $10 billion run rate or a $20 billion run rate? If there's any way you can help us to try to gauge how much overhead you have in the capacity, and perhaps what type of data center footprint you envision a few years down the road?", "Good afternoon, Satya, the server business continues a steady out-performance and as Amy pointed out, better growth than your peers. Couple of questions as it relates to the Windows 2003 retirement and any impact you're seeing there. And secondarily if you can just comment on some of the new product launches. Seems like there is a stack of new solutions that are coming on the server side that look pretty exciting and your partners are excited about it. If you could highlight what you see as the most interesting from your perspective over the next several quarters.", "Excellent. Nice quarter, guys, thank you for taking the question. I wanted to drill into sort of the new strategy around the phone business a little bit. The revenue expectation for Q1, I think it was below our expectations, I think it was below what the street was looking for. Can you give us a sense of how you see that business trending over a longer period of time. There is significant restructuring going on. I don't think a lot of guys have a good view in their head of what your expectation is for this business on a revenue run rate, or what do you expect to sell this year on going-forward basis right now?", "Can I sneak one more in on the security side of business? I think a lot of guys talked about security something that Microsoft does to make their platform more secure and provide more confidence in users using your platforms and your tools. On a going-forward basis is there more of an opportunity for you guys to sell security as more of a standalone opportunity? It's something that is in very high demand, looking for more secure solutions. Is this something that could potentially be more of a standalone opportunity for Microsoft on a going-forward basis.", "Question for Amy on the cost control front, looks like you once again came in below your OpEx guide. But I think that the COGS number came a little bit above what you had guided to three months ago, and I'm just wondering if you could talk through that, obviously it affects everybody's gross margin calculations. Was it the hardware mix shift? Was it the challenges with the phone business? Perhaps a little color there might help us. Thank you.", "Very nice quarter, indeed. I wanted to ask about the Azure, in particular, and the public cloud [forms] that you saw this quarter. Again, seems like you're seeing an acceleration in that overall business. More broadly, it seems like industry-wide, both you guys and [eight of us] are seeing something of an inflection point going on in terms of more and more business accruing to those public cloud environments. So my question is just that. Would you agree with that statement that there's been an inflection going on in the business? And if so, what do you think is causing that and is there a changing in nature in how people are using that cloud? And then maybe for Amy, is there something we should bear in mind in terms of your traditional business, the on-premise business that may be impacted as that infection takes place that we should bear in mind as you go forward?", "Congrats on a great quarter. Just a question for Satya, then a follow-up to Amy, Satya, you talked about good adoption of Office 365 on the commercial side, both in SMBs and large enterprise. Wondering if you just could break that down and where you're seeing the faster adoption? As you start to get into the enterprises especially that might have enterprise agreements with Microsoft, how is that sales motion going and what is the pitch there? And then to Amy, I thought this was a key point, something that we've been looking for. You noted that these subscription recurring business now has offset the cannibalization on the license. Is that something that we should think about going forward or was there something specific about this quarter that would push that out? Thanks.", "Besides Azure in the Intelligent Cloud, you obviously have very, very good momentum on the classic server [and tools] business. Can you talk a little bit about the volume versus price effect that you see playing out here and how is it now and how do you expect that to play out going forward? One of the things on Azure was usage, and you mentioned how that improved quite significantly. Satya, can you talk a little bit where you see that current usage standing and where do you think that can go? We obviously didn't get a number, just a growth rate, but where do we see usage, because that's obviously one of the things that one of your competitors keeps [poking] -- trying to knock on you?", "I wouldn't mind going back to Windows 10. Three months ago on the June quarter call, the messaging was that Windows 10 would not likely lift Microsoft's performance results until the second half of FY16, yet it feels like, as early as this first quarter, it's creating a lift at least to the Windows OEM business. I just wanted to understand what's changed in the last three months such that it's having an earlier than expected positive impact on Microsoft? Thank you.", "Thanks so much for squeezing me in and congrats on the quarter. Amy, I just had a couple. The first one, just your comment that the consumer Office business, you are seeing basically the subscription revenue now being larger than the offset, if you will, on the license side. Where do we stand with regard to that on the commercial side of the Office transition?", "Congrats on a great quarter. I just wanted to focus in on commercial cloud and Azure specifically. Commercial cloud, as you mentioned, the run rate was up $9.4 billion. That's up like $2 billion quarter to quarter, 70% year over year. That's higher growth rate than even last quarter. Azure [similar, if not even] accelerating growth versus even last quarter. So a question, Satya, and I'll follow up for Amy. Satya, when you look at the growth rates there in commercial cloud, and particularly Azure, you talk about new customer wins but also existing customers transitioning more workloads to Azure. I hope you can give us maybe some more color there as far as what you're seeing and how you think about the growth going forward there? And then Amy, based on our calculations, it seems like Azure had a meaningful improvement in just the gross margin year over year. Wondering if you could help us with the two curves in that business, and sort of where we are in Azure's gross margin lifecycle? Again, the fixed costs and the variable costs and how you are thinking about that? Thanks.", "Thank you. Satya, Amy, congrats on the quarter. I've got for Satya and then a quick follow-up with Amy. Satya, following up on the cloud discussion, recognizing that SaaS, Pass, infrastructure as a server hybrid, they're all related, but as Azure continues to grow fast and become a bigger part of the business, how should we think about the opportunities or the opportunity size for Pass versus infrastructure as a service? Pass is much smaller industry-wide today, but is the opportunity is big, bigger? How should we think about that? And then a follow-up for Amy.", "Amy, relative to your Q2 guide, the upside surprise really came in the personal computing business. And at least relative to our third-quarter estimates, it's again the personal computing guidance that beat. I'm wondering if you could repeat the key factors that are contributing to the outperformance in that pretty important business? Thank you.", "Okay, great. Amy, for the third quarter your guide for that business is also pretty good. Is that due to some of these similar factors or are there one or two others that are driving the, what appears to be appears to be pretty solid 3Q performance in that unit as well?", "Good afternoon. Amy, just on the Q4 guide. You're guiding below the Street on many of the individual line items on the top line. I'm just curious, is this more of the shift to the cloud, or is there some demand execution issues that you're seeing in the business?", "Sure. Thank you very much. So if you look at productivity and process and intelligent cloud, obviously we're having a margin decrease that's occurring, and a good chunk of that is cloud. How should we think about the standalone license business, in terms of the margins, separated from the cloud side of it?", "Great. Thank you so much. Satya, I wanted to see if you could share a little bit on Azure? Just how you're thinking about the competitive positioning, versus Amazon, where you think your strengths are, versus them? And also, as the business continues to ramp at such a fast pace, how do we think about the progression in gross margins? I mean, Amazon gives us operating margins. But I guess, I'm wondering, is there a reason you shouldn't be able to reach similar operating margins with Azure at a similar scale, if we went back and looked at the progression that Amazon's been disclosing?", "Excellent. Thank you, guys, for taking my question. Amy, when you're talking about the transactional declines particularly (technical difficulty) and the server portion of that, can you help us understand how much of that is due to maybe more macro factors, weaker overall spending environment, and how much of that comes from perhaps demand being reallocated towards infrastructure-as-a-service offerings that you guys have in Azure? Is there something of a cannibalization taking place, within that transactional business today?", "Hi, thanks. Amy, my question just on guidance, and your posture on guidance, a two-part question. I think we've seen you give very conservative guidance say, for the first half of the year. And in Q3, you ended up, putting it all together, at the lower end of your guidance. And I'm wondering -- your posture, just generally around guidance, if it's changed at all, that you're factoring in things differently, and we should think about that range going forward? Should it be more like it's been in the past, where you've had very conservative assumptions, or more like what you just did here? And then, the second part is, as you look forward maybe towards longer-term guidance, and the prospects of giving longer-term guidance, because I don't think I've seen an estimate spread on a company as large as this, in a long time, how are you thinking about possibly giving long-term guidance? What the factors that are influencing your comfort in doing that? Or is it more philosophical, and it's something you're just not going to do, that's not necessarily dependent on your view of the business?", "Hi, a question for Amy. Amy, you've been able to grow your Op income on a constant currency basis nicely double-digits, as you've been investing in the cloud. As you look at the results this quarter, and the -- as you pointed out the Op margins in intelligent cloud and business process productivity that were impacted due to the shift to the cloud, do you think that as you look into next year that the cloud business is at scale, that it continues to grow and take share, relative to overall revenue? The transaction business, who knows, it could be a bit of a macro pressure. Do you think that we're at the point where we could continue to entertain a scenario, that Op income could still continues to grow nicely, as it has in the last three, four quarters? Or is there some other structural change, with respect to the margin of the cloud business, or maybe the transaction business drops off a lot more dramatically, that it may be hard to sustain this nice double-digit Op income, at a very high level without going into the details? Thank you.", "Thank you. So Satya or Amy, last quarter, the stock was hit in part on a deceleration in your on-premises server product business, and I think your commentary around the transactional part of that suggested it softened a little bit. I think your tone on this call is a lot better around the transactional performance, and it looks like that business accelerated a little bit. Perhaps you could explain what changed in the course of the three months to make the transactional piece, at least if I'm hearing you correctly, feel a little bit better? Thank you.", "Thanks, Amy. In Q3 the transactional business was weak and you said the business bounced back in Q4. Was that just a mere fact of you cleaning up some of the slipped business, or did you see additional strength on top of some of those closed transactions on the transactional business in Q4?", "Thanks so much. Maybe just one quick follow-up. The server products business that Karl talked about did rebound this quarter and I think it was up about 4% constant currency for the year. I know you're not guiding to that number specifically and you talked about potential volatility. But is there any range of outcomes that you're thinking about for that business? Will it grow? Is it not clear that it will grow? I'd just love any additional color there. Thank you.", "Question for Amy. The operating cash flow generation, $11.6 billion, was extraordinary. I don't think you've had a 50%-plus cash flow margin since early 2012. Is this a little bit of an anomaly, maybe driven by unearned revenues? Or is something changing in the business model that might change the rate of cash flow generation in coming quarters as well? Thank you.", "Thank you very much. Satya, can you just compare and contrast AWS versus Azure, Azure versus AWS from a standpoint of the technology footprint that you are offering both these companies? And Amy, if you could just comment on the margin structure of your Azure business relative to AWS, and if you have time, talk about the Windows 10 cycle. Why is it going to be the best Windows 10 cycle for the enterprise, compared to the previous cycle? Thank you so much.", "Great, thanks very much. Amy, quick question. With the recent release of Win Server 16, is there any reason to think that we shouldn't see some uptick in the transactional business, especially with the easing comps in the next couple of quarters? Thanks.", "Thank you. Congrats on the strong quarter and thanks for taking the question. So, Amy, the on-premise server and tools business grew 5%, 7% in constant currency. It was obviously helped by Windows Server 2016, Sequel Server 2016. How should we think about, on a longer-term horizon over the next 12 months or even longer -- how those two should help on the on-premise isis or annuity business on the cloud and Azure? How should we think about the impact of that? Thanks."]}, {"name": "big revenue numbers", "questions": ["Great. Thank you very much. Amy, you noted a material improvement in Azure margins this quarter. I was just wondering if you could share with us -- given how quickly revenue is growing in this area, how fast can we see margins ramp, which obviously were negative. And now that you're getting to some big revenue numbers, is there any reason why, at a similar revenue scale you shouldn't be able to match the gross margins of what AWS -- what you can back into from the financials of AWS? Can you walk us through the puts and takes? And then once you hit that scale point, is it something that we should see inflect pretty quickly? Thank you."]}, {"name": "revenue transition", "questions": ["I just wanted to follow up, Amy. Your Commercial Other business continues to have fantastic growth. I'm wondering when you juxtapose that with the growth in the commercial licensing business -- I heard you in terms of the headwinds that you face -- but when we think about it more than one quarter out, we think about the revenue transition as you guys continue to build market share in the cloud, how do we think about the trend in the commercial licensing business in the next year or so?"]}, {"name": "margin side", "questions": ["I was wondering, Peter, if you can help -- we've heard Intel talk about Haswell and they mentioned it on the call I think it was last night, you obviously mentioned it. I guess I'm just wondering, what can you guys do to specifically help grow your tablet share, given you are reliant ex the Surface products on OEM partners to really hit a broad segment of the market? And I'm thinking in general given the OEM partners don't have much wiggle room on the margin side, what can you do to help stimulate your market share in particular in the mobility and then the tablet side? Thank you. And good luck in the future. We're going to miss you."]}, {"name": "margins", "questions": ["Peter, just on the gross margin it's been under pressure for the last several years, but this quarter it did bounce back. Can you just give us a sense of how you think gross margins will trend? And do you expect this as a stabilization, we should it expect slow improvement from here, or expect more of the same in terms of where they've been the last couple quarters?", "Amy, I'm wondering if you could talk a little bit about -- you talked about COGS in Q1 and you don't mention COGS for the rest of the year. Obviously, you have Xbox One launching in the second quarter. Could you give us some guidance about how we should think about that product having an impact on margins, maybe comparing it to the 360 or anything else you could do to help us directionally with the COGS impacts beyond Q1?", "Amy, congrats on your first conference call as CFO. My question had to do with the Windows side of the business. I know that you had an impairment charge for the inventory clearance, but even if I add that back in, it looks like the operating margins in the Windows business were sequentially lower, quite materially. Just wanted to get some insight into what drove that from the March quarter into the June quarter. As you look further out into the operating margins of the Windows business, given that you're going to be focusing on Surface, how should we think about the margin structure? I guess you have a volume threshold to clear before you can start to make a margin, given that it's more of a product. But really two parts to that question. Love to get your insights, thank you so much.", "Hi, thank you very much for all the details, as well. Maybe my math skills have gotten horribly weak, but I just took the midpoint, Amy, of your revenue guidance for the different line items, and also the midpoint of your cost of revenue inputs, and the midpoint of your OpEx. And I come up with what looks to be about a 10% reduction to where I think most sales side models are. Maybe I'm doing -- I'm hoping that I did something wrong here. But if that is the case, I get about 29% op margin relative to the 33% or so that you did last year. So can you just walk us through what are the items that you are assuming in your cost structure which effectively makes the op income flat. Although you are getting good revenue growth rate. I just wonder if there are any one-time items or if it is just emblematic of a shift in your business model to devices and consumer, especially with Nokia going forward. Wonder if we should not be thinking about op margins but really op income growth rate? Thank you.", "Excellent. Thank you for taking my question. Very nice quarter. I want to dig into gross margins in the quarter. By my estimates you guys outperformed the guidance for gross margins that you gave on the quarter, despite the fact that you saw significant out-performance in D&amp;C hardware. Which, as you were saying especially for something like Xbox One, which is just out of the gate, we had expectations of being very low if not negative gross margins. Can you help us understand a little bit of where that gross margin out-performance came from? Was any of it in D&amp;C hardware getting better yields or better gross margins on those products than your expectations? If not, where did the out-performance come from?", "Thanks. Congratulations on the margins, cost management and execution. And also, Amy, I think we all appreciate your very substantive answers to the questions. Just a follow up to an earlier question on the contracted but unbilled. We're seeing with VMWare that they had a surge of three-year contracts coming out of recession, and a lot of those are coming back for renewal now. Is that what you were suggesting as you've got an unusually large volume of contracts coming up for renewal?", "Hi. Thank you very much, Amy. I appreciate the fact that you are trying to improve the margins in each of the commercial and the consumer businesses. But the margin differential between these two businesses is still -- is a pretty wide one. It looks like the consumer business is growing. The two dynamics that I can see are the of consumer business -- the three are: one is the margin differential is too wide. You try to improve it. The marginal difference is too wide. The consumer business trend-wise is growing faster than commercial. And third is that you have the shift to the cloud. Unless you do something like an Adobe or Autodesk where you force transition to happen quickly, there is the risk that you get a lot of growth, which is fantastic. There's a lot of progress to share, but the margin inflection point could be delayed for several years. I think that what one of the questions that was spurred behind, I think presumably Heather's question, was -- that's what I'm trying to get at. So how long you are going to get this shift to result in a way that we may not see the earnings growth rate, but we have to wait to some point in time? Or are you at the point where you can actually force this shift to happen much quicker? Thank you very much.", "Thank you very much. Amy, despite the healthy gross margins, your XBox platform revenue grew $1.2 billion year over year, but your related cost of foods sold went up by $1.6 billion. I realize there may be additional costs related to launch. Wondering if you could talk to expected profitability levels for XBox for the balance of fiscal 2014.", "First, Satya, on Platform-as-a-Service, I'm kind of curious how aggressively you plan to maybe change your business model to a subscription model and drive, like adobe did, less upfront revenue, more encouraging subscription and cloud-based, and whether we should begin to anticipate what it might look like to Microsoft as you make this transition to more of a subscription business. I'm just not sure what the margins are on your cloud business and as you transition, most SaaS companies have 70%, 80% gross margins, I'm not real sure where you are on your cloud businesses today. Do we think this is going to be a smooth transition, or might we expect it to be a little more disruptive, as you gain more and more traction on a subscription and cloud basis?", "I wonder if you could talk about Office for a moment. I'm curious whether you think we've seen the worst for Office here with the consumer fall off. In Office 365 a growth in margins expanding there, just if you can look through the dynamics and give us a sense do you think you're actually have turned the corner there and we've maybe seen the worst in terms of Office growth and margins?", "Thank you guys and a very nice quarter. Perhaps a question for Amy. Really nice gross margin improvements across the board, but you did mention some one-time items. So I was hoping you could help us understand where you're seeing sort of underlying gross margin improvements, particularly if we look at sort of any improvements that you saw on the phone gross margins as well as the improvement we saw in the cloud gross margins. How much of that should we look at as durable on a going-forward basis?", "Hi, thanks. Satya, I'm wondering if you could talk about your seeing some progress on the cloud gross margins, but you're also investing pretty heavily. And I'm wondering how important it is for you kind of medium to long term to be able to get things like Bing, Xbox Live, and Office 365 running on the same infrastructure as Azure in terms of getting the kind of scale you want and ultimately driving the margins to where you want it to get to. Is that a prerequisite to get to where you'd like those margins to be?", "Hi, thank you for taking my question. Satya, I just wanted to get your perspective on the business mix, because clearly you have a very strong and growing consumer footprint especially with Nokia, and then you've got a very solid enterprise backbone. And it feels like the consumer side of the house is pulling away much faster, and obviously got some implications for how you look at the business in terms of margins and how they could potentially inflect some switchers. If you could just give us your thoughts Satya on how you see the business mix, that would be great. And also wondering, Amy, if you could shed some light on cost controls, and what were the things that specifically the Company engaged in? Because the marketing expenses came in at a nice surprise much lower than we expected. Thank you very much.", "Amy, can you give us a bit more details on what's driving the increase in cloud margins within the Commercial Other segment, as well as any sense for how accretive the cloud is becoming? Then I have a follow-up question.", "A follow-up to the question John had on Azure. Amazon released their profitability for the first time on AWS and it was higher than most people were expecting. I'm wondering how we should think about your mix of business in Azure, you're running Linux, you're running a lot of services based on open source software, you're also running some of your own IP there. How should we think about where your margins are today and should we think of Amazon's AWS margins as a good benchmark for where you could be at scale they are at today?", "That makes perfect sense. Thank you. The second one is the cloud margins improved nicely. Given the data that's in here, it looks like they've all started to move up. Azure seems to move up. You had said in the [FAM], the gross margins for 2015 should be about 44%. How should we think about cloud gross margins for 2015? I know you don't know, obviously, the mix of all of our products, but how should we think about the improvement there?", "Sure. Thank you very much. So if you look at productivity and process and intelligent cloud, obviously we're having a margin decrease that's occurring, and a good chunk of that is cloud. How should we think about the standalone license business, in terms of the margins, separated from the cloud side of it?", "Great. Thank you so much. Satya, I wanted to see if you could share a little bit on Azure? Just how you're thinking about the competitive positioning, versus Amazon, where you think your strengths are, versus them? And also, as the business continues to ramp at such a fast pace, how do we think about the progression in gross margins? I mean, Amazon gives us operating margins. But I guess, I'm wondering, is there a reason you shouldn't be able to reach similar operating margins with Azure at a similar scale, if we went back and looked at the progression that Amazon's been disclosing?", "Thanks. Amy, this one for you. I wouldn't mind asking about the gross margin guidance. If I take the midpoint of your revenue guidance, the midpoint of your COGS guidance, it looks like you're guiding to another roughly 200 basis point decline in gross margins in the June quarter, which is about what you did in March. So if we look out to FY17, I know you touched on it a little bit, but just to be clear, it feels like you're guiding to a further year-over-year decline in gross margins. But it sounds like that will be offset in part by a continued good OpEx control. So is that the right way to think about it? And is there any way that you could sort of bracket what the gross margin percentage decline might be in FY17? You probably don't want to give specific guidance, but maybe some high level color? Thanks.", "Hi, a question for Amy. Amy, you've been able to grow your Op income on a constant currency basis nicely double-digits, as you've been investing in the cloud. As you look at the results this quarter, and the -- as you pointed out the Op margins in intelligent cloud and business process productivity that were impacted due to the shift to the cloud, do you think that as you look into next year that the cloud business is at scale, that it continues to grow and take share, relative to overall revenue? The transaction business, who knows, it could be a bit of a macro pressure. Do you think that we're at the point where we could continue to entertain a scenario, that Op income could still continues to grow nicely, as it has in the last three, four quarters? Or is there some other structural change, with respect to the margin of the cloud business, or maybe the transaction business drops off a lot more dramatically, that it may be hard to sustain this nice double-digit Op income, at a very high level without going into the details? Thank you.", "Amy, I am wondering on the segment operating margins, I know you don't guide those per se, but you have flat performance in operating income in PBP and declines in IC with growth in MPC. Do you expect to see, as we get towards the end of the year, that the two enterprise cloud segments move positive and MPC is not as much of a driver? How should we think about the evolution of the product contribution of the three segments over the year?", "Great. Thank you very much. Amy, you noted a material improvement in Azure margins this quarter. I was just wondering if you could share with us -- given how quickly revenue is growing in this area, how fast can we see margins ramp, which obviously were negative. And now that you're getting to some big revenue numbers, is there any reason why, at a similar revenue scale you shouldn't be able to match the gross margins of what AWS -- what you can back into from the financials of AWS? Can you walk us through the puts and takes? And then once you hit that scale point, is it something that we should see inflect pretty quickly? Thank you.", "Thank you. Amy, I'm going to ask another question on gross margins, but this time at the Microsoft level. Your prior guidance was for ex-LinkedIn FY17 gross margins to be down 100 basis points. So the quarter you just posted gross margins ex-LinkedIn were actually up. And if I ran the math accurately, it looks like for your March quarter, ex-LinkedIn you're expecting gross margins to be about flat. It feels like you are outperforming the core Microsoft gross margin guidance you gave before. Are you sticking with the down 100, or has that improved? And if it has, what are the one or two biggest drivers of the gross margins feeling a little bit better, ex-LinkedIn? Thank you."]}, {"name": "similar revenue scale", "questions": ["Great. Thank you very much. Amy, you noted a material improvement in Azure margins this quarter. I was just wondering if you could share with us -- given how quickly revenue is growing in this area, how fast can we see margins ramp, which obviously were negative. And now that you're getting to some big revenue numbers, is there any reason why, at a similar revenue scale you shouldn't be able to match the gross margins of what AWS -- what you can back into from the financials of AWS? Can you walk us through the puts and takes? And then once you hit that scale point, is it something that we should see inflect pretty quickly? Thank you."]}, {"name": "growth", "questions": ["Thanks, guys, for the cloud data. We've been looking for a lot of this so it's very helpful. Let me ask I guess two related parts to that. Can you give us a sense on the growth metrics in terms of Office 365, which is what you're starting to give here, in terms revenue, users, customers, something that we can think about there? And the second half of it, can you give us a sense in terms of the percentage of Office 365 customers that are net new to Exchange? I know you've given just little bit of data on SMB and new SMB customers but any sense there would be appreciated. Thanks.", "You've just launched -- or Azure infrastructure as a service just went generally available this week. And I'd love to get some color on how much that's figuring in the long-term contracts, the growth in long-term contracts, and what your expectations might be for more traditional infrastructure as a service uptake over the next several quarters. Thanks.", "Good afternoon. And Peter I'll echo my sentiments as everyone else did as well. So in recent periods we've seen your MBD growth significantly outpace PC unit growth, although we now have a dynamic where your Office subscription is really resonating with customers. So the question is, just looking at this on a directional basis, is MBD revenue outperformance relative to PC units something that you think is sustainable going forward?", "I was wondering, focusing on the Server and Tools division, you guys came in with high single digit growth versus the guidance of low double digit growth. I was hoping you could walk us through some of the elements that perhaps transpired during the quarter, that caused that gap. Why you came in slightly below expectations there, and to what extent was the shift towards subscriptions a part of that.", "Amy, on the expenses, you're revising next year down, and it looks like your expense growth will materially slow from what it was this year. I'm just curious if you could help us understand where that's coming from and how you're thinking about that for next year.", "Amy, I just wanted to drill into the billings growth where we adjust for the unearned, and it's a lot higher for the Server and Tools business, which is obviously going through a transition towards more a subscription arrangement, a lot higher there than in the MBD segment. I'm just wondered if you could compare and contrast why that might be. I understand the consumer piece in MBD, but is the other piece of this just that there are more traditional licensing arrangements in MBD with enterprise customers, and so the impact from the transition is all the greater, and that's why you see that more subdued billings growth rate in MBD? Thanks.", "Amy, welcome on this first earnings call. I have a question on the business PC side, that was an area of strength for the Windows division, and you saw some growth there. Can you talk a little bit about if that's -- if you see that as a sustainable number, or is that still driven by the end of life for Windows XP? Thank you.", "Hi, thank you very much for all the details, as well. Maybe my math skills have gotten horribly weak, but I just took the midpoint, Amy, of your revenue guidance for the different line items, and also the midpoint of your cost of revenue inputs, and the midpoint of your OpEx. And I come up with what looks to be about a 10% reduction to where I think most sales side models are. Maybe I'm doing -- I'm hoping that I did something wrong here. But if that is the case, I get about 29% op margin relative to the 33% or so that you did last year. So can you just walk us through what are the items that you are assuming in your cost structure which effectively makes the op income flat. Although you are getting good revenue growth rate. I just wonder if there are any one-time items or if it is just emblematic of a shift in your business model to devices and consumer, especially with Nokia going forward. Wonder if we should not be thinking about op margins but really op income growth rate? Thank you.", "Thank you very much, and good afternoon, guys. Just two questions. First, Amy, if I recall correctly I believe last quarter you had mentioned an expectation for double-digit annuity growth in fiscal '14. Is that still how you're thinking about the annuity part of the business? And secondly, the year-over-year cloud revenue growth you reported was certainly impressive. But I was wondering if you could shed some light, perhaps, on how much of Azure billings or revenue are incremental versus cannibalistic?", "Thanks, guys. Congratulations on the great quarter. I have a question back on the Windows volume licensing side. You kind of touched on it earlier, but you saw 10% growth year over year this quarter verses 6% last quarter. So you continue to have very healthy growth here. One of the questions I've been getting from some clients is, A, what's driving that? And B, as we get closer and then actually pass the official end of life of XP, how do you think that's going to affect the growth in Windows licensing beyond that point?", "Hi. Thank you very much, Amy. I appreciate the fact that you are trying to improve the margins in each of the commercial and the consumer businesses. But the margin differential between these two businesses is still -- is a pretty wide one. It looks like the consumer business is growing. The two dynamics that I can see are the of consumer business -- the three are: one is the margin differential is too wide. You try to improve it. The marginal difference is too wide. The consumer business trend-wise is growing faster than commercial. And third is that you have the shift to the cloud. Unless you do something like an Adobe or Autodesk where you force transition to happen quickly, there is the risk that you get a lot of growth, which is fantastic. There's a lot of progress to share, but the margin inflection point could be delayed for several years. I think that what one of the questions that was spurred behind, I think presumably Heather's question, was -- that's what I'm trying to get at. So how long you are going to get this shift to result in a way that we may not see the earnings growth rate, but we have to wait to some point in time? Or are you at the point where you can actually force this shift to happen much quicker? Thank you very much.", "I'm going to give Amy a question here for numbers. Amy, we see sales and marketing expense declined 7% year-over-year in this quarter. Can you remind us if there's anything unique last year, or is this just better controls? And along these same lines, free cash flow, excluding acquisitions grew 2%, which is a bit of a surprise, given the direction the Company is going, and the first time in seven quarters we have actually seen growth in free cash flow. Can you tell us how we should be thinking about this going forward?", "I would like to focus on that server product revenue number of 10%, and Satya, I think you know a thing or two about this group, so perhaps I'll direct that to you. But that growth rate is so far still above what a lot of your megacap tech vendors, peers, I should say, are posting. I wanted to ask you if you could try to outline for us the couple of factors that have enabled Microsoft to continue growing that server business well above your peers, and secondly, if you think that 10%-ish growth is sustainable over FY15?", "Great to hear you, Satya, on the call. I had a question about device and consumer licensing. First of all, the Windows Pro revenue is very strong, and Amy, I know you had alluded to receding impact of XP upgrades, but I wanted to get a sense of how sustainable you think that growth can continue? And also noticing that the particularly Office consumer revenue is improving on attach rates, and there had been a bit of a disconnect there, because of the transition to Office 365. Wanted to get your thoughts on how long that might be sustainable, or whether this is related to the broader XP expiration? Thank you.", "Excellent. Thank you for the question and a very nice quarter. I was hoping to talk a little bit about the growth strategy at Nokia. You guys look to cut expenses pretty aggressively there, but this is -- particularly smart phones is a very competitive marketplace. Can you tell us a little bit about the strategies for how you actually start to gain share with Lumia on a going forward basis and maybe give us an idea of what levels of share or what levels of unit volumes are you going to need to hit to get to that breakeven in FY16?", "I wonder if you could talk about Office for a moment. I'm curious whether you think we've seen the worst for Office here with the consumer fall off. In Office 365 a growth in margins expanding there, just if you can look through the dynamics and give us a sense do you think you're actually have turned the corner there and we've maybe seen the worst in terms of Office growth and margins?", "I wouldn't mind focusing for a moment on the enterprise server-side. That's where at least for me much of the upside came. We haven't seen server product revenue growth in the mid-teens in a while, total Microsoft bookings, 20% ex-Nokia, haven't seen that in ages. Perhaps the answer to these questions are related, but what's happening with those two numbers to drive the upside. I'm sure a little bit came with Azure being strong, but that's relatively small. So clearly there was an inflection up on the on-prem server tools business. Maybe part of it was renewal rates, and if that's the answer how much room do we have to go on that? Thank you.", "Congrats on another great quarter. Had a question on Office 365. Obviously ya'll continue to create growth, both on a commercial and on the home and personal side. But we also saw just Office commercial products and services continue to grow 5%, so one question for Satya and one for Amy. Satya, how do you feel right now about just momentum particularly on the commercial side that you're seeing on Office 365 and sort of how you're targeting large enterprises versus SMBs? Then Amy, obviously, you've talked about some cannibalization of end-period revenue from the success of Office 365; wondering if you can help us kind of frame that 5% this quarter on the product and services, and how we should think longer term about the revenue and the profitability there? Thanks.", "Yes, thanks. I wanted to follow up on Phil's question. I think that Office transitions, our analysis suggests that that's a net benefit from here for you; I'd like to get Amy's comments and thoughts maybe about the transition for the rest of the business. If you've got server and tools, at some point -- I mean it continues to show really terrific growth, at some point I suppose that becomes cannibalized by your cloud business with Azure. Maybe Satya if you can share how you think that transition, how long, how does it transpire? Any thoughts and should it be net additive to the revenues and operating income as we've seen on the Office side? And maybe if you could talk on Windows as well, it looks like it was OEM down a little bit this quarter, which had been growing. Are we going to see a lower ASPs with these $200 devices coming out this fall?", "Satya, what do you think as you move to the cloud and really tried to go into this next phase of growth is the biggest challenge and then maybe the biggest opportunity from just a high-level as we think of Microsoft going into the next stage?", "Amy, just on the XP tail-off, are there other commercial products that you are seeing being impacted? I just wanted to be clear, there were a lot of questions that is there some type of halo impact from XP taking growth down on the other solutions?", "I just wanted to dig into Windows OEM ASPs a little bit, and just try to better understand the dynamics between what we see in the market place when we look at industry analysts that we're looking at, basically flat to slightly down unit grown -- and the down 13% OEM revenue growth that you guys are seeing on some of this mix and some of this ASP. I was wondering if you can help us with a little bit more color in terms of exactly what that ASP dynamic is going on in terms of these lower entry-level additions? What's that doing to the overall ASP of what you're able to extract from the market?", "Thanks, guys. I've got a question on the Commercial Other line. Obviously that continues to show strong growth. You've been calling out the cloud business, whether it be Azure or Office 365. I wanted to double-click on the Azure side. Wondering if you can help us parse through the infrastructure as a service and the platform as a service side, and the trends there, and any sort of joint benefit, I guess, that you're seeing in being able to offer both those two? Also Satya, as this business does scale -- and then Amy I'd love you to chime in here, too -- how do you think about the gross margin and operating margin characteristics, once again, as the revenue continues to grow here?", "I just wanted to follow up, Amy. Your Commercial Other business continues to have fantastic growth. I'm wondering when you juxtapose that with the growth in the commercial licensing business -- I heard you in terms of the headwinds that you face -- but when we think about it more than one quarter out, we think about the revenue transition as you guys continue to build market share in the cloud, how do we think about the trend in the commercial licensing business in the next year or so?", "Very nice quarter. One of the highlights of the past year has definitely been the expense control, and I guess, a normalized OpEx growth of just 1% of the quarter, continues to be very impressive. How should investors, or how should we think about the sustainability of that expense control? How long can you keep investing for these growth initiatives like cloud, yet keep the overall OpEx growth rate so low on a go forward basis?", "Congrats on a great quarter. I wanted to double click on Office 365. You guys showed another huge quarter of growth in terms of consumer seat count and I think it was 86% growth on the commercial other side for Office 365. What have you just drill into the consumer and then the enterprise side, just the trends you're seeing there and obviously the guidance you all just provided looks like you expect those trends to continue in Q1. So any color there would be great.", "Good afternoon, Satya, the server business continues a steady out-performance and as Amy pointed out, better growth than your peers. Couple of questions as it relates to the Windows 2003 retirement and any impact you're seeing there. And secondarily if you can just comment on some of the new product launches. Seems like there is a stack of new solutions that are coming on the server side that look pretty exciting and your partners are excited about it. If you could highlight what you see as the most interesting from your perspective over the next several quarters.", "Nice quarter. When I drill in, in terms of move to the cloud, this quarter year over year server product and services revenue growth was slower than in the past quarters. How much of that is because you're seeing now some revenue shift to Azure? Or is it not yet seeing any revenue shift going? And then I have a follow-up question.", "I had one quick follow up, if I could. That is helpful. On Analysts Day you did talk about I think it was 8% unit growth for the Office ecosystem over the last three years and sounds like you continued to see nice unit growth in Office. How should we think about that going forward? Are you fully expecting to continue to see unit growth? And also just a clarification. I think your customer lifetime value was based on existing SKUs. So as you introduce E5 and others, does that open up potential for even higher customer lifetime value?", "I just had two quick questions. I was wondering, Satya, if you could give us a sense for a high-level commentary about the split of IaaS versus PaaS and Azure? And maybe some color on the growth you see in each of those and how you see them evolving? Then the second question would be related to the launch of Windows 10. You gave the Bing example for the month of September and the solid pull-forward there -- or pull-along there. I'm just wondering if you could share with us any other areas where you're seeing a similar pull along with Windows 10 adoption. Thank you.", "Besides Azure in the Intelligent Cloud, you obviously have very, very good momentum on the classic server [and tools] business. Can you talk a little bit about the volume versus price effect that you see playing out here and how is it now and how do you expect that to play out going forward? One of the things on Azure was usage, and you mentioned how that improved quite significantly. Satya, can you talk a little bit where you see that current usage standing and where do you think that can go? We obviously didn't get a number, just a growth rate, but where do we see usage, because that's obviously one of the things that one of your competitors keeps [poking] -- trying to knock on you?", "Amy, I'm wondering if you could talk about, on the computing side, the Personal Computing side, you talked about this quarter seeing growth ahead of the PC market. You alluded to a diversity of devices coming in the second half. How do you think about that variable in the model, say, beyond this launch period where you have a little bit of a differing mix going on in devices? When you get to more of a steady-state out in years two and three of the Windows 10 launch, do you think you can grow ahead of the PC market, or do you think -- I know for the last few years, you've grown below the PC market. Just wondering how we should think about that?", "Congrats on a great quarter. I just wanted to focus in on commercial cloud and Azure specifically. Commercial cloud, as you mentioned, the run rate was up $9.4 billion. That's up like $2 billion quarter to quarter, 70% year over year. That's higher growth rate than even last quarter. Azure [similar, if not even] accelerating growth versus even last quarter. So a question, Satya, and I'll follow up for Amy. Satya, when you look at the growth rates there in commercial cloud, and particularly Azure, you talk about new customer wins but also existing customers transitioning more workloads to Azure. I hope you can give us maybe some more color there as far as what you're seeing and how you think about the growth going forward there? And then Amy, based on our calculations, it seems like Azure had a meaningful improvement in just the gross margin year over year. Wondering if you could help us with the two curves in that business, and sort of where we are in Azure's gross margin lifecycle? Again, the fixed costs and the variable costs and how you are thinking about that? Thanks.", "Thank you very much. I was just wondering, Satya, you mentioned, and I know there is been a lot of questions on Azure, but you mentioned strong growth in compute, and SQL usage on Azure being up, I think you said 5 times. I was wondering if you could give us your take on how you see the mix of Azure workloads? Is it right now more new workload growth and it's very little existing workloads moving over? I'm just trying to get a sense for kind of how you see the wave cresting for new workloads versus existing workloads that can migrate over. I'm also wondering if you see it helping (technical difficulties). You mentioned it is like a design win or an ISV win. I am wondering if you could share with us how this might be impacting your share versus, say, 1X or versus other types of infrastructure platforms. Thank you.", "And then if I can just -- one other numbers question. It looked like in the Q you called out actually Windows server declining as an offset to Intelligent Cloud growth. I'm wondering, we haven't seen that comment in the Q before. Was there something, sort of one-off driving that, or any further detail on that?", "Thanks a lot. Amy, I just wanted to go back on the intelligent cloud. We did see that deceleration in server product growth, but the comp was very tough. And as you commented, your annuity was up, and your deferred growth accelerated. That server product line has grown about 5% constant currency in the last 12 months. I guess the question is, is there any structural reason why, going back to Keith's question, why that would decelerate more ex macro? And then, another question I just had that's related to this. Can you just remind us, in the server product ex Azure line, and in the commercial office traditional non 365 line, how much is transactional in those two segments? Thank you.", "It's good to see that you still expect profit to grow, because this seems like the new Microsoft, where you're balancing the need to invest strategically, but at the same time trying to grow profits in the near-term, versus the old Microsoft, where the investments were made, but with more of a longer term, quote/unquote, you never knew when the payoff was supposed -- was going to happen. So it's good to see you emphasize that you're still focused on profit growth, notwithstanding the mix of factors that you cannot forecast.", "Thank you. Amy, how much of the weakness in transactional has been caused by clients that otherwise would have bought a license now under annuity? In other words, are you driving the transactional weakness to some extent by driving the growth in on-prem? And then I have a quick follow-up for Satya.", "Two questions on the Office side; first of all, you obviously reaching very large numbers in terms of the numbers of seats that you have. Can you talk a little bit about what's the seat growth because, both for consumer and for commercial, it seemed to be coming down? Is that kind of the law of large numbers coming in or is there anything else? And then the consumer Office, the consumer Office performance was very, very strong and that almost needs to be stronger from transactions because otherwise I don't get to the numbers. Can you talk a little about the source of the strength there? Thank you.", "Okay. Thanks very much and good afternoon. Amy, you spoke about a slowdown in the Cloud CapEx growth curve in FY17. I assume you're referring to the growth in absolute dollars moderating and not just the rate of change in percentage terms? But any additional color that you could provide on the Company's CapEx requirements over the course of the next year would be appreciated.", "Yes, thank you very much. Satya, we noticed Office 365 commercial seat growth of 45% produced Office 365 commercial revenue growth of 59% in constant currency. So a favorable spread of about 14 points suggesting ASP growth. Wondering if you could help us understand the drivers, both now and into the future, particularly in terms of the initial response to the E5 plan, and also which products you think are driving the strength as you consider across Exchange, Skype for Business, Power BI, Yammer, SharePoint, et cetera.", "Thank you, guys, for taking the question, and very nice quarter. I want to zero in on Office 365 a little bit. 40% growth in commercial seats is a really nice number, but even a nicer number on the revenue line, I think 54% constant currency growth in Office 365 commercial. That seems to imply you guys are seeing some nice ASP increase as the platform matures. Can you talk to us about where we are in that cycle of guys moving from E1 to E3? Is E5 part of the equation yet; are guys actually moving there yet?", "Great, thank you. Satya, I know that Brent asked you about Azure, but I'm just wondering if you could share with us, you mentioned that compute usage on Azure, I think you said more than doubled or nearly doubled, something to that effect. I'm just wondering if you could share with us how you see paths coming along and where do you think we are in getting the easier workloads to the cloud? And are you now starting to see the inflection, given we did see an inflection in growth on a year-over-year basis this quarter where you are starting to see significant production workloads that are on-premise actually starting to move over as well?", "Amy, I am wondering on the segment operating margins, I know you don't guide those per se, but you have flat performance in operating income in PBP and declines in IC with growth in MPC. Do you expect to see, as we get towards the end of the year, that the two enterprise cloud segments move positive and MPC is not as much of a driver? How should we think about the evolution of the product contribution of the three segments over the year?", "Hi. Thanks, Amy. I'm wondering if you could talk about -- we're still seeing the majority, or really all the growth, in operating profits come from MPC in the year-over-year basis. And I'm wondering how we should think about the factors impacting and the timing in the handoff of profit growth from MPC to IC and PBP? Is that something that you expect? What are the factors and timing there?", "Yes. Thank you. Satya. I'm wondering what you think would be required to extend the hyper growth trajectory for Azure into the future. For example, are there incremental waves of activity on the horizon that you would tie to Tier 1 workloads, or large data center migrations, or serverless usage which would enable that? And separate from that, Amy, I'm curious just philosophically, how do you plan to handle price cuts for compute and storage when they occur? Do you think you're better off matching them, exceeding them? Or does it make sense, perhaps, warranting a Premium in many cases due to the differentiated IP that you have up the stack?", "Thanks for taking my question. I just wanted to focus back in on Office 365 on the commercial front. You have another strong quarter of revenue growth, obviously at 49% constant currency, but it continues to meaningfully outpace the seat growth, which is still strong, but 37%. That commentary that you all are giving about premium mix in the past -- two questions here. First, to Satya, when you think about where we are in the progression -- call it up to E5, so to speak, or E3. How do you think this plays out? And how do you think about the mix of unit growth versus that premium mix and translating it to revenue? And then to Amy, I'd argue that maybe we've done the low margin, or low gross margin parts of the Office 365 transition. And now as this mix goes up, you're actually not just increasing revenue, but the margin is better, too. Is that fair? And then, how do you tie that back to your commercial cloud gross margin expectations long term?", "Thanks so much, and congratulations from me, as well. Two questions. One for Amy first. When we look at CapEx, it actually declines year over year ex capital leases, but even with capital leases, the growth rate decelerated. And for the full year, it's obviously a pretty wide range, roughly 0% to 40% growth. I'm just curious, Amy, with LinkedIn, have you made any changes to your CapEx assumptions for core Microsoft? I guess I'm pointing to the fact that it did seem to decelerate quite a lot this quarter. I wondered if there is any additional color you could frame around growth rate for all-up Cap-Ex plus capital leases. Thanks."]}, {"name": "cloud", "questions": ["Thanks, guys, for the cloud data. We've been looking for a lot of this so it's very helpful. Let me ask I guess two related parts to that. Can you give us a sense on the growth metrics in terms of Office 365, which is what you're starting to give here, in terms revenue, users, customers, something that we can think about there? And the second half of it, can you give us a sense in terms of the percentage of Office 365 customers that are net new to Exchange? I know you've given just little bit of data on SMB and new SMB customers but any sense there would be appreciated. Thanks.", "Excellent. Thank you, guys, for taking my question; and nice quarter. I want to ask about the impact -- you mentioned on the call that going to subscription revenues does have a near-term impact on revenues. I was wondering if you can help us out and understand whether we're seeing that impact today and perhaps to what degree with the strong uptake of some of the cloud services, particularly like Office 365?", "Can you give us some color on the short-term revenue impact of the move to the cloud? Is it just MBD? Is also in Server and Tools? How does the license revenue convert to cloud revenue?", "Just a follow-up on actually both those two. First, Amy obviously when you go to a subscription model you have less upfront, lower billings that first year versus license. Wondered if you give us sort of a backfill, where a $1 of cloud or Office 365 revenue would have been, in that first year would have been $3 relative to license. Just so we can try to backfill and help with that transition? And also actually to Walter's question about Xbox COGS, maybe give us a sense for if this cycle really should be any different than previous cycles when you thought about pricing relative to the cost of the console itself. Thanks.", "Amy, you had discussed your increased CapEx this quarter, and I was wondering if you could address the margin profile of your cloud services. In the comments, you discussed how you have higher datacenter cost, and what I'd like to understand is whether this is temporary, as you are ramping up this transition towards subscription business, or whether this actually changes the gross margin profile of these revenues. Thanks.", "Beautiful. One other quick question. Any sense for what commercial licensing would've been if not for the move to cloud and subscription? Does it make a material change at this point?", "Just to follow-up on Mark's question, I believe there was a slide at [STAM] that showed about $150 million of negative impact in the quarter from the move to the cloud. Which, in and of itself, it's about 1% of revenue, so it's not a very big deal. And I think most of that was from Office versus server and tools. So, if you say it is about as expected -- I'm just looking for some clarification here -- is really the only impact we're seeing in the Office segment versus server and tools? Or was there much impact in that part of the business from the move to subscription?", "I was wondering if you could address the conditions in China in a little bit more detail, not just on the consumer but also in the commercial, as well as what your expectations might be given the lifting of the ban on game consoles for Xbox there. And also if you could just address some of what you're seeing in terms of your commercial cloud adoption outside of the US. Thank you.", "Sure. I was wondering about Xbox expectations there, but also the trends of commercial cloud adoption in areas outside of the US.", "Thank you very much, and good afternoon, guys. Just two questions. First, Amy, if I recall correctly I believe last quarter you had mentioned an expectation for double-digit annuity growth in fiscal '14. Is that still how you're thinking about the annuity part of the business? And secondly, the year-over-year cloud revenue growth you reported was certainly impressive. But I was wondering if you could shed some light, perhaps, on how much of Azure billings or revenue are incremental versus cannibalistic?", "Thank you very much for fitting me in. Two quick ones for you, Amy, on the commercial cloud offerings. First round Office 365 you mentioned you've seen pretty good uptake even outside the US. I was interested in just your ability to monetize Office 365 in some of the emerging markets that have been challenging over time for Office. And then, secondly, as a follow-up to Greg's question on server, within Azure how much of the uptake in Azure is coming from existing Microsoft logos versus bringing on net new logos onto the platform? Thanks.", "Thank you. Obviously nice upside on the hardware business and with Surface and Xbox. But my question is on the licensing business, so bear with me a little bit here. You had both licensing businesses, device and consumer and commercial licensing, they were both better than expected at least by about $100 million each. At the same time, deferred revenue was shy by something like $250 million. But there is some conflicting things. I am just trying to get my head around this. The contract not billed, Amy, you pointed out was really strong, saw a big jump by somewhere around $2 billion sequentially. And you also saw some nice traction, the commercial cloud services more than doubled. Assuming it's small. Here's my question. With all that happening, is there a shift happening with your on-premise corporate business to more transactional versus ratable contracts? That would help out, to help offset the financial implications as you shift to cloud services on the corporate side. Is that's what's happening with all these movements? Sorry about all the detail.", "Okay. And last quarter we talked a bit about, are there any metrics you can help us to understand better what the effect of your revenues is from the shift to the cloud? I think on Office it's more of a net, a delta that, I think you said it hurts you about $150 million in the previous quarter. Is there any way you can give us a sense of what the net impact is on the business from the shift to cloud?", "That implies it would only be down about 8% were it not for the shift to the cloud?", "Hi. Thank you very much, Amy. I appreciate the fact that you are trying to improve the margins in each of the commercial and the consumer businesses. But the margin differential between these two businesses is still -- is a pretty wide one. It looks like the consumer business is growing. The two dynamics that I can see are the of consumer business -- the three are: one is the margin differential is too wide. You try to improve it. The marginal difference is too wide. The consumer business trend-wise is growing faster than commercial. And third is that you have the shift to the cloud. Unless you do something like an Adobe or Autodesk where you force transition to happen quickly, there is the risk that you get a lot of growth, which is fantastic. There's a lot of progress to share, but the margin inflection point could be delayed for several years. I think that what one of the questions that was spurred behind, I think presumably Heather's question, was -- that's what I'm trying to get at. So how long you are going to get this shift to result in a way that we may not see the earnings growth rate, but we have to wait to some point in time? Or are you at the point where you can actually force this shift to happen much quicker? Thank you very much.", "Thank you very much. Satya, welcome on board, and thanks for joining the call. If you don't mind, I'm going to ask an overall question either of Amy or of Satya. Looking at the commercial license business, how much of the shrinkage year-over-year in commercial license is driven by the move of traditional license players from license or -- licensed paying customers, from license to the cloud? How much is related to guys moving from software assurance, how much from license? Can you give any color in there?", "First, Satya, on Platform-as-a-Service, I'm kind of curious how aggressively you plan to maybe change your business model to a subscription model and drive, like adobe did, less upfront revenue, more encouraging subscription and cloud-based, and whether we should begin to anticipate what it might look like to Microsoft as you make this transition to more of a subscription business. I'm just not sure what the margins are on your cloud business and as you transition, most SaaS companies have 70%, 80% gross margins, I'm not real sure where you are on your cloud businesses today. Do we think this is going to be a smooth transition, or might we expect it to be a little more disruptive, as you gain more and more traction on a subscription and cloud basis?", "Thank you and congrats on the quarter. Two quick questions relating to cloud. Amy, can you give us a sense of what the revenue run rate for the commercial cloud was this quarter? And Satya, could you give us a little more on the use cases for Azure. Is it more test and dev, or are you seeing most of it being on the production side? Thanks.", "Thank you guys and a very nice quarter. Perhaps a question for Amy. Really nice gross margin improvements across the board, but you did mention some one-time items. So I was hoping you could help us understand where you're seeing sort of underlying gross margin improvements, particularly if we look at sort of any improvements that you saw on the phone gross margins as well as the improvement we saw in the cloud gross margins. How much of that should we look at as durable on a going-forward basis?", "Yes, thanks. I wanted to follow up on Phil's question. I think that Office transitions, our analysis suggests that that's a net benefit from here for you; I'd like to get Amy's comments and thoughts maybe about the transition for the rest of the business. If you've got server and tools, at some point -- I mean it continues to show really terrific growth, at some point I suppose that becomes cannibalized by your cloud business with Azure. Maybe Satya if you can share how you think that transition, how long, how does it transpire? Any thoughts and should it be net additive to the revenues and operating income as we've seen on the Office side? And maybe if you could talk on Windows as well, it looks like it was OEM down a little bit this quarter, which had been growing. Are we going to see a lower ASPs with these $200 devices coming out this fall?", "Hi, thanks. Satya, I'm wondering if you could talk about your seeing some progress on the cloud gross margins, but you're also investing pretty heavily. And I'm wondering how important it is for you kind of medium to long term to be able to get things like Bing, Xbox Live, and Office 365 running on the same infrastructure as Azure in terms of getting the kind of scale you want and ultimately driving the margins to where you want it to get to. Is that a prerequisite to get to where you'd like those margins to be?", "Satya, what do you think as you move to the cloud and really tried to go into this next phase of growth is the biggest challenge and then maybe the biggest opportunity from just a high-level as we think of Microsoft going into the next stage?", "Amy, can you give us a bit more details on what's driving the increase in cloud margins within the Commercial Other segment, as well as any sense for how accretive the cloud is becoming? Then I have a follow-up question.", "One question on Office 365 commercial. Can you talk about deployment rates there? I know you've done a good job of getting those into contracts. How many customers are actually running it -- running their e-mail and SharePoint and other products in the cloud, versus just having the rights to it?", "Thanks, guys. I've got a question on the Commercial Other line. Obviously that continues to show strong growth. You've been calling out the cloud business, whether it be Azure or Office 365. I wanted to double-click on the Azure side. Wondering if you can help us parse through the infrastructure as a service and the platform as a service side, and the trends there, and any sort of joint benefit, I guess, that you're seeing in being able to offer both those two? Also Satya, as this business does scale -- and then Amy I'd love you to chime in here, too -- how do you think about the gross margin and operating margin characteristics, once again, as the revenue continues to grow here?", "I just wanted to follow up, Amy. Your Commercial Other business continues to have fantastic growth. I'm wondering when you juxtapose that with the growth in the commercial licensing business -- I heard you in terms of the headwinds that you face -- but when we think about it more than one quarter out, we think about the revenue transition as you guys continue to build market share in the cloud, how do we think about the trend in the commercial licensing business in the next year or so?", "You had great momentum in the cloud. I'm curious if you could talk about the positioning both in on-prem and [COD] environments and also weave in what you're seeing with Azure.", "Very nice quarter. One of the highlights of the past year has definitely been the expense control, and I guess, a normalized OpEx growth of just 1% of the quarter, continues to be very impressive. How should investors, or how should we think about the sustainability of that expense control? How long can you keep investing for these growth initiatives like cloud, yet keep the overall OpEx growth rate so low on a go forward basis?", "Thanks. It sounds like cloud Azure represents an opportunity to transition existing customers to a cloud model, but also to expand your customer base or penetrate -- penetration into your current customer base with -- incremental business is what I'm talking about. I think that most of Office 365, because most people were already on Office, represents transitions from the license model. But so far, and I know it's still early, but so far, what about the rest? Can you give us an idea of how much of this is new business and how much of this is transition business?", "Thanks. I want to be clear because you said something -- other than Office 365, did you say the majority of the cloud business is new business? Again, I know it can't be -- maybe you know exactly what it is, but I'm sure some of it is somewhat cloudy -- no pun intended -- or vague. Do you think most it at this point is new business? Is that what I heard you say?", "Thank you. Satya, I'm wondering what inning you think we are in, in terms of building out the next generation data centers that you'll need to support the commercial cloud. For example, do you think you've built out data center capacity to support the commercial cloud business all the way to a $10 billion run rate or a $20 billion run rate? If there's any way you can help us to try to gauge how much overhead you have in the capacity, and perhaps what type of data center footprint you envision a few years down the road?", "Nice quarter. When I drill in, in terms of move to the cloud, this quarter year over year server product and services revenue growth was slower than in the past quarters. How much of that is because you're seeing now some revenue shift to Azure? Or is it not yet seeing any revenue shift going? And then I have a follow-up question.", "Very nice quarter, indeed. I wanted to ask about the Azure, in particular, and the public cloud [forms] that you saw this quarter. Again, seems like you're seeing an acceleration in that overall business. More broadly, it seems like industry-wide, both you guys and [eight of us] are seeing something of an inflection point going on in terms of more and more business accruing to those public cloud environments. So my question is just that. Would you agree with that statement that there's been an inflection going on in the business? And if so, what do you think is causing that and is there a changing in nature in how people are using that cloud? And then maybe for Amy, is there something we should bear in mind in terms of your traditional business, the on-premise business that may be impacted as that infection takes place that we should bear in mind as you go forward?", "Congratulations on the quarter, everyone. Two questions. Let me relate it. Let me give you the first one. The commercial cloud annualized revenue run rate grew slightly from $8 billion to $8.2 billion or a little bit more than each of those, yet Office 365, Azure, Dynamics, CRM Online, all of them seem to be growing very fast. How should we think about the difference, should we figure that the run rate reaccelerates next quarter? And then I have a follow-up?", "That makes perfect sense. Thank you. The second one is the cloud margins improved nicely. Given the data that's in here, it looks like they've all started to move up. Azure seems to move up. You had said in the [FAM], the gross margins for 2015 should be about 44%. How should we think about cloud gross margins for 2015? I know you don't know, obviously, the mix of all of our products, but how should we think about the improvement there?", "And then on the commercial licensing part, specifically within productivity, I know you had an old breakout and a new breakout where we don't see commercial licensing necessarily within productivity, but would you expect that piece, the commercial licensing within productivity, given the transition going on, to be stable, or with that decline as you see the transition over to the cloud in productivity, specifically?", "Amy, I see the commercial bookings numbers in the KPI sheet, but I do not see the total bookings numbers. I'm wondering if you could comment on that, so that we can try to maintain a consistent analysis there, if it's relevant? Also, Satya, now that SQL Server has taken over this number one position in the Gartner Quadrant for the database market, could you help us understand how the road map evolves from here? As we did notice, Amazon made its debut also in the leaders' quadrant and we're trying to understand how the movement to cloud platforms like Azure could further alter the database landscape and how you could capitalize on that?", "Congrats on a great quarter. I just wanted to focus in on commercial cloud and Azure specifically. Commercial cloud, as you mentioned, the run rate was up $9.4 billion. That's up like $2 billion quarter to quarter, 70% year over year. That's higher growth rate than even last quarter. Azure [similar, if not even] accelerating growth versus even last quarter. So a question, Satya, and I'll follow up for Amy. Satya, when you look at the growth rates there in commercial cloud, and particularly Azure, you talk about new customer wins but also existing customers transitioning more workloads to Azure. I hope you can give us maybe some more color there as far as what you're seeing and how you think about the growth going forward there? And then Amy, based on our calculations, it seems like Azure had a meaningful improvement in just the gross margin year over year. Wondering if you could help us with the two curves in that business, and sort of where we are in Azure's gross margin lifecycle? Again, the fixed costs and the variable costs and how you are thinking about that? Thanks.", "Very nice quarter, guys. And thank you for taking the question. Satya, you mentioned both new and existing customers increasingly using the Azure cloud. I was hoping you could give us some color into what that looks like, specifically when an existing customers starts using Azure in terms of how does their overall spending get impacted and what happens to sort of their spending for the more traditional server and tools? How does that get impacted as people use the public cloud utility more and more?", "Thank you. Satya, Amy, congrats on the quarter. I've got for Satya and then a quick follow-up with Amy. Satya, following up on the cloud discussion, recognizing that SaaS, Pass, infrastructure as a server hybrid, they're all related, but as Azure continues to grow fast and become a bigger part of the business, how should we think about the opportunities or the opportunity size for Pass versus infrastructure as a service? Pass is much smaller industry-wide today, but is the opportunity is big, bigger? How should we think about that? And then a follow-up for Amy.", "Good afternoon. Amy, just on the Q4 guide. You're guiding below the Street on many of the individual line items on the top line. I'm just curious, is this more of the shift to the cloud, or is there some demand execution issues that you're seeing in the business?", "Sure. Thank you very much. So if you look at productivity and process and intelligent cloud, obviously we're having a margin decrease that's occurring, and a good chunk of that is cloud. How should we think about the standalone license business, in terms of the margins, separated from the cloud side of it?", "Thanks a lot. Amy, I just wanted to go back on the intelligent cloud. We did see that deceleration in server product growth, but the comp was very tough. And as you commented, your annuity was up, and your deferred growth accelerated. That server product line has grown about 5% constant currency in the last 12 months. I guess the question is, is there any structural reason why, going back to Keith's question, why that would decelerate more ex macro? And then, another question I just had that's related to this. Can you just remind us, in the server product ex Azure line, and in the commercial office traditional non 365 line, how much is transactional in those two segments? Thank you.", "Hi, a question for Amy. Amy, you've been able to grow your Op income on a constant currency basis nicely double-digits, as you've been investing in the cloud. As you look at the results this quarter, and the -- as you pointed out the Op margins in intelligent cloud and business process productivity that were impacted due to the shift to the cloud, do you think that as you look into next year that the cloud business is at scale, that it continues to grow and take share, relative to overall revenue? The transaction business, who knows, it could be a bit of a macro pressure. Do you think that we're at the point where we could continue to entertain a scenario, that Op income could still continues to grow nicely, as it has in the last three, four quarters? Or is there some other structural change, with respect to the margin of the cloud business, or maybe the transaction business drops off a lot more dramatically, that it may be hard to sustain this nice double-digit Op income, at a very high level without going into the details? Thank you.", "Excellent. Thank you for taking the question, and very nice quarter. I wanted to dig into Azure and maybe one question for Satya and one question for Amy. Satya, you mentioned the Boeing agreement. What was interesting about that is, not just a large company moving significant workloads onto Azure, but from my reading, sounds like there's a distribution side of this agreement that you are going to help distribute some of those applications on a going-forward basis. I was wondering if you could touch a little bit on that? Is that a one time thing or is that something that you look to do more often with some of these large companies? Moving workloads onto Azure. And then for Amy. Thank you for the additional detail on the cloud gross margin profile on a going forward basis. When we dig into just Azure, you said in the past that you expect to match the gross margin profile of what we're seeing in Amazon web services. Does that commentary still hold? And then you could give us a sort of mark-to-market on how you're doing in terms of matching up Azure's gross margin profile to what you've seen from your top competitor there?", "Just to be clear, Amy, in terms of the sales motion, are they incented more towards cloud versus transactional going into this year?", "Great, thank you. Satya, I know that Brent asked you about Azure, but I'm just wondering if you could share with us, you mentioned that compute usage on Azure, I think you said more than doubled or nearly doubled, something to that effect. I'm just wondering if you could share with us how you see paths coming along and where do you think we are in getting the easier workloads to the cloud? And are you now starting to see the inflection, given we did see an inflection in growth on a year-over-year basis this quarter where you are starting to see significant production workloads that are on-premise actually starting to move over as well?", "Thank you, and congrats on the quarter. So want to drill in a little more. The margin for commercial cloud improved 7%, which given the size, is a large improvement. Can you give us some more details on what exactly is driving that margin improvement? You said it's going to be improving over the year, but how sustainable is that drive to improvement?", "Amy, I am wondering on the segment operating margins, I know you don't guide those per se, but you have flat performance in operating income in PBP and declines in IC with growth in MPC. Do you expect to see, as we get towards the end of the year, that the two enterprise cloud segments move positive and MPC is not as much of a driver? How should we think about the evolution of the product contribution of the three segments over the year?", "Thanks for taking my question, and congrats as well. Quick question more on an industry theme for Satya. We obviously saw a very interesting answer from AWS and VMware, which seems to suggest a hybrid cloud is the way forward, and both vendors have to react. Can you talk a little bit about your customer feedback around the hybrid cloud offering from you, and how your customer is thinking about that working with you together? Thank you.", "Excellent. Very nice quarter, guys. Thank you for taking the questions. I wanted to ask a question about LinkedIn -- what our expectations should be for achieving revenues synergies on LinkedIn. It seems like there's a lot of real interesting things you can do with that asset, and combining with your own portfolio. And how should we think about the potential for achieving some expense synergies? Obviously, there's a big cloud base that you could utilize under their assets, and Amy [being bullish] and very good at keeping expenses very well-managed. So, as we go forward past the [forward] quarter, how should we think about the timeframe for achieving those benefits?", "Thank you. Congrats on the strong quarter and thanks for taking the question. So, Amy, the on-premise server and tools business grew 5%, 7% in constant currency. It was obviously helped by Windows Server 2016, Sequel Server 2016. How should we think about, on a longer-term horizon over the next 12 months or even longer -- how those two should help on the on-premise isis or annuity business on the cloud and Azure? How should we think about the impact of that? Thanks.", "Hi. Congrats on finishing up a great quarter, as well. One for you, Amy, one for you, Satya. One, Amy, when I look at your comments on gross margin, clearly you're not in a position to break out Azure-only gross margin. But I'm wondering if you could take -- come past your commercial cloud targets were about $20 billion. So if I take what I believe could be a rough split between Azure versus the SaaS segment and look at the best (abrate) companies, I could get to about 70%, 75% gross margin when you hit your targets. Curious what you think about that. Is that too aggressive, or within the ballpark? And for you, Satya, as cloud computing moves to the enterprise, there's some belief among investors that AWS is going to be a big, strong competitor in the enterprise, so just typically not the stronghold for them. How do we think of Microsoft's enduring strength in the enterprise? And how confident can we be that you should be able to capture your fair share of enterprise workloads as they move to the cloud? Thank you.", "Thanks for taking my question. I just wanted to focus back in on Office 365 on the commercial front. You have another strong quarter of revenue growth, obviously at 49% constant currency, but it continues to meaningfully outpace the seat growth, which is still strong, but 37%. That commentary that you all are giving about premium mix in the past -- two questions here. First, to Satya, when you think about where we are in the progression -- call it up to E5, so to speak, or E3. How do you think this plays out? And how do you think about the mix of unit growth versus that premium mix and translating it to revenue? And then to Amy, I'd argue that maybe we've done the low margin, or low gross margin parts of the Office 365 transition. And now as this mix goes up, you're actually not just increasing revenue, but the margin is better, too. Is that fair? And then, how do you tie that back to your commercial cloud gross margin expectations long term?"]}, {"name": "server side", "questions": ["Thanks so much. Amy, you mentioned briefly in your comments some of the strengths you had seen in SQL Server. That seems to be taking market share. You highlighted a couple of the features, but what do you think is driving that market share gain? And a similar question over on the server side where you seem to have better server numbers than what we have seen in units. What would be accounting for that additional strength?", "Two quick questions. Satya, I wanted to follow up on Phil Winslow's question earlier on Azure and the use cases there. In theory you have a huge opportunity, given your install base on the server side. Can you talk a little bit about what you are seeing the SMB customer base doing there? Are we in that people trying on bursting, or where is that huge customer base in terms of adoption on Azure?", "Good afternoon, Satya, the server business continues a steady out-performance and as Amy pointed out, better growth than your peers. Couple of questions as it relates to the Windows 2003 retirement and any impact you're seeing there. And secondarily if you can just comment on some of the new product launches. Seems like there is a stack of new solutions that are coming on the server side that look pretty exciting and your partners are excited about it. If you could highlight what you see as the most interesting from your perspective over the next several quarters."]}, {"name": "revenue", "questions": ["Thanks, guys, for the cloud data. We've been looking for a lot of this so it's very helpful. Let me ask I guess two related parts to that. Can you give us a sense on the growth metrics in terms of Office 365, which is what you're starting to give here, in terms revenue, users, customers, something that we can think about there? And the second half of it, can you give us a sense in terms of the percentage of Office 365 customers that are net new to Exchange? I know you've given just little bit of data on SMB and new SMB customers but any sense there would be appreciated. Thanks.", "Excellent. Thank you, guys, for taking my question; and nice quarter. I want to ask about the impact -- you mentioned on the call that going to subscription revenues does have a near-term impact on revenues. I was wondering if you can help us out and understand whether we're seeing that impact today and perhaps to what degree with the strong uptake of some of the cloud services, particularly like Office 365?", "Good afternoon. And Peter I'll echo my sentiments as everyone else did as well. So in recent periods we've seen your MBD growth significantly outpace PC unit growth, although we now have a dynamic where your Office subscription is really resonating with customers. So the question is, just looking at this on a directional basis, is MBD revenue outperformance relative to PC units something that you think is sustainable going forward?", "Can you give us some color on the short-term revenue impact of the move to the cloud? Is it just MBD? Is also in Server and Tools? How does the license revenue convert to cloud revenue?", "Just a follow-up on actually both those two. First, Amy obviously when you go to a subscription model you have less upfront, lower billings that first year versus license. Wondered if you give us sort of a backfill, where a $1 of cloud or Office 365 revenue would have been, in that first year would have been $3 relative to license. Just so we can try to backfill and help with that transition? And also actually to Walter's question about Xbox COGS, maybe give us a sense for if this cycle really should be any different than previous cycles when you thought about pricing relative to the cost of the console itself. Thanks.", "Amy, you had discussed your increased CapEx this quarter, and I was wondering if you could address the margin profile of your cloud services. In the comments, you discussed how you have higher datacenter cost, and what I'd like to understand is whether this is temporary, as you are ramping up this transition towards subscription business, or whether this actually changes the gross margin profile of these revenues. Thanks.", "Just a follow-on, a bit on Kash's question. With Windows revenue coming in where it did, we're getting a few questions from investors about how Windows fared this quarter, relative to PC units. If we were to exclude tablet revenues both Surface and otherwise, just wondering, Amy, if you might be able to say roughly on a year-over-year basis how Windows PC revenue compared to the low double digit PC unit decline, cited by the IDCs and Gartners?", "Good afternoon, Amy and Chris. Thanks for the additional details. I know everyone appreciates the forward-looking details. My question is on the commercial revenue. Obviously an impressive number in a seasonally soft Q1. Your guidance assumes also a continued good trajectory. Maybe if you can walk through why you think you are outgrowing your peers and what has led to this double-digit number.", "Thanks. Amy, billings were about what we modeled for the quarter. But deferred revenue was about $700 million less -- than we expected, anyway. Which was equal to the upside in revenue. So I'm just curious, did you end up recognizing a greater portion of revenue upfront this quarter than you normally would? I realize, given how you organize revenue, the question to be said is, was the transactional portion of the revenue in the commercial segment greater than it is typically this quarter?", "Excellent. Thank you, guys, for taking the question. You saw a real market uptick in the advertising revenue with the search advertising revenue. Any particular catalyst you could point us to in what really catalyzed that part of the business and how sustainable that's going to be on a go forward basis?", "Just to follow-up on Mark's question, I believe there was a slide at [STAM] that showed about $150 million of negative impact in the quarter from the move to the cloud. Which, in and of itself, it's about 1% of revenue, so it's not a very big deal. And I think most of that was from Office versus server and tools. So, if you say it is about as expected -- I'm just looking for some clarification here -- is really the only impact we're seeing in the Office segment versus server and tools? Or was there much impact in that part of the business from the move to subscription?", "Hi, thank you very much for all the details, as well. Maybe my math skills have gotten horribly weak, but I just took the midpoint, Amy, of your revenue guidance for the different line items, and also the midpoint of your cost of revenue inputs, and the midpoint of your OpEx. And I come up with what looks to be about a 10% reduction to where I think most sales side models are. Maybe I'm doing -- I'm hoping that I did something wrong here. But if that is the case, I get about 29% op margin relative to the 33% or so that you did last year. So can you just walk us through what are the items that you are assuming in your cost structure which effectively makes the op income flat. Although you are getting good revenue growth rate. I just wonder if there are any one-time items or if it is just emblematic of a shift in your business model to devices and consumer, especially with Nokia going forward. Wonder if we should not be thinking about op margins but really op income growth rate? Thank you.", "Thank you. I just wanted to follow on from Jason's question earlier on. Can you talk a little bit about where you see the improved success, and the sales execution success, on the Surface? Is it commercial? Is it consumer? And what is driving the improvement there? And how much is the improved revenue run rate driven also by the fact that the channel needed to be ready for the holiday season? Thank you.", "Thank you very much, and good afternoon, guys. Just two questions. First, Amy, if I recall correctly I believe last quarter you had mentioned an expectation for double-digit annuity growth in fiscal '14. Is that still how you're thinking about the annuity part of the business? And secondly, the year-over-year cloud revenue growth you reported was certainly impressive. But I was wondering if you could shed some light, perhaps, on how much of Azure billings or revenue are incremental versus cannibalistic?", "Thank you. Obviously nice upside on the hardware business and with Surface and Xbox. But my question is on the licensing business, so bear with me a little bit here. You had both licensing businesses, device and consumer and commercial licensing, they were both better than expected at least by about $100 million each. At the same time, deferred revenue was shy by something like $250 million. But there is some conflicting things. I am just trying to get my head around this. The contract not billed, Amy, you pointed out was really strong, saw a big jump by somewhere around $2 billion sequentially. And you also saw some nice traction, the commercial cloud services more than doubled. Assuming it's small. Here's my question. With all that happening, is there a shift happening with your on-premise corporate business to more transactional versus ratable contracts? That would help out, to help offset the financial implications as you shift to cloud services on the corporate side. Is that's what's happening with all these movements? Sorry about all the detail.", "Okay. And last quarter we talked a bit about, are there any metrics you can help us to understand better what the effect of your revenues is from the shift to the cloud? I think on Office it's more of a net, a delta that, I think you said it hurts you about $150 million in the previous quarter. Is there any way you can give us a sense of what the net impact is on the business from the shift to cloud?", "Amy, in the Q it talks about the Surface still losing money, even at the almost $900 million run rate of revenue in the quarter. Can you give us any sense of what type of volume you need for that business to have the scale to make some money?", "Thank you very much. Amy, despite the healthy gross margins, your XBox platform revenue grew $1.2 billion year over year, but your related cost of foods sold went up by $1.6 billion. I realize there may be additional costs related to launch. Wondering if you could talk to expected profitability levels for XBox for the balance of fiscal 2014.", "First, Satya, on Platform-as-a-Service, I'm kind of curious how aggressively you plan to maybe change your business model to a subscription model and drive, like adobe did, less upfront revenue, more encouraging subscription and cloud-based, and whether we should begin to anticipate what it might look like to Microsoft as you make this transition to more of a subscription business. I'm just not sure what the margins are on your cloud business and as you transition, most SaaS companies have 70%, 80% gross margins, I'm not real sure where you are on your cloud businesses today. Do we think this is going to be a smooth transition, or might we expect it to be a little more disruptive, as you gain more and more traction on a subscription and cloud basis?", "I would like to focus on that server product revenue number of 10%, and Satya, I think you know a thing or two about this group, so perhaps I'll direct that to you. But that growth rate is so far still above what a lot of your megacap tech vendors, peers, I should say, are posting. I wanted to ask you if you could try to outline for us the couple of factors that have enabled Microsoft to continue growing that server business well above your peers, and secondly, if you think that 10%-ish growth is sustainable over FY15?", "Great to hear you, Satya, on the call. I had a question about device and consumer licensing. First of all, the Windows Pro revenue is very strong, and Amy, I know you had alluded to receding impact of XP upgrades, but I wanted to get a sense of how sustainable you think that growth can continue? And also noticing that the particularly Office consumer revenue is improving on attach rates, and there had been a bit of a disconnect there, because of the transition to Office 365. Wanted to get your thoughts on how long that might be sustainable, or whether this is related to the broader XP expiration? Thank you.", "Amy, I just wanted to go back to D&amp;C licensing, because I think the guidance for the next quarter suggests a relatively modest decline at the midpoint. Certainly more modest than we saw prior to this quarter for the last few quarters. And I guess I have two questions. One is, are you able to separate the XP end of life impact from the broader improvement in corporate PC refresh, for example? And then two, Satya, what thought have you given around how you could potentially make what has been traditionally a unit model with Windows OEM revenue into something potentially more recurring in nature? Thank you.", "Thank you and, Amy, one quick question. We saw a significant acceleration this quarter in Cloud revenue -- I guess Amy or Satya, we saw acceleration in Cloud revenue your year, what -- is this Office for the iPad? Is this Azure? What's driving the acceleration, and how long do you think we can keep this going?", "I wouldn't mind focusing for a moment on the enterprise server-side. That's where at least for me much of the upside came. We haven't seen server product revenue growth in the mid-teens in a while, total Microsoft bookings, 20% ex-Nokia, haven't seen that in ages. Perhaps the answer to these questions are related, but what's happening with those two numbers to drive the upside. I'm sure a little bit came with Azure being strong, but that's relatively small. So clearly there was an inflection up on the on-prem server tools business. Maybe part of it was renewal rates, and if that's the answer how much room do we have to go on that? Thank you.", "Thanks, good afternoon. On the commercial revenue continues to grow an impressive double-digit rate. Many of your peers have not been doing quite as well as you have just in the last reported quarter. And Amy, I know you mentioned your confident about this business continuing. I'm curious if you could just maybe underscore what you feel you guys are doing differently than what's happening in the peer group, and underscoring that confidence going forward.", "Thank you and congrats on the quarter. Two quick questions relating to cloud. Amy, can you give us a sense of what the revenue run rate for the commercial cloud was this quarter? And Satya, could you give us a little more on the use cases for Azure. Is it more test and dev, or are you seeing most of it being on the production side? Thanks.", "Congrats on another great quarter. Had a question on Office 365. Obviously ya'll continue to create growth, both on a commercial and on the home and personal side. But we also saw just Office commercial products and services continue to grow 5%, so one question for Satya and one for Amy. Satya, how do you feel right now about just momentum particularly on the commercial side that you're seeing on Office 365 and sort of how you're targeting large enterprises versus SMBs? Then Amy, obviously, you've talked about some cannibalization of end-period revenue from the success of Office 365; wondering if you can help us kind of frame that 5% this quarter on the product and services, and how we should think longer term about the revenue and the profitability there? Thanks.", "Yes, thanks. I wanted to follow up on Phil's question. I think that Office transitions, our analysis suggests that that's a net benefit from here for you; I'd like to get Amy's comments and thoughts maybe about the transition for the rest of the business. If you've got server and tools, at some point -- I mean it continues to show really terrific growth, at some point I suppose that becomes cannibalized by your cloud business with Azure. Maybe Satya if you can share how you think that transition, how long, how does it transpire? Any thoughts and should it be net additive to the revenues and operating income as we've seen on the Office side? And maybe if you could talk on Windows as well, it looks like it was OEM down a little bit this quarter, which had been growing. Are we going to see a lower ASPs with these $200 devices coming out this fall?", "Thanks. Question for Amy. Amy, just thinking through your guide by business segment, everything seems roughly in line but for the D&amp;C licensing guide which implies I think a 24% year-over-year decline, and given that that's a 90% gross margin business, I just want to make sure I understand what's happening there. And I have two questions, I'm wondering if you could help disaggregate how much of that is due to the tough XP related compare versus some other perhaps one-time issues that make for a tough comparison? And then secondly, when in your best judgment do you think that D&amp;C licensing revenue might turn positive? Thank you.", "I just wanted to dig into Windows OEM ASPs a little bit, and just try to better understand the dynamics between what we see in the market place when we look at industry analysts that we're looking at, basically flat to slightly down unit grown -- and the down 13% OEM revenue growth that you guys are seeing on some of this mix and some of this ASP. I was wondering if you can help us with a little bit more color in terms of exactly what that ASP dynamic is going on in terms of these lower entry-level additions? What's that doing to the overall ASP of what you're able to extract from the market?", "Thanks, guys. I've got a question on the Commercial Other line. Obviously that continues to show strong growth. You've been calling out the cloud business, whether it be Azure or Office 365. I wanted to double-click on the Azure side. Wondering if you can help us parse through the infrastructure as a service and the platform as a service side, and the trends there, and any sort of joint benefit, I guess, that you're seeing in being able to offer both those two? Also Satya, as this business does scale -- and then Amy I'd love you to chime in here, too -- how do you think about the gross margin and operating margin characteristics, once again, as the revenue continues to grow here?", "I just wanted to follow up, Amy. Your Commercial Other business continues to have fantastic growth. I'm wondering when you juxtapose that with the growth in the commercial licensing business -- I heard you in terms of the headwinds that you face -- but when we think about it more than one quarter out, we think about the revenue transition as you guys continue to build market share in the cloud, how do we think about the trend in the commercial licensing business in the next year or so?", "Congratulations on a great quarter. I wanted to focus on Office 365. Several of those metrics really jumped out to us. It seems like overall revenue between your commercial and BMT for Office 365 is up over 100%. If you look at the consumer and user count, it was up pretty huge just quarter to quarter there. The question is both Satya and Amy. Satya, when you think about the positioning and where we are in the adoption lifecycle of Office 365 on the consumer side, and the SMB and enterprise, where are we in terms of the inflection point there? Amy, how should we think about going forward in terms of the guidance that you gave, how we should think about the financial implications of where we are in that transition from on premise to Office 365?", "Congrats on the quarter. Thank you for taking my question. If Windows OEM Pro has now stabilized, excluding the bump we saw from XP Refresh, and volume licensing, at least in constant currency, is stable growing, should we figure that we've now started to turn the corner on commercial Windows revenue? In addition, where do you think we are on the consumer side on the non-OEM Pro? Is that still going to continue to shrink for a bit?", "Nice quarter. When I drill in, in terms of move to the cloud, this quarter year over year server product and services revenue growth was slower than in the past quarters. How much of that is because you're seeing now some revenue shift to Azure? Or is it not yet seeing any revenue shift going? And then I have a follow-up question.", "Excellent. Nice quarter, guys, thank you for taking the question. I wanted to drill into sort of the new strategy around the phone business a little bit. The revenue expectation for Q1, I think it was below our expectations, I think it was below what the street was looking for. Can you give us a sense of how you see that business trending over a longer period of time. There is significant restructuring going on. I don't think a lot of guys have a good view in their head of what your expectation is for this business on a revenue run rate, or what do you expect to sell this year on going-forward basis right now?", "Amy, just for you on the annuity, it looks like annuity is 82% of the commercial revenue the last two quarters. How high do you think that goes? It sounds like you do expect that to continue to go up, although probably never gets to 100%.", "Congratulations on the quarter, everyone. Two questions. Let me relate it. Let me give you the first one. The commercial cloud annualized revenue run rate grew slightly from $8 billion to $8.2 billion or a little bit more than each of those, yet Office 365, Azure, Dynamics, CRM Online, all of them seem to be growing very fast. How should we think about the difference, should we figure that the run rate reaccelerates next quarter? And then I have a follow-up?", "Thanks so much for squeezing me in and congrats on the quarter. Amy, I just had a couple. The first one, just your comment that the consumer Office business, you are seeing basically the subscription revenue now being larger than the offset, if you will, on the license side. Where do we stand with regard to that on the commercial side of the Office transition?", "But just if I think about the incremental subscription revenues from the commercial side versus the license declines, it sounds like this year, this fiscal year, we're making that pivot like we have made on the consumer side. Would that be a fair statement?", "Just a numbers question for Amy. I noticed your long-term unearned revenue was up quite a bit. That is been a flattish trend, and it was paired with commercial bookings being much stronger, I think, than I was modeling. I'm wondering if you could help us understand what drove the unearned and how that contributed to those commercial bookings?", "Thanks. Amy, this one for you. I wouldn't mind asking about the gross margin guidance. If I take the midpoint of your revenue guidance, the midpoint of your COGS guidance, it looks like you're guiding to another roughly 200 basis point decline in gross margins in the June quarter, which is about what you did in March. So if we look out to FY17, I know you touched on it a little bit, but just to be clear, it feels like you're guiding to a further year-over-year decline in gross margins. But it sounds like that will be offset in part by a continued good OpEx control. So is that the right way to think about it? And is there any way that you could sort of bracket what the gross margin percentage decline might be in FY17? You probably don't want to give specific guidance, but maybe some high level color? Thanks.", "Hi, a question for Amy. Amy, you've been able to grow your Op income on a constant currency basis nicely double-digits, as you've been investing in the cloud. As you look at the results this quarter, and the -- as you pointed out the Op margins in intelligent cloud and business process productivity that were impacted due to the shift to the cloud, do you think that as you look into next year that the cloud business is at scale, that it continues to grow and take share, relative to overall revenue? The transaction business, who knows, it could be a bit of a macro pressure. Do you think that we're at the point where we could continue to entertain a scenario, that Op income could still continues to grow nicely, as it has in the last three, four quarters? Or is there some other structural change, with respect to the margin of the cloud business, or maybe the transaction business drops off a lot more dramatically, that it may be hard to sustain this nice double-digit Op income, at a very high level without going into the details? Thank you.", "Great. Satya, I had a question for you on Azure. I was just wondering if you could talk about the percentage of Azure revenue coming from ISVs? And then how do you see this helping you compete with AWS? And can you talk about why these partners may be choosing you over the competition? Thank you.", "Hi, thanks. Amy, I'm wondering, you saw very strong unearned revenue in the quarter, but I note that you saw contracted backlog that grew sequentially below what a typical June quarter does in commercial bookings that were up about 4%, off of a fairly easy comp. But, I'm wondering if you could just help us understand the dynamics between -- in new and renewal signings that drove that combination of really strong unearned but somewhat weaker trends in the bookings?", "Yes, thank you very much. Satya, we noticed Office 365 commercial seat growth of 45% produced Office 365 commercial revenue growth of 59% in constant currency. So a favorable spread of about 14 points suggesting ASP growth. Wondering if you could help us understand the drivers, both now and into the future, particularly in terms of the initial response to the E5 plan, and also which products you think are driving the strength as you consider across Exchange, Skype for Business, Power BI, Yammer, SharePoint, et cetera.", "Thank you, guys, for taking the question, and very nice quarter. I want to zero in on Office 365 a little bit. 40% growth in commercial seats is a really nice number, but even a nicer number on the revenue line, I think 54% constant currency growth in Office 365 commercial. That seems to imply you guys are seeing some nice ASP increase as the platform matures. Can you talk to us about where we are in that cycle of guys moving from E1 to E3? Is E5 part of the equation yet; are guys actually moving there yet?", "Question for Amy. The operating cash flow generation, $11.6 billion, was extraordinary. I don't think you've had a 50%-plus cash flow margin since early 2012. Is this a little bit of an anomaly, maybe driven by unearned revenues? Or is something changing in the business model that might change the rate of cash flow generation in coming quarters as well? Thank you.", "Thank you. I will add my congratulations. So, Amy, you are reporting an impressive buildup of the long-term deferred revenue; it's up 162% year-over-year. At the same time, some of your partners feel that you are gradually doing away with the three-year EAs that have existed for so long, and that you are replacing them with the MPSA vehicle, which is a little more flexible in terms of length of contract, and there could be some shorter lengths. Could you help us in terms of how to think through the long-term deferred revenue buildup as you do start to mix over to the MPSAs?", "Excellent. Very nice quarter, guys. Thank you for taking the questions. I wanted to ask a question about LinkedIn -- what our expectations should be for achieving revenues synergies on LinkedIn. It seems like there's a lot of real interesting things you can do with that asset, and combining with your own portfolio. And how should we think about the potential for achieving some expense synergies? Obviously, there's a big cloud base that you could utilize under their assets, and Amy [being bullish] and very good at keeping expenses very well-managed. So, as we go forward past the [forward] quarter, how should we think about the timeframe for achieving those benefits?", "Great. Thank you very much. Amy, you noted a material improvement in Azure margins this quarter. I was just wondering if you could share with us -- given how quickly revenue is growing in this area, how fast can we see margins ramp, which obviously were negative. And now that you're getting to some big revenue numbers, is there any reason why, at a similar revenue scale you shouldn't be able to match the gross margins of what AWS -- what you can back into from the financials of AWS? Can you walk us through the puts and takes? And then once you hit that scale point, is it something that we should see inflect pretty quickly? Thank you.", "Thanks for taking my question. I just wanted to focus back in on Office 365 on the commercial front. You have another strong quarter of revenue growth, obviously at 49% constant currency, but it continues to meaningfully outpace the seat growth, which is still strong, but 37%. That commentary that you all are giving about premium mix in the past -- two questions here. First, to Satya, when you think about where we are in the progression -- call it up to E5, so to speak, or E3. How do you think this plays out? And how do you think about the mix of unit growth versus that premium mix and translating it to revenue? And then to Amy, I'd argue that maybe we've done the low margin, or low gross margin parts of the Office 365 transition. And now as this mix goes up, you're actually not just increasing revenue, but the margin is better, too. Is that fair? And then, how do you tie that back to your commercial cloud gross margin expectations long term?"]}, {"name": "windows adoption", "questions": []}, {"name": "consumer pcs", "questions": []}, {"name": "windows pricing", "questions": []}, {"name": "corporate pc cycle", "questions": []}, {"name": "azure", "questions": []}, {"name": "windows", "questions": []}, {"name": "customer opportunity", "questions": []}, {"name": "different market segmentations", "questions": ["Thank you, and Satya, I'll echo everybody's thoughts that it's great to have you on the call, and hear your perspective. I was wondering if you could share with us the decision recently to offer Windows for free for sub-9-inch devices, and how you think this impacts your share in that arena? And also, how should we think about Windows pricing, given your comment about how Windows is going to play in different market segmentations, how do we see Windows pricing evolving, if at all, for other types of form factors over time?"]}, {"name": "consumer", "questions": ["Amy, I was wondering if you could talk a little bit about the incentive pricing you've been doing, not just on your own devices, like Chris mentioned in his prepared remarks, but also in the OEM market. If you haven't done incentive pricing at the OEM level, is there a chance we could see this strategy going forward, as a way to help lower the price points of consumer PCs and just try and spur demand? Thank you.", "Amy, I just wanted to drill into the billings growth where we adjust for the unearned, and it's a lot higher for the Server and Tools business, which is obviously going through a transition towards more a subscription arrangement, a lot higher there than in the MBD segment. I'm just wondered if you could compare and contrast why that might be. I understand the consumer piece in MBD, but is the other piece of this just that there are more traditional licensing arrangements in MBD with enterprise customers, and so the impact from the transition is all the greater, and that's why you see that more subdued billings growth rate in MBD? Thanks.", "Thank you. And, Amy, thank you for giving so much more data and guidance. We appreciate it. Couple of quick attach question. You had said that the consumer Office last quarter was going to be down roughly 5% lower than the PCs due to the move to subscription. You said the attach was higher this quarter. Should we think that the dip was roughly in line with that?", "Thanks a lot. I have two questions. Just, first, on the device and consumer licensing business. Your forecast for Q2 suggests a moderating decline. And I was curious as to whether on the corporate OEM side, if you will, that is just a reflection of the ongoing stabilization trend. Or do you also expect to see improvement on the consumer OEM side? And related to that, how do you think about the impact of the end-of-life of XP on the corporate OEM side? Do you think that the improvement is completely unrelated to that end-of-life forthcoming or do you think there could be some impact related to that? Thanks.", "I was wondering if you could address the conditions in China in a little bit more detail, not just on the consumer but also in the commercial, as well as what your expectations might be given the lifting of the ban on game consoles for Xbox there. And also if you could just address some of what you're seeing in terms of your commercial cloud adoption outside of the US. Thank you.", "Good afternoon. I wanted to drill a little bit into how you're thinking about holiday on the consumer hardware side, and specifically just expectations around Surface. And then, also, any insight or color you think in terms of what your expectations are with RT versus Pro. Thank you.", "Hi, thank you very much for all the details, as well. Maybe my math skills have gotten horribly weak, but I just took the midpoint, Amy, of your revenue guidance for the different line items, and also the midpoint of your cost of revenue inputs, and the midpoint of your OpEx. And I come up with what looks to be about a 10% reduction to where I think most sales side models are. Maybe I'm doing -- I'm hoping that I did something wrong here. But if that is the case, I get about 29% op margin relative to the 33% or so that you did last year. So can you just walk us through what are the items that you are assuming in your cost structure which effectively makes the op income flat. Although you are getting good revenue growth rate. I just wonder if there are any one-time items or if it is just emblematic of a shift in your business model to devices and consumer, especially with Nokia going forward. Wonder if we should not be thinking about op margins but really op income growth rate? Thank you.", "Thank you. I just wanted to follow on from Jason's question earlier on. Can you talk a little bit about where you see the improved success, and the sales execution success, on the Surface? Is it commercial? Is it consumer? And what is driving the improvement there? And how much is the improved revenue run rate driven also by the fact that the channel needed to be ready for the holiday season? Thank you.", "Thank you. Obviously nice upside on the hardware business and with Surface and Xbox. But my question is on the licensing business, so bear with me a little bit here. You had both licensing businesses, device and consumer and commercial licensing, they were both better than expected at least by about $100 million each. At the same time, deferred revenue was shy by something like $250 million. But there is some conflicting things. I am just trying to get my head around this. The contract not billed, Amy, you pointed out was really strong, saw a big jump by somewhere around $2 billion sequentially. And you also saw some nice traction, the commercial cloud services more than doubled. Assuming it's small. Here's my question. With all that happening, is there a shift happening with your on-premise corporate business to more transactional versus ratable contracts? That would help out, to help offset the financial implications as you shift to cloud services on the corporate side. Is that's what's happening with all these movements? Sorry about all the detail.", "Excellent. The second quick question is on the Windows side. Any sense whether or not -- we've seen, obviously, an improvement on the numbers on here. Do you believe that's being driven purely by an improvement going on on the market? It's the Windows 7 refresh accelerating as we get closer to the day? Any sense of what the drivers are, both on the consumer and enterprise side as to why we're seeing the pick up?", "Thanks. Question on the consumer retail side. This is the first year I think you've had full retail store presence. You also, I believe, had some presence in some of the Best Buys with mini stores in there. I am wondering what your take-away is from the holiday season, and if those efforts you think were a part of the reason why you had a pretty successful holiday season, especially on the PC side? And what that experience suggests that you should do in the future in terms of retail store build-out and general investment around retail?", "Hi. Thank you very much, Amy. I appreciate the fact that you are trying to improve the margins in each of the commercial and the consumer businesses. But the margin differential between these two businesses is still -- is a pretty wide one. It looks like the consumer business is growing. The two dynamics that I can see are the of consumer business -- the three are: one is the margin differential is too wide. You try to improve it. The marginal difference is too wide. The consumer business trend-wise is growing faster than commercial. And third is that you have the shift to the cloud. Unless you do something like an Adobe or Autodesk where you force transition to happen quickly, there is the risk that you get a lot of growth, which is fantastic. There's a lot of progress to share, but the margin inflection point could be delayed for several years. I think that what one of the questions that was spurred behind, I think presumably Heather's question, was -- that's what I'm trying to get at. So how long you are going to get this shift to result in a way that we may not see the earnings growth rate, but we have to wait to some point in time? Or are you at the point where you can actually force this shift to happen much quicker? Thank you very much.", "Thanks a lot, and my congratulations, as well. Amy, you said that Office 365 Home Premium was more than 15% of total consumer Office licenses sold. And I wonder if you think about your commercial business. And we either think about it as a percentage of total Office 365 or as a percentage of what's traditionally been transactional, whether you have a similar metric in terms of percentage of total Office licenses sold.", "Congratulations on a great quarter, and Satya, great to have you on the call, as well. I wanted to focus in on Office 365. If you compare this quarter to last quarter, you added 1.1 Home Premium users, last quarter, I think it was 500,000. In September, you talked about a run rate of I think $1.5 billion, now you're at $2.5 billion. I wonder if you can talk about the momentum that you're seeing in Office 365 and maybe give us a few thoughts on business versus the home/consumer side of that. And then, Amy, when you think about Office 365, how do you think about the difference in lifetime value of an Office 365 customer versus a traditional Office user?", "Great to hear you, Satya, on the call. I had a question about device and consumer licensing. First of all, the Windows Pro revenue is very strong, and Amy, I know you had alluded to receding impact of XP upgrades, but I wanted to get a sense of how sustainable you think that growth can continue? And also noticing that the particularly Office consumer revenue is improving on attach rates, and there had been a bit of a disconnect there, because of the transition to Office 365. Wanted to get your thoughts on how long that might be sustainable, or whether this is related to the broader XP expiration? Thank you.", "I wonder if you could talk about Office for a moment. I'm curious whether you think we've seen the worst for Office here with the consumer fall off. In Office 365 a growth in margins expanding there, just if you can look through the dynamics and give us a sense do you think you're actually have turned the corner there and we've maybe seen the worst in terms of Office growth and margins?", "Great, thank you so much for your time. I wanted to ask a question about, Satya, about your comment about combining the next version of Windows into one for all devices. And just wondering if you look out, you've got different SKU segmentations right now, you've got enterprise, you've got consumer less than 9 inches for free. The offering that you mentioned earlier that you recently announced, how do we think about when you come out with this one version for all devices, how do you see this changing the go to market and also the traditional SKU segmentation and pricing that we've seen in the past?", "Satya, you made comments about harmonizing some of the different products across consumer and enterprise, and I was curious what your approach is to viewing your different hardware offerings both in phone and with Surface, how your go to market may change around that. And also since you decided to make the operating system for sub nine inch devices free, how you see the value proposition and your ability to monetize that user base evolving over time?", "Hi, thank you for taking my question. Satya, I just wanted to get your perspective on the business mix, because clearly you have a very strong and growing consumer footprint especially with Nokia, and then you've got a very solid enterprise backbone. And it feels like the consumer side of the house is pulling away much faster, and obviously got some implications for how you look at the business in terms of margins and how they could potentially inflect some switchers. If you could just give us your thoughts Satya on how you see the business mix, that would be great. And also wondering, Amy, if you could shed some light on cost controls, and what were the things that specifically the Company engaged in? Because the marketing expenses came in at a nice surprise much lower than we expected. Thank you very much.", "Congratulations on a great quarter. I wanted to focus on Office 365. Several of those metrics really jumped out to us. It seems like overall revenue between your commercial and BMT for Office 365 is up over 100%. If you look at the consumer and user count, it was up pretty huge just quarter to quarter there. The question is both Satya and Amy. Satya, when you think about the positioning and where we are in the adoption lifecycle of Office 365 on the consumer side, and the SMB and enterprise, where are we in terms of the inflection point there? Amy, how should we think about going forward in terms of the guidance that you gave, how we should think about the financial implications of where we are in that transition from on premise to Office 365?", "Congrats on the quarter. Thank you for taking my question. If Windows OEM Pro has now stabilized, excluding the bump we saw from XP Refresh, and volume licensing, at least in constant currency, is stable growing, should we figure that we've now started to turn the corner on commercial Windows revenue? In addition, where do you think we are on the consumer side on the non-OEM Pro? Is that still going to continue to shrink for a bit?", "Congrats on a great quarter. I wanted to double click on Office 365. You guys showed another huge quarter of growth in terms of consumer seat count and I think it was 86% growth on the commercial other side for Office 365. What have you just drill into the consumer and then the enterprise side, just the trends you're seeing there and obviously the guidance you all just provided looks like you expect those trends to continue in Q1. So any color there would be great.", "Thanks so much for squeezing me in and congrats on the quarter. Amy, I just had a couple. The first one, just your comment that the consumer Office business, you are seeing basically the subscription revenue now being larger than the offset, if you will, on the license side. Where do we stand with regard to that on the commercial side of the Office transition?", "But just if I think about the incremental subscription revenues from the commercial side versus the license declines, it sounds like this year, this fiscal year, we're making that pivot like we have made on the consumer side. Would that be a fair statement?", "Thank you very much. Congrats on the quarter. I was curious to get your thoughts, Satya, on the Windows 10 upgrade cycle in the enterprise and also the consumer market, particularly after you anniversary the free offer for Windows 10. And secondly and finally, thoughts on Surface? It's off to a great start with the latest model. Could that play a more important role in the corporate computing landscape? Thank you. That's it for me.", "Two questions on the Office side; first of all, you obviously reaching very large numbers in terms of the numbers of seats that you have. Can you talk a little bit about what's the seat growth because, both for consumer and for commercial, it seemed to be coming down? Is that kind of the law of large numbers coming in or is there anything else? And then the consumer Office, the consumer Office performance was very, very strong and that almost needs to be stronger from transactions because otherwise I don't get to the numbers. Can you talk a little about the source of the strength there? Thank you."]}, {"name": "oem partners", "questions": []}, {"name": "market", "questions": ["Peter or Chris, I'm wondering if you can weigh in, there's been a bit of a debate this quarter around what the underlying PC market did, and I think we've seen numbers ranging out there from mid-single digit decline to a midteens decline. I'm just wondering first if you could weigh in on that. You've in the past given some sort of range. And then related to that if you look at the second half, I'm wondering how we should set our expectations around this mid- to high-end Haswell release from Intel in terms of impact it may have on the PC market versus the later in the year more holiday time lower end Atom release, and how those two chip releases may have an impact on what you're expecting from the device market and overall impact on Windows.", "I was wondering, Peter, if you can help -- we've heard Intel talk about Haswell and they mentioned it on the call I think it was last night, you obviously mentioned it. I guess I'm just wondering, what can you guys do to specifically help grow your tablet share, given you are reliant ex the Surface products on OEM partners to really hit a broad segment of the market? And I'm thinking in general given the OEM partners don't have much wiggle room on the margin side, what can you do to help stimulate your market share in particular in the mobility and then the tablet side? Thank you. And good luck in the future. We're going to miss you.", "Peter, as you look at the PC data over the course of the quarter, could you give us any sense of how that trended? And following up on that, as you think about the business upgrade cycle, which should be over by this time next year, do we risk a real fall off again in the PC business because the upgrade cycle has aided what's been a difficult PC market the last couple of quarters? And best of luck by the way.", "Amy, I was wondering if you could talk a little bit about the incentive pricing you've been doing, not just on your own devices, like Chris mentioned in his prepared remarks, but also in the OEM market. If you haven't done incentive pricing at the OEM level, is there a chance we could see this strategy going forward, as a way to help lower the price points of consumer PCs and just try and spur demand? Thank you.", "Excellent. Thank you, guys, for taking the question. You saw a real market uptick in the advertising revenue with the search advertising revenue. Any particular catalyst you could point us to in what really catalyzed that part of the business and how sustainable that's going to be on a go forward basis?", "Thanks so much. I had two quick ones. One was the SQL Server success continues to be very impressive, particularly relative to the field. So I'm wondering where you are seeing the most success there. Is that market share gains? Is that pricing's getting you into some new markets? If you could provide any color there that would be held. And then when is your expectation for the next update on Nokia?", "Thank you very much for fitting me in. Two quick ones for you, Amy, on the commercial cloud offerings. First round Office 365 you mentioned you've seen pretty good uptake even outside the US. I was interested in just your ability to monetize Office 365 in some of the emerging markets that have been challenging over time for Office. And then, secondly, as a follow-up to Greg's question on server, within Azure how much of the uptake in Azure is coming from existing Microsoft logos versus bringing on net new logos onto the platform? Thanks.", "Excellent. The second quick question is on the Windows side. Any sense whether or not -- we've seen, obviously, an improvement on the numbers on here. Do you believe that's being driven purely by an improvement going on on the market? It's the Windows 7 refresh accelerating as we get closer to the day? Any sense of what the drivers are, both on the consumer and enterprise side as to why we're seeing the pick up?", "Thanks so much. Amy, you mentioned briefly in your comments some of the strengths you had seen in SQL Server. That seems to be taking market share. You highlighted a couple of the features, but what do you think is driving that market share gain? And a similar question over on the server side where you seem to have better server numbers than what we have seen in units. What would be accounting for that additional strength?", "Thank you, and Satya, I'll echo everybody's thoughts that it's great to have you on the call, and hear your perspective. I was wondering if you could share with us the decision recently to offer Windows for free for sub-9-inch devices, and how you think this impacts your share in that arena? And also, how should we think about Windows pricing, given your comment about how Windows is going to play in different market segmentations, how do we see Windows pricing evolving, if at all, for other types of form factors over time?", "I'm going to give Amy a question here for numbers. Amy, we see sales and marketing expense declined 7% year-over-year in this quarter. Can you remind us if there's anything unique last year, or is this just better controls? And along these same lines, free cash flow, excluding acquisitions grew 2%, which is a bit of a surprise, given the direction the Company is going, and the first time in seven quarters we have actually seen growth in free cash flow. Can you tell us how we should be thinking about this going forward?", "Thank you very much. I've got two parts to it. The first is, Satya, you've been changing the engineering processes within the Company adding more analytics to the process. How do you see this change impacting both the product and the speed of go to market?", "Excellent. Thank you for the question and a very nice quarter. I was hoping to talk a little bit about the growth strategy at Nokia. You guys look to cut expenses pretty aggressively there, but this is -- particularly smart phones is a very competitive marketplace. Can you tell us a little bit about the strategies for how you actually start to gain share with Lumia on a going forward basis and maybe give us an idea of what levels of share or what levels of unit volumes are you going to need to hit to get to that breakeven in FY16?", "Hello, thanks. Satya, wanted to ask you about two statements that you've made, one around responsibly making the market for Windows Phone just following on Keith's question here. It is a really competitive market. It feels like ultimately you need to be a very, very meaningful share player in that market to have value for a developer to leverage the universal apps that you are talking about in terms of presentations you've given at Build and so forth. And I'm trying to understand how you can do both of those things at once, and in terms of responsibly making the market for Windows Phone, it feels difficult given your nearest competitors there are doing things that you might argue are irresponsible in terms of making their market given the fact that they monetize it in different ways.", "Great, thank you so much for your time. I wanted to ask a question about, Satya, about your comment about combining the next version of Windows into one for all devices. And just wondering if you look out, you've got different SKU segmentations right now, you've got enterprise, you've got consumer less than 9 inches for free. The offering that you mentioned earlier that you recently announced, how do we think about when you come out with this one version for all devices, how do you see this changing the go to market and also the traditional SKU segmentation and pricing that we've seen in the past?", "Satya, you made comments about harmonizing some of the different products across consumer and enterprise, and I was curious what your approach is to viewing your different hardware offerings both in phone and with Surface, how your go to market may change around that. And also since you decided to make the operating system for sub nine inch devices free, how you see the value proposition and your ability to monetize that user base evolving over time?", "Hi, thank you for taking my question. Satya, I just wanted to get your perspective on the business mix, because clearly you have a very strong and growing consumer footprint especially with Nokia, and then you've got a very solid enterprise backbone. And it feels like the consumer side of the house is pulling away much faster, and obviously got some implications for how you look at the business in terms of margins and how they could potentially inflect some switchers. If you could just give us your thoughts Satya on how you see the business mix, that would be great. And also wondering, Amy, if you could shed some light on cost controls, and what were the things that specifically the Company engaged in? Because the marketing expenses came in at a nice surprise much lower than we expected. Thank you very much.", "I just wanted to dig into Windows OEM ASPs a little bit, and just try to better understand the dynamics between what we see in the market place when we look at industry analysts that we're looking at, basically flat to slightly down unit grown -- and the down 13% OEM revenue growth that you guys are seeing on some of this mix and some of this ASP. I was wondering if you can help us with a little bit more color in terms of exactly what that ASP dynamic is going on in terms of these lower entry-level additions? What's that doing to the overall ASP of what you're able to extract from the market?", "If I could squeeze in one follow-up. Have you guys done any assessment in terms of the success you're seeing in Surface Pro 3 definitely is a real productivity device. To what extent is that cannibalistic from what would have been Windows PC sales, and to what extent do you think you are expanding the market opportunity with that device?", "I just wanted to follow up, Amy. Your Commercial Other business continues to have fantastic growth. I'm wondering when you juxtapose that with the growth in the commercial licensing business -- I heard you in terms of the headwinds that you face -- but when we think about it more than one quarter out, we think about the revenue transition as you guys continue to build market share in the cloud, how do we think about the trend in the commercial licensing business in the next year or so?", "Two questions, one was related to the success of the sub-$250 machines that you guys and the market have been seeing. What geos have seen the best uptake for those so far? And just if there is a little bit more color you could share about the drivers of the commercial licensing business. I recognize, obviously, that you guys just give guidance for Q4. But as we look out over the next year or two, what are the big puts and takes, in particular, maybe, on the server and tool side that we need to think about?", "Great, thank you. I just had two questions, pretty quick ones. Just to follow up on Azure. I was wondering if you could share with us what you're seeing the mix between IaaS and PaaS and kind of how you have seen that shift evolve over the last few quarters. Secondly, just to follow up on Walter's question, yes, you definitely have been focussing on the customer relationship management opportunity in the financials market more, but given the big SaaS incumbent already competing in that area, can you share with us, do you think you have the assets you need internally to execute against your long-term goals?", "Amy, I'm wondering if you could talk about, on the computing side, the Personal Computing side, you talked about this quarter seeing growth ahead of the PC market. You alluded to a diversity of devices coming in the second half. How do you think about that variable in the model, say, beyond this launch period where you have a little bit of a differing mix going on in devices? When you get to more of a steady-state out in years two and three of the Windows 10 launch, do you think you can grow ahead of the PC market, or do you think -- I know for the last few years, you've grown below the PC market. Just wondering how we should think about that?", "Amy, I see the commercial bookings numbers in the KPI sheet, but I do not see the total bookings numbers. I'm wondering if you could comment on that, so that we can try to maintain a consistent analysis there, if it's relevant? Also, Satya, now that SQL Server has taken over this number one position in the Gartner Quadrant for the database market, could you help us understand how the road map evolves from here? As we did notice, Amazon made its debut also in the leaders' quadrant and we're trying to understand how the movement to cloud platforms like Azure could further alter the database landscape and how you could capitalize on that?", "Thank you very much. Congrats on the quarter. I was curious to get your thoughts, Satya, on the Windows 10 upgrade cycle in the enterprise and also the consumer market, particularly after you anniversary the free offer for Windows 10. And secondly and finally, thoughts on Surface? It's off to a great start with the latest model. Could that play a more important role in the corporate computing landscape? Thank you. That's it for me.", "Good afternoon. I wanted to ask if you have been able to quantify some of the uplift since you've been opening up Office to different platforms like iOS and Android, and now with the recent alliance with Red Hat opening a lot of opportunity to Linux developers? Have you been able to quantify how much uplift you've gotten? And how do you see this impacting your broader market opportunity?", "Thank you very much. Satya, regarding the announcement that you will release your SQL Server database on the Linux platform. I was wondering if you can walk us through your decision tree, just in terms of what you think the potential risks are, and what you think the potential rewards are of reaching for that level of openness, if you will. And just how impactful do you think that that product can be in enhancing Microsoft's share of the database market?", "Excellent. Thank you for taking the question, and very nice quarter. I wanted to dig into Azure and maybe one question for Satya and one question for Amy. Satya, you mentioned the Boeing agreement. What was interesting about that is, not just a large company moving significant workloads onto Azure, but from my reading, sounds like there's a distribution side of this agreement that you are going to help distribute some of those applications on a going-forward basis. I was wondering if you could touch a little bit on that? Is that a one time thing or is that something that you look to do more often with some of these large companies? Moving workloads onto Azure. And then for Amy. Thank you for the additional detail on the cloud gross margin profile on a going forward basis. When we dig into just Azure, you said in the past that you expect to match the gross margin profile of what we're seeing in Amazon web services. Does that commentary still hold? And then you could give us a sort of mark-to-market on how you're doing in terms of matching up Azure's gross margin profile to what you've seen from your top competitor there?", "Thank you very much, and congrats from me as well. Satya, I actually had a question for you on SQL Server. As you think about the port to Linux, I wonder if you can provide an update on two things: one is just the timing of when we should see that in market, and then two, are there other things you need to do to meet that requirement of across the landscape? So, for example, do you have to think about supporting Java runtimes inside of SQL server, moving a little bit away from the traditional thought net development environment. Just curious as to how you are thinking about getting your arms around a wider set of use cases on alternative operating systems. Thanks.", "Thanks. There are a number of investors that have been wondering about the sales reorg that takes place February 1. Perhaps this is being worried and overstated. Can you just give us a sense -- are there changes that are happening that will take place February 1 that are different, or is this a minor tweak to the go-to-market going forward?"]}, {"name": "customers", "questions": ["Thanks, guys, for the cloud data. We've been looking for a lot of this so it's very helpful. Let me ask I guess two related parts to that. Can you give us a sense on the growth metrics in terms of Office 365, which is what you're starting to give here, in terms revenue, users, customers, something that we can think about there? And the second half of it, can you give us a sense in terms of the percentage of Office 365 customers that are net new to Exchange? I know you've given just little bit of data on SMB and new SMB customers but any sense there would be appreciated. Thanks.", "Good afternoon. And Peter I'll echo my sentiments as everyone else did as well. So in recent periods we've seen your MBD growth significantly outpace PC unit growth, although we now have a dynamic where your Office subscription is really resonating with customers. So the question is, just looking at this on a directional basis, is MBD revenue outperformance relative to PC units something that you think is sustainable going forward?", "Amy, I just wanted to drill into the billings growth where we adjust for the unearned, and it's a lot higher for the Server and Tools business, which is obviously going through a transition towards more a subscription arrangement, a lot higher there than in the MBD segment. I'm just wondered if you could compare and contrast why that might be. I understand the consumer piece in MBD, but is the other piece of this just that there are more traditional licensing arrangements in MBD with enterprise customers, and so the impact from the transition is all the greater, and that's why you see that more subdued billings growth rate in MBD? Thanks.", "Thank you very much. Satya, welcome on board, and thanks for joining the call. If you don't mind, I'm going to ask an overall question either of Amy or of Satya. Looking at the commercial license business, how much of the shrinkage year-over-year in commercial license is driven by the move of traditional license players from license or -- licensed paying customers, from license to the cloud? How much is related to guys moving from software assurance, how much from license? Can you give any color in there?", "Great. Thank you so much. Satya, I was wondering if you could share with us given the amazing XP refresh we've seen over the last 12 to 18 months, as you're talking to customers, how do you feel about the corporate PC refresh cycle in calendar 2015?", "One question on Office 365 commercial. Can you talk about deployment rates there? I know you've done a good job of getting those into contracts. How many customers are actually running it -- running their e-mail and SharePoint and other products in the cloud, versus just having the rights to it?", "Thanks. It sounds like cloud Azure represents an opportunity to transition existing customers to a cloud model, but also to expand your customer base or penetrate -- penetration into your current customer base with -- incremental business is what I'm talking about. I think that most of Office 365, because most people were already on Office, represents transitions from the license model. But so far, and I know it's still early, but so far, what about the rest? Can you give us an idea of how much of this is new business and how much of this is transition business?", "Thanks for taking my question. I wanted to go back at Azure, you obviously have strong momentum there. Can you talk a little bit about the use cases you see from your enterprise and SNB customers, is this going to very much test and development situation or do you see kind of a broad adoption there, besides obviously Office 365, et cetera? Thank you.", "Satya, Michael Dell mentioned, with you on stage, a week ago, that he's seen from his perspective stronger Windows 10 adoption among enterprise customers, faster than he had seen in the past. I'm curious if you're starting to see a halo impact where those that are looking to move up are saying we want to go with more of the complete infrastructure set? Are you seeing different sales motions among those enterprise customers as those customers are coming back to you?", "Congrats on a great quarter. I just wanted to focus in on commercial cloud and Azure specifically. Commercial cloud, as you mentioned, the run rate was up $9.4 billion. That's up like $2 billion quarter to quarter, 70% year over year. That's higher growth rate than even last quarter. Azure [similar, if not even] accelerating growth versus even last quarter. So a question, Satya, and I'll follow up for Amy. Satya, when you look at the growth rates there in commercial cloud, and particularly Azure, you talk about new customer wins but also existing customers transitioning more workloads to Azure. I hope you can give us maybe some more color there as far as what you're seeing and how you think about the growth going forward there? And then Amy, based on our calculations, it seems like Azure had a meaningful improvement in just the gross margin year over year. Wondering if you could help us with the two curves in that business, and sort of where we are in Azure's gross margin lifecycle? Again, the fixed costs and the variable costs and how you are thinking about that? Thanks.", "Very nice quarter, guys. And thank you for taking the question. Satya, you mentioned both new and existing customers increasingly using the Azure cloud. I was hoping you could give us some color into what that looks like, specifically when an existing customers starts using Azure in terms of how does their overall spending get impacted and what happens to sort of their spending for the more traditional server and tools? How does that get impacted as people use the public cloud utility more and more?", "Thank you very much, and congratulations as well. Satya, you're making a much bigger bet on AI, and rightfully so. And you highlighted some very interesting use cases. Having said that, Microsoft has worked on AI projects for quite some time. So can you help us understand what degree of positive change you think will come from the combined group that you have recently formed, including when you think material AI benefits will become truly ingrained in your customers' workflows? And then secondly, how should we think about your incremental investment in AI going forward?"]}, {"name": "product", "questions": ["Thanks, guys, and congrats on a good quarter in a pretty tough macroenvironment. Just want to spend a moment on Surface. Obviously, you talked about ramping up production and distribution of that. Just wondering if some of your goals as you look at Surface, RT and Pro, for this year and then within that context, how should we think about the profitability of the Surfaces? Thanks.", "You provided a little bit of color on Surface. Obviously we're seeing an expanding portfolio there. I just want to get a sense of how this is evolving especially on the distribution side, and how the product is doing versus your expectations. And then when you start to think about going forward, how would you also expect the product portfolio to evolve as well as distribution?", "I was wondering, Peter, if you can help -- we've heard Intel talk about Haswell and they mentioned it on the call I think it was last night, you obviously mentioned it. I guess I'm just wondering, what can you guys do to specifically help grow your tablet share, given you are reliant ex the Surface products on OEM partners to really hit a broad segment of the market? And I'm thinking in general given the OEM partners don't have much wiggle room on the margin side, what can you do to help stimulate your market share in particular in the mobility and then the tablet side? Thank you. And good luck in the future. We're going to miss you.", "Amy, I'm wondering if you could talk a little bit about -- you talked about COGS in Q1 and you don't mention COGS for the rest of the year. Obviously, you have Xbox One launching in the second quarter. Could you give us some guidance about how we should think about that product having an impact on margins, maybe comparing it to the 360 or anything else you could do to help us directionally with the COGS impacts beyond Q1?", "Amy, congrats on your first conference call as CFO. My question had to do with the Windows side of the business. I know that you had an impairment charge for the inventory clearance, but even if I add that back in, it looks like the operating margins in the Windows business were sequentially lower, quite materially. Just wanted to get some insight into what drove that from the March quarter into the June quarter. As you look further out into the operating margins of the Windows business, given that you're going to be focusing on Surface, how should we think about the margin structure? I guess you have a volume threshold to clear before you can start to make a margin, given that it's more of a product. But really two parts to that question. Love to get your insights, thank you so much.", "Hi, great. Thank you, Amy and Chris. I just was wondering, you talked about the entry of a lot of new SKUs that are coming out for the holiday season. As we start thinking about building our OEM models, how do we think about ASPs for this 8-inch and below category that you referenced there is a lot of product coming out with?", "Excellent. Thank you for taking my question. Very nice quarter. I want to dig into gross margins in the quarter. By my estimates you guys outperformed the guidance for gross margins that you gave on the quarter, despite the fact that you saw significant out-performance in D&amp;C hardware. Which, as you were saying especially for something like Xbox One, which is just out of the gate, we had expectations of being very low if not negative gross margins. Can you help us understand a little bit of where that gross margin out-performance came from? Was any of it in D&amp;C hardware getting better yields or better gross margins on those products than your expectations? If not, where did the out-performance come from?", "I would like to focus on that server product revenue number of 10%, and Satya, I think you know a thing or two about this group, so perhaps I'll direct that to you. But that growth rate is so far still above what a lot of your megacap tech vendors, peers, I should say, are posting. I wanted to ask you if you could try to outline for us the couple of factors that have enabled Microsoft to continue growing that server business well above your peers, and secondly, if you think that 10%-ish growth is sustainable over FY15?", "Thank you very much. I've got two parts to it. The first is, Satya, you've been changing the engineering processes within the Company adding more analytics to the process. How do you see this change impacting both the product and the speed of go to market?", "Satya, you made comments about harmonizing some of the different products across consumer and enterprise, and I was curious what your approach is to viewing your different hardware offerings both in phone and with Surface, how your go to market may change around that. And also since you decided to make the operating system for sub nine inch devices free, how you see the value proposition and your ability to monetize that user base evolving over time?", "I wouldn't mind focusing for a moment on the enterprise server-side. That's where at least for me much of the upside came. We haven't seen server product revenue growth in the mid-teens in a while, total Microsoft bookings, 20% ex-Nokia, haven't seen that in ages. Perhaps the answer to these questions are related, but what's happening with those two numbers to drive the upside. I'm sure a little bit came with Azure being strong, but that's relatively small. So clearly there was an inflection up on the on-prem server tools business. Maybe part of it was renewal rates, and if that's the answer how much room do we have to go on that? Thank you.", "Thank you and congrats on the quarter. Two quick questions relating to cloud. Amy, can you give us a sense of what the revenue run rate for the commercial cloud was this quarter? And Satya, could you give us a little more on the use cases for Azure. Is it more test and dev, or are you seeing most of it being on the production side? Thanks.", "Congrats on another great quarter. Had a question on Office 365. Obviously ya'll continue to create growth, both on a commercial and on the home and personal side. But we also saw just Office commercial products and services continue to grow 5%, so one question for Satya and one for Amy. Satya, how do you feel right now about just momentum particularly on the commercial side that you're seeing on Office 365 and sort of how you're targeting large enterprises versus SMBs? Then Amy, obviously, you've talked about some cannibalization of end-period revenue from the success of Office 365; wondering if you can help us kind of frame that 5% this quarter on the product and services, and how we should think longer term about the revenue and the profitability there? Thanks.", "Amy, just on the XP tail-off, are there other commercial products that you are seeing being impacted? I just wanted to be clear, there were a lot of questions that is there some type of halo impact from XP taking growth down on the other solutions?", "One question on Office 365 commercial. Can you talk about deployment rates there? I know you've done a good job of getting those into contracts. How many customers are actually running it -- running their e-mail and SharePoint and other products in the cloud, versus just having the rights to it?", "If I could squeeze in one follow-up. Have you guys done any assessment in terms of the success you're seeing in Surface Pro 3 definitely is a real productivity device. To what extent is that cannibalistic from what would have been Windows PC sales, and to what extent do you think you are expanding the market opportunity with that device?", "Yes, thank you. Over the last several quarters, particular Satya, you've opened up a number of the products to different platforms, Office and Android. With Minecraft and Skype, you've got a number of really multi-platform products and services. Could you quantify so far to what extent you have seen benefit? As this plays into the free upgrade for Windows 10, at least for a limited period, how you expect this to play out benefiting the business case of your products across the portfolio?", "Satya, you mentioned a year ago that we are going to see a next generation of personal productivity software. I wonder if you could update us on what that means and when we might see that as just an extension of Office 365 or how do we monetize those products and when will we hear more about them? And Amy, we didn't see any tech guarantees in the quarter for the upcoming Windows 10 launch, and we also haven't heard anything more about changes in accounting for Windows 10 given that there is going to be a big undelivered element there. Is that something we should expect to hear more about next week?", "Good afternoon, Satya, the server business continues a steady out-performance and as Amy pointed out, better growth than your peers. Couple of questions as it relates to the Windows 2003 retirement and any impact you're seeing there. And secondarily if you can just comment on some of the new product launches. Seems like there is a stack of new solutions that are coming on the server side that look pretty exciting and your partners are excited about it. If you could highlight what you see as the most interesting from your perspective over the next several quarters.", "Nice quarter. When I drill in, in terms of move to the cloud, this quarter year over year server product and services revenue growth was slower than in the past quarters. How much of that is because you're seeing now some revenue shift to Azure? Or is it not yet seeing any revenue shift going? And then I have a follow-up question.", "And then, Satya, you mentioned CRM in your prepared comments, which we haven't really heard you talk that much about as an area of interest in the past. I'm wondering what changed in your view, or how do you look to sort of bring that into, it sounds like more the core productivity scenario that you deliver?", "That makes perfect sense. Thank you. The second one is the cloud margins improved nicely. Given the data that's in here, it looks like they've all started to move up. Azure seems to move up. You had said in the [FAM], the gross margins for 2015 should be about 44%. How should we think about cloud gross margins for 2015? I know you don't know, obviously, the mix of all of our products, but how should we think about the improvement there?", "And then on the commercial licensing part, specifically within productivity, I know you had an old breakout and a new breakout where we don't see commercial licensing necessarily within productivity, but would you expect that piece, the commercial licensing within productivity, given the transition going on, to be stable, or with that decline as you see the transition over to the cloud in productivity, specifically?", "Sure. Thank you very much. So if you look at productivity and process and intelligent cloud, obviously we're having a margin decrease that's occurring, and a good chunk of that is cloud. How should we think about the standalone license business, in terms of the margins, separated from the cloud side of it?", "Thanks a lot. Amy, I just wanted to go back on the intelligent cloud. We did see that deceleration in server product growth, but the comp was very tough. And as you commented, your annuity was up, and your deferred growth accelerated. That server product line has grown about 5% constant currency in the last 12 months. I guess the question is, is there any structural reason why, going back to Keith's question, why that would decelerate more ex macro? And then, another question I just had that's related to this. Can you just remind us, in the server product ex Azure line, and in the commercial office traditional non 365 line, how much is transactional in those two segments? Thank you.", "Hi, a question for Amy. Amy, you've been able to grow your Op income on a constant currency basis nicely double-digits, as you've been investing in the cloud. As you look at the results this quarter, and the -- as you pointed out the Op margins in intelligent cloud and business process productivity that were impacted due to the shift to the cloud, do you think that as you look into next year that the cloud business is at scale, that it continues to grow and take share, relative to overall revenue? The transaction business, who knows, it could be a bit of a macro pressure. Do you think that we're at the point where we could continue to entertain a scenario, that Op income could still continues to grow nicely, as it has in the last three, four quarters? Or is there some other structural change, with respect to the margin of the cloud business, or maybe the transaction business drops off a lot more dramatically, that it may be hard to sustain this nice double-digit Op income, at a very high level without going into the details? Thank you.", "Thank you very much. Satya, regarding the announcement that you will release your SQL Server database on the Linux platform. I was wondering if you can walk us through your decision tree, just in terms of what you think the potential risks are, and what you think the potential rewards are of reaching for that level of openness, if you will. And just how impactful do you think that that product can be in enhancing Microsoft's share of the database market?", "Thank you. So Satya or Amy, last quarter, the stock was hit in part on a deceleration in your on-premises server product business, and I think your commentary around the transactional part of that suggested it softened a little bit. I think your tone on this call is a lot better around the transactional performance, and it looks like that business accelerated a little bit. Perhaps you could explain what changed in the course of the three months to make the transactional piece, at least if I'm hearing you correctly, feel a little bit better? Thank you.", "Thanks so much. Maybe just one quick follow-up. The server products business that Karl talked about did rebound this quarter and I think it was up about 4% constant currency for the year. I know you're not guiding to that number specifically and you talked about potential volatility. But is there any range of outcomes that you're thinking about for that business? Will it grow? Is it not clear that it will grow? I'd just love any additional color there. Thank you.", "Yes, thank you very much. Satya, we noticed Office 365 commercial seat growth of 45% produced Office 365 commercial revenue growth of 59% in constant currency. So a favorable spread of about 14 points suggesting ASP growth. Wondering if you could help us understand the drivers, both now and into the future, particularly in terms of the initial response to the E5 plan, and also which products you think are driving the strength as you consider across Exchange, Skype for Business, Power BI, Yammer, SharePoint, et cetera.", "Great, thank you. Satya, I know that Brent asked you about Azure, but I'm just wondering if you could share with us, you mentioned that compute usage on Azure, I think you said more than doubled or nearly doubled, something to that effect. I'm just wondering if you could share with us how you see paths coming along and where do you think we are in getting the easier workloads to the cloud? And are you now starting to see the inflection, given we did see an inflection in growth on a year-over-year basis this quarter where you are starting to see significant production workloads that are on-premise actually starting to move over as well?", "Amy, I am wondering on the segment operating margins, I know you don't guide those per se, but you have flat performance in operating income in PBP and declines in IC with growth in MPC. Do you expect to see, as we get towards the end of the year, that the two enterprise cloud segments move positive and MPC is not as much of a driver? How should we think about the evolution of the product contribution of the three segments over the year?"]}, {"name": "time", "questions": ["Peter or Chris, I'm wondering if you can weigh in, there's been a bit of a debate this quarter around what the underlying PC market did, and I think we've seen numbers ranging out there from mid-single digit decline to a midteens decline. I'm just wondering first if you could weigh in on that. You've in the past given some sort of range. And then related to that if you look at the second half, I'm wondering how we should set our expectations around this mid- to high-end Haswell release from Intel in terms of impact it may have on the PC market versus the later in the year more holiday time lower end Atom release, and how those two chip releases may have an impact on what you're expecting from the device market and overall impact on Windows.", "Good afternoon. And Peter I'll echo my sentiments as everyone else did as well. So in recent periods we've seen your MBD growth significantly outpace PC unit growth, although we now have a dynamic where your Office subscription is really resonating with customers. So the question is, just looking at this on a directional basis, is MBD revenue outperformance relative to PC units something that you think is sustainable going forward?", "Peter, as you look at the PC data over the course of the quarter, could you give us any sense of how that trended? And following up on that, as you think about the business upgrade cycle, which should be over by this time next year, do we risk a real fall off again in the PC business because the upgrade cycle has aided what's been a difficult PC market the last couple of quarters? And best of luck by the way.", "I wonder if you have any perspective for us on, you've got Intel's Haswell chip shipping now, 8.1 coming in, probably, October. Are you sensing that OEMs are trying to manage inventories down for the time being and waiting cautiously? Intel suggested that maybe you are seeing some inventory liquidation, so I wondered if you could give us a sense for what you're hearing from the OEMs.", "Amy, contracted but unbilled was down sequentially from Q3, the first time we had seen that in the last two years. What's contributing to that shift?", "Hi, thank you very much for all the details, as well. Maybe my math skills have gotten horribly weak, but I just took the midpoint, Amy, of your revenue guidance for the different line items, and also the midpoint of your cost of revenue inputs, and the midpoint of your OpEx. And I come up with what looks to be about a 10% reduction to where I think most sales side models are. Maybe I'm doing -- I'm hoping that I did something wrong here. But if that is the case, I get about 29% op margin relative to the 33% or so that you did last year. So can you just walk us through what are the items that you are assuming in your cost structure which effectively makes the op income flat. Although you are getting good revenue growth rate. I just wonder if there are any one-time items or if it is just emblematic of a shift in your business model to devices and consumer, especially with Nokia going forward. Wonder if we should not be thinking about op margins but really op income growth rate? Thank you.", "Thank you very much for fitting me in. Two quick ones for you, Amy, on the commercial cloud offerings. First round Office 365 you mentioned you've seen pretty good uptake even outside the US. I was interested in just your ability to monetize Office 365 in some of the emerging markets that have been challenging over time for Office. And then, secondly, as a follow-up to Greg's question on server, within Azure how much of the uptake in Azure is coming from existing Microsoft logos versus bringing on net new logos onto the platform? Thanks.", "Thank you. Obviously nice upside on the hardware business and with Surface and Xbox. But my question is on the licensing business, so bear with me a little bit here. You had both licensing businesses, device and consumer and commercial licensing, they were both better than expected at least by about $100 million each. At the same time, deferred revenue was shy by something like $250 million. But there is some conflicting things. I am just trying to get my head around this. The contract not billed, Amy, you pointed out was really strong, saw a big jump by somewhere around $2 billion sequentially. And you also saw some nice traction, the commercial cloud services more than doubled. Assuming it's small. Here's my question. With all that happening, is there a shift happening with your on-premise corporate business to more transactional versus ratable contracts? That would help out, to help offset the financial implications as you shift to cloud services on the corporate side. Is that's what's happening with all these movements? Sorry about all the detail.", "Hi. Thank you very much, Amy. I appreciate the fact that you are trying to improve the margins in each of the commercial and the consumer businesses. But the margin differential between these two businesses is still -- is a pretty wide one. It looks like the consumer business is growing. The two dynamics that I can see are the of consumer business -- the three are: one is the margin differential is too wide. You try to improve it. The marginal difference is too wide. The consumer business trend-wise is growing faster than commercial. And third is that you have the shift to the cloud. Unless you do something like an Adobe or Autodesk where you force transition to happen quickly, there is the risk that you get a lot of growth, which is fantastic. There's a lot of progress to share, but the margin inflection point could be delayed for several years. I think that what one of the questions that was spurred behind, I think presumably Heather's question, was -- that's what I'm trying to get at. So how long you are going to get this shift to result in a way that we may not see the earnings growth rate, but we have to wait to some point in time? Or are you at the point where you can actually force this shift to happen much quicker? Thank you very much.", "Question for Satya, just if you could reflect on your initial time as CEO, and maybe give everyone a sense of how you prioritize your near-term objectives here in the next several quarters? That would be helpful, thank you.", "Thank you, and Satya, I'll echo everybody's thoughts that it's great to have you on the call, and hear your perspective. I was wondering if you could share with us the decision recently to offer Windows for free for sub-9-inch devices, and how you think this impacts your share in that arena? And also, how should we think about Windows pricing, given your comment about how Windows is going to play in different market segmentations, how do we see Windows pricing evolving, if at all, for other types of form factors over time?", "I'm going to give Amy a question here for numbers. Amy, we see sales and marketing expense declined 7% year-over-year in this quarter. Can you remind us if there's anything unique last year, or is this just better controls? And along these same lines, free cash flow, excluding acquisitions grew 2%, which is a bit of a surprise, given the direction the Company is going, and the first time in seven quarters we have actually seen growth in free cash flow. Can you tell us how we should be thinking about this going forward?", "Congratulations on a great quarter, and Satya, great to have you on the call, as well. I wanted to focus in on Office 365. If you compare this quarter to last quarter, you added 1.1 Home Premium users, last quarter, I think it was 500,000. In September, you talked about a run rate of I think $1.5 billion, now you're at $2.5 billion. I wonder if you can talk about the momentum that you're seeing in Office 365 and maybe give us a few thoughts on business versus the home/consumer side of that. And then, Amy, when you think about Office 365, how do you think about the difference in lifetime value of an Office 365 customer versus a traditional Office user?", "Great, thank you so much for your time. I wanted to ask a question about, Satya, about your comment about combining the next version of Windows into one for all devices. And just wondering if you look out, you've got different SKU segmentations right now, you've got enterprise, you've got consumer less than 9 inches for free. The offering that you mentioned earlier that you recently announced, how do we think about when you come out with this one version for all devices, how do you see this changing the go to market and also the traditional SKU segmentation and pricing that we've seen in the past?", "Satya, you made comments about harmonizing some of the different products across consumer and enterprise, and I was curious what your approach is to viewing your different hardware offerings both in phone and with Surface, how your go to market may change around that. And also since you decided to make the operating system for sub nine inch devices free, how you see the value proposition and your ability to monetize that user base evolving over time?", "Thank you guys and a very nice quarter. Perhaps a question for Amy. Really nice gross margin improvements across the board, but you did mention some one-time items. So I was hoping you could help us understand where you're seeing sort of underlying gross margin improvements, particularly if we look at sort of any improvements that you saw on the phone gross margins as well as the improvement we saw in the cloud gross margins. How much of that should we look at as durable on a going-forward basis?", "Thanks. Question for Amy. Amy, just thinking through your guide by business segment, everything seems roughly in line but for the D&amp;C licensing guide which implies I think a 24% year-over-year decline, and given that that's a 90% gross margin business, I just want to make sure I understand what's happening there. And I have two questions, I'm wondering if you could help disaggregate how much of that is due to the tough XP related compare versus some other perhaps one-time issues that make for a tough comparison? And then secondly, when in your best judgment do you think that D&amp;C licensing revenue might turn positive? Thank you.", "No, I'm trying to understand generally that issue. I had one other if there's time.", "Amy, when we first started talking about Office 365, I think at that time you were suggesting that the move from an Office cal to an Office 365 license would increase gross profit by about 50%. Now that you've had a couple quarters with Office 365, do you think those changes to the model still make sense? More importantly, are there maybe other changes that you've seen that are more accurate?", "A follow-up to the question John had on Azure. Amazon released their profitability for the first time on AWS and it was higher than most people were expecting. I'm wondering how we should think about your mix of business in Azure, you're running Linux, you're running a lot of services based on open source software, you're also running some of your own IP there. How should we think about where your margins are today and should we think of Amazon's AWS margins as a good benchmark for where you could be at scale they are at today?", "Amy, on OpEx, you have -- I guess not necessarily you, but the Company generally at this time has given some color into the next fiscal year's OpEx. Is that something we should expect at the Build event with your analyst meeting next week? I'm sure you're not going to give us today here, but I wanted to figure out the expectations around when I should hear about that.", "Excellent. Nice quarter, guys, thank you for taking the question. I wanted to drill into sort of the new strategy around the phone business a little bit. The revenue expectation for Q1, I think it was below our expectations, I think it was below what the street was looking for. Can you give us a sense of how you see that business trending over a longer period of time. There is significant restructuring going on. I don't think a lot of guys have a good view in their head of what your expectation is for this business on a revenue run rate, or what do you expect to sell this year on going-forward basis right now?", "I had one quick follow up, if I could. That is helpful. On Analysts Day you did talk about I think it was 8% unit growth for the Office ecosystem over the last three years and sounds like you continued to see nice unit growth in Office. How should we think about that going forward? Are you fully expecting to continue to see unit growth? And also just a clarification. I think your customer lifetime value was based on existing SKUs. So as you introduce E5 and others, does that open up potential for even higher customer lifetime value?", "Thank you very much. I was just wondering, Satya, you mentioned, and I know there is been a lot of questions on Azure, but you mentioned strong growth in compute, and SQL usage on Azure being up, I think you said 5 times. I was wondering if you could give us your take on how you see the mix of Azure workloads? Is it right now more new workload growth and it's very little existing workloads moving over? I'm just trying to get a sense for kind of how you see the wave cresting for new workloads versus existing workloads that can migrate over. I'm also wondering if you see it helping (technical difficulties). You mentioned it is like a design win or an ISV win. I am wondering if you could share with us how this might be impacting your share versus, say, 1X or versus other types of infrastructure platforms. Thank you.", "So it's really a one-time event more than anything else?", "Satya, I had a question on commercial Office 365. I don't know if you gave us the number, but I think the last couple of quarters you've talked about monthly active users. And I'm curious if you have an update on that number. And then I also was curious about thoughts around ARPU because you introduced the E5 SKU in December. Where are we on the path of penetration, if you will, with the higher-value SKUs and the ability to see price list across the base over time? Thanks.", "Hi, thanks. Amy, my question just on guidance, and your posture on guidance, a two-part question. I think we've seen you give very conservative guidance say, for the first half of the year. And in Q3, you ended up, putting it all together, at the lower end of your guidance. And I'm wondering -- your posture, just generally around guidance, if it's changed at all, that you're factoring in things differently, and we should think about that range going forward? Should it be more like it's been in the past, where you've had very conservative assumptions, or more like what you just did here? And then, the second part is, as you look forward maybe towards longer-term guidance, and the prospects of giving longer-term guidance, because I don't think I've seen an estimate spread on a company as large as this, in a long time, how are you thinking about possibly giving long-term guidance? What the factors that are influencing your comfort in doing that? Or is it more philosophical, and it's something you're just not going to do, that's not necessarily dependent on your view of the business?", "It's good to see that you still expect profit to grow, because this seems like the new Microsoft, where you're balancing the need to invest strategically, but at the same time trying to grow profits in the near-term, versus the old Microsoft, where the investments were made, but with more of a longer term, quote/unquote, you never knew when the payoff was supposed -- was going to happen. So it's good to see you emphasize that you're still focused on profit growth, notwithstanding the mix of factors that you cannot forecast.", "Excellent. Thank you for taking the question, and very nice quarter. I wanted to dig into Azure and maybe one question for Satya and one question for Amy. Satya, you mentioned the Boeing agreement. What was interesting about that is, not just a large company moving significant workloads onto Azure, but from my reading, sounds like there's a distribution side of this agreement that you are going to help distribute some of those applications on a going-forward basis. I was wondering if you could touch a little bit on that? Is that a one time thing or is that something that you look to do more often with some of these large companies? Moving workloads onto Azure. And then for Amy. Thank you for the additional detail on the cloud gross margin profile on a going forward basis. When we dig into just Azure, you said in the past that you expect to match the gross margin profile of what we're seeing in Amazon web services. Does that commentary still hold? And then you could give us a sort of mark-to-market on how you're doing in terms of matching up Azure's gross margin profile to what you've seen from your top competitor there?", "Thank you. I will add my congratulations. So, Amy, you are reporting an impressive buildup of the long-term deferred revenue; it's up 162% year-over-year. At the same time, some of your partners feel that you are gradually doing away with the three-year EAs that have existed for so long, and that you are replacing them with the MPSA vehicle, which is a little more flexible in terms of length of contract, and there could be some shorter lengths. Could you help us in terms of how to think through the long-term deferred revenue buildup as you do start to mix over to the MPSAs?", "Thank you very much. Satya, can you just compare and contrast AWS versus Azure, Azure versus AWS from a standpoint of the technology footprint that you are offering both these companies? And Amy, if you could just comment on the margin structure of your Azure business relative to AWS, and if you have time, talk about the Windows 10 cycle. Why is it going to be the best Windows 10 cycle for the enterprise, compared to the previous cycle? Thank you so much.", "Thank you very much, and congrats from me as well. Satya, I actually had a question for you on SQL Server. As you think about the port to Linux, I wonder if you can provide an update on two things: one is just the timing of when we should see that in market, and then two, are there other things you need to do to meet that requirement of across the landscape? So, for example, do you have to think about supporting Java runtimes inside of SQL server, moving a little bit away from the traditional thought net development environment. Just curious as to how you are thinking about getting your arms around a wider set of use cases on alternative operating systems. Thanks.", "Thank you very much, and congratulations as well. Satya, you're making a much bigger bet on AI, and rightfully so. And you highlighted some very interesting use cases. Having said that, Microsoft has worked on AI projects for quite some time. So can you help us understand what degree of positive change you think will come from the combined group that you have recently formed, including when you think material AI benefits will become truly ingrained in your customers' workflows? And then secondly, how should we think about your incremental investment in AI going forward?", "Excellent. Very nice quarter, guys. Thank you for taking the questions. I wanted to ask a question about LinkedIn -- what our expectations should be for achieving revenues synergies on LinkedIn. It seems like there's a lot of real interesting things you can do with that asset, and combining with your own portfolio. And how should we think about the potential for achieving some expense synergies? Obviously, there's a big cloud base that you could utilize under their assets, and Amy [being bullish] and very good at keeping expenses very well-managed. So, as we go forward past the [forward] quarter, how should we think about the timeframe for achieving those benefits?", "Thank you. Amy, I'm going to ask another question on gross margins, but this time at the Microsoft level. Your prior guidance was for ex-LinkedIn FY17 gross margins to be down 100 basis points. So the quarter you just posted gross margins ex-LinkedIn were actually up. And if I ran the math accurately, it looks like for your March quarter, ex-LinkedIn you're expecting gross margins to be about flat. It feels like you are outperforming the core Microsoft gross margin guidance you gave before. Are you sticking with the down 100, or has that improved? And if it has, what are the one or two biggest drivers of the gross margins feeling a little bit better, ex-LinkedIn? Thank you."]}, {"name": "oem level", "questions": []}, {"name": "own devices", "questions": ["Amy, I was wondering if you could talk a little bit about the incentive pricing you've been doing, not just on your own devices, like Chris mentioned in his prepared remarks, but also in the OEM market. If you haven't done incentive pricing at the OEM level, is there a chance we could see this strategy going forward, as a way to help lower the price points of consumer PCs and just try and spur demand? Thank you."]}, {"name": "material improvement", "questions": ["Great. Thank you very much. Amy, you noted a material improvement in Azure margins this quarter. I was just wondering if you could share with us -- given how quickly revenue is growing in this area, how fast can we see margins ramp, which obviously were negative. And now that you're getting to some big revenue numbers, is there any reason why, at a similar revenue scale you shouldn't be able to match the gross margins of what AWS -- what you can back into from the financials of AWS? Can you walk us through the puts and takes? And then once you hit that scale point, is it something that we should see inflect pretty quickly? Thank you."]}, {"name": "growth", "questions": ["Thanks, guys, for the cloud data. We've been looking for a lot of this so it's very helpful. Let me ask I guess two related parts to that. Can you give us a sense on the growth metrics in terms of Office 365, which is what you're starting to give here, in terms revenue, users, customers, something that we can think about there? And the second half of it, can you give us a sense in terms of the percentage of Office 365 customers that are net new to Exchange? I know you've given just little bit of data on SMB and new SMB customers but any sense there would be appreciated. Thanks.", "You've just launched -- or Azure infrastructure as a service just went generally available this week. And I'd love to get some color on how much that's figuring in the long-term contracts, the growth in long-term contracts, and what your expectations might be for more traditional infrastructure as a service uptake over the next several quarters. Thanks.", "Good afternoon. And Peter I'll echo my sentiments as everyone else did as well. So in recent periods we've seen your MBD growth significantly outpace PC unit growth, although we now have a dynamic where your Office subscription is really resonating with customers. So the question is, just looking at this on a directional basis, is MBD revenue outperformance relative to PC units something that you think is sustainable going forward?", "I was wondering, focusing on the Server and Tools division, you guys came in with high single digit growth versus the guidance of low double digit growth. I was hoping you could walk us through some of the elements that perhaps transpired during the quarter, that caused that gap. Why you came in slightly below expectations there, and to what extent was the shift towards subscriptions a part of that.", "Amy, on the expenses, you're revising next year down, and it looks like your expense growth will materially slow from what it was this year. I'm just curious if you could help us understand where that's coming from and how you're thinking about that for next year.", "Amy, I just wanted to drill into the billings growth where we adjust for the unearned, and it's a lot higher for the Server and Tools business, which is obviously going through a transition towards more a subscription arrangement, a lot higher there than in the MBD segment. I'm just wondered if you could compare and contrast why that might be. I understand the consumer piece in MBD, but is the other piece of this just that there are more traditional licensing arrangements in MBD with enterprise customers, and so the impact from the transition is all the greater, and that's why you see that more subdued billings growth rate in MBD? Thanks.", "Amy, welcome on this first earnings call. I have a question on the business PC side, that was an area of strength for the Windows division, and you saw some growth there. Can you talk a little bit about if that's -- if you see that as a sustainable number, or is that still driven by the end of life for Windows XP? Thank you.", "Hi, thank you very much for all the details, as well. Maybe my math skills have gotten horribly weak, but I just took the midpoint, Amy, of your revenue guidance for the different line items, and also the midpoint of your cost of revenue inputs, and the midpoint of your OpEx. And I come up with what looks to be about a 10% reduction to where I think most sales side models are. Maybe I'm doing -- I'm hoping that I did something wrong here. But if that is the case, I get about 29% op margin relative to the 33% or so that you did last year. So can you just walk us through what are the items that you are assuming in your cost structure which effectively makes the op income flat. Although you are getting good revenue growth rate. I just wonder if there are any one-time items or if it is just emblematic of a shift in your business model to devices and consumer, especially with Nokia going forward. Wonder if we should not be thinking about op margins but really op income growth rate? Thank you.", "Thank you very much, and good afternoon, guys. Just two questions. First, Amy, if I recall correctly I believe last quarter you had mentioned an expectation for double-digit annuity growth in fiscal '14. Is that still how you're thinking about the annuity part of the business? And secondly, the year-over-year cloud revenue growth you reported was certainly impressive. But I was wondering if you could shed some light, perhaps, on how much of Azure billings or revenue are incremental versus cannibalistic?", "Thanks, guys. Congratulations on the great quarter. I have a question back on the Windows volume licensing side. You kind of touched on it earlier, but you saw 10% growth year over year this quarter verses 6% last quarter. So you continue to have very healthy growth here. One of the questions I've been getting from some clients is, A, what's driving that? And B, as we get closer and then actually pass the official end of life of XP, how do you think that's going to affect the growth in Windows licensing beyond that point?", "Hi. Thank you very much, Amy. I appreciate the fact that you are trying to improve the margins in each of the commercial and the consumer businesses. But the margin differential between these two businesses is still -- is a pretty wide one. It looks like the consumer business is growing. The two dynamics that I can see are the of consumer business -- the three are: one is the margin differential is too wide. You try to improve it. The marginal difference is too wide. The consumer business trend-wise is growing faster than commercial. And third is that you have the shift to the cloud. Unless you do something like an Adobe or Autodesk where you force transition to happen quickly, there is the risk that you get a lot of growth, which is fantastic. There's a lot of progress to share, but the margin inflection point could be delayed for several years. I think that what one of the questions that was spurred behind, I think presumably Heather's question, was -- that's what I'm trying to get at. So how long you are going to get this shift to result in a way that we may not see the earnings growth rate, but we have to wait to some point in time? Or are you at the point where you can actually force this shift to happen much quicker? Thank you very much.", "I'm going to give Amy a question here for numbers. Amy, we see sales and marketing expense declined 7% year-over-year in this quarter. Can you remind us if there's anything unique last year, or is this just better controls? And along these same lines, free cash flow, excluding acquisitions grew 2%, which is a bit of a surprise, given the direction the Company is going, and the first time in seven quarters we have actually seen growth in free cash flow. Can you tell us how we should be thinking about this going forward?", "I would like to focus on that server product revenue number of 10%, and Satya, I think you know a thing or two about this group, so perhaps I'll direct that to you. But that growth rate is so far still above what a lot of your megacap tech vendors, peers, I should say, are posting. I wanted to ask you if you could try to outline for us the couple of factors that have enabled Microsoft to continue growing that server business well above your peers, and secondly, if you think that 10%-ish growth is sustainable over FY15?", "Great to hear you, Satya, on the call. I had a question about device and consumer licensing. First of all, the Windows Pro revenue is very strong, and Amy, I know you had alluded to receding impact of XP upgrades, but I wanted to get a sense of how sustainable you think that growth can continue? And also noticing that the particularly Office consumer revenue is improving on attach rates, and there had been a bit of a disconnect there, because of the transition to Office 365. Wanted to get your thoughts on how long that might be sustainable, or whether this is related to the broader XP expiration? Thank you.", "Excellent. Thank you for the question and a very nice quarter. I was hoping to talk a little bit about the growth strategy at Nokia. You guys look to cut expenses pretty aggressively there, but this is -- particularly smart phones is a very competitive marketplace. Can you tell us a little bit about the strategies for how you actually start to gain share with Lumia on a going forward basis and maybe give us an idea of what levels of share or what levels of unit volumes are you going to need to hit to get to that breakeven in FY16?", "I wonder if you could talk about Office for a moment. I'm curious whether you think we've seen the worst for Office here with the consumer fall off. In Office 365 a growth in margins expanding there, just if you can look through the dynamics and give us a sense do you think you're actually have turned the corner there and we've maybe seen the worst in terms of Office growth and margins?", "I wouldn't mind focusing for a moment on the enterprise server-side. That's where at least for me much of the upside came. We haven't seen server product revenue growth in the mid-teens in a while, total Microsoft bookings, 20% ex-Nokia, haven't seen that in ages. Perhaps the answer to these questions are related, but what's happening with those two numbers to drive the upside. I'm sure a little bit came with Azure being strong, but that's relatively small. So clearly there was an inflection up on the on-prem server tools business. Maybe part of it was renewal rates, and if that's the answer how much room do we have to go on that? Thank you.", "Congrats on another great quarter. Had a question on Office 365. Obviously ya'll continue to create growth, both on a commercial and on the home and personal side. But we also saw just Office commercial products and services continue to grow 5%, so one question for Satya and one for Amy. Satya, how do you feel right now about just momentum particularly on the commercial side that you're seeing on Office 365 and sort of how you're targeting large enterprises versus SMBs? Then Amy, obviously, you've talked about some cannibalization of end-period revenue from the success of Office 365; wondering if you can help us kind of frame that 5% this quarter on the product and services, and how we should think longer term about the revenue and the profitability there? Thanks.", "Yes, thanks. I wanted to follow up on Phil's question. I think that Office transitions, our analysis suggests that that's a net benefit from here for you; I'd like to get Amy's comments and thoughts maybe about the transition for the rest of the business. If you've got server and tools, at some point -- I mean it continues to show really terrific growth, at some point I suppose that becomes cannibalized by your cloud business with Azure. Maybe Satya if you can share how you think that transition, how long, how does it transpire? Any thoughts and should it be net additive to the revenues and operating income as we've seen on the Office side? And maybe if you could talk on Windows as well, it looks like it was OEM down a little bit this quarter, which had been growing. Are we going to see a lower ASPs with these $200 devices coming out this fall?", "Satya, what do you think as you move to the cloud and really tried to go into this next phase of growth is the biggest challenge and then maybe the biggest opportunity from just a high-level as we think of Microsoft going into the next stage?", "Amy, just on the XP tail-off, are there other commercial products that you are seeing being impacted? I just wanted to be clear, there were a lot of questions that is there some type of halo impact from XP taking growth down on the other solutions?", "I just wanted to dig into Windows OEM ASPs a little bit, and just try to better understand the dynamics between what we see in the market place when we look at industry analysts that we're looking at, basically flat to slightly down unit grown -- and the down 13% OEM revenue growth that you guys are seeing on some of this mix and some of this ASP. I was wondering if you can help us with a little bit more color in terms of exactly what that ASP dynamic is going on in terms of these lower entry-level additions? What's that doing to the overall ASP of what you're able to extract from the market?", "Thanks, guys. I've got a question on the Commercial Other line. Obviously that continues to show strong growth. You've been calling out the cloud business, whether it be Azure or Office 365. I wanted to double-click on the Azure side. Wondering if you can help us parse through the infrastructure as a service and the platform as a service side, and the trends there, and any sort of joint benefit, I guess, that you're seeing in being able to offer both those two? Also Satya, as this business does scale -- and then Amy I'd love you to chime in here, too -- how do you think about the gross margin and operating margin characteristics, once again, as the revenue continues to grow here?", "I just wanted to follow up, Amy. Your Commercial Other business continues to have fantastic growth. I'm wondering when you juxtapose that with the growth in the commercial licensing business -- I heard you in terms of the headwinds that you face -- but when we think about it more than one quarter out, we think about the revenue transition as you guys continue to build market share in the cloud, how do we think about the trend in the commercial licensing business in the next year or so?", "Very nice quarter. One of the highlights of the past year has definitely been the expense control, and I guess, a normalized OpEx growth of just 1% of the quarter, continues to be very impressive. How should investors, or how should we think about the sustainability of that expense control? How long can you keep investing for these growth initiatives like cloud, yet keep the overall OpEx growth rate so low on a go forward basis?", "Congrats on a great quarter. I wanted to double click on Office 365. You guys showed another huge quarter of growth in terms of consumer seat count and I think it was 86% growth on the commercial other side for Office 365. What have you just drill into the consumer and then the enterprise side, just the trends you're seeing there and obviously the guidance you all just provided looks like you expect those trends to continue in Q1. So any color there would be great.", "Good afternoon, Satya, the server business continues a steady out-performance and as Amy pointed out, better growth than your peers. Couple of questions as it relates to the Windows 2003 retirement and any impact you're seeing there. And secondarily if you can just comment on some of the new product launches. Seems like there is a stack of new solutions that are coming on the server side that look pretty exciting and your partners are excited about it. If you could highlight what you see as the most interesting from your perspective over the next several quarters.", "Nice quarter. When I drill in, in terms of move to the cloud, this quarter year over year server product and services revenue growth was slower than in the past quarters. How much of that is because you're seeing now some revenue shift to Azure? Or is it not yet seeing any revenue shift going? And then I have a follow-up question.", "I had one quick follow up, if I could. That is helpful. On Analysts Day you did talk about I think it was 8% unit growth for the Office ecosystem over the last three years and sounds like you continued to see nice unit growth in Office. How should we think about that going forward? Are you fully expecting to continue to see unit growth? And also just a clarification. I think your customer lifetime value was based on existing SKUs. So as you introduce E5 and others, does that open up potential for even higher customer lifetime value?", "I just had two quick questions. I was wondering, Satya, if you could give us a sense for a high-level commentary about the split of IaaS versus PaaS and Azure? And maybe some color on the growth you see in each of those and how you see them evolving? Then the second question would be related to the launch of Windows 10. You gave the Bing example for the month of September and the solid pull-forward there -- or pull-along there. I'm just wondering if you could share with us any other areas where you're seeing a similar pull along with Windows 10 adoption. Thank you.", "Besides Azure in the Intelligent Cloud, you obviously have very, very good momentum on the classic server [and tools] business. Can you talk a little bit about the volume versus price effect that you see playing out here and how is it now and how do you expect that to play out going forward? One of the things on Azure was usage, and you mentioned how that improved quite significantly. Satya, can you talk a little bit where you see that current usage standing and where do you think that can go? We obviously didn't get a number, just a growth rate, but where do we see usage, because that's obviously one of the things that one of your competitors keeps [poking] -- trying to knock on you?", "Amy, I'm wondering if you could talk about, on the computing side, the Personal Computing side, you talked about this quarter seeing growth ahead of the PC market. You alluded to a diversity of devices coming in the second half. How do you think about that variable in the model, say, beyond this launch period where you have a little bit of a differing mix going on in devices? When you get to more of a steady-state out in years two and three of the Windows 10 launch, do you think you can grow ahead of the PC market, or do you think -- I know for the last few years, you've grown below the PC market. Just wondering how we should think about that?", "Congrats on a great quarter. I just wanted to focus in on commercial cloud and Azure specifically. Commercial cloud, as you mentioned, the run rate was up $9.4 billion. That's up like $2 billion quarter to quarter, 70% year over year. That's higher growth rate than even last quarter. Azure [similar, if not even] accelerating growth versus even last quarter. So a question, Satya, and I'll follow up for Amy. Satya, when you look at the growth rates there in commercial cloud, and particularly Azure, you talk about new customer wins but also existing customers transitioning more workloads to Azure. I hope you can give us maybe some more color there as far as what you're seeing and how you think about the growth going forward there? And then Amy, based on our calculations, it seems like Azure had a meaningful improvement in just the gross margin year over year. Wondering if you could help us with the two curves in that business, and sort of where we are in Azure's gross margin lifecycle? Again, the fixed costs and the variable costs and how you are thinking about that? Thanks.", "Thank you very much. I was just wondering, Satya, you mentioned, and I know there is been a lot of questions on Azure, but you mentioned strong growth in compute, and SQL usage on Azure being up, I think you said 5 times. I was wondering if you could give us your take on how you see the mix of Azure workloads? Is it right now more new workload growth and it's very little existing workloads moving over? I'm just trying to get a sense for kind of how you see the wave cresting for new workloads versus existing workloads that can migrate over. I'm also wondering if you see it helping (technical difficulties). You mentioned it is like a design win or an ISV win. I am wondering if you could share with us how this might be impacting your share versus, say, 1X or versus other types of infrastructure platforms. Thank you.", "And then if I can just -- one other numbers question. It looked like in the Q you called out actually Windows server declining as an offset to Intelligent Cloud growth. I'm wondering, we haven't seen that comment in the Q before. Was there something, sort of one-off driving that, or any further detail on that?", "Thanks a lot. Amy, I just wanted to go back on the intelligent cloud. We did see that deceleration in server product growth, but the comp was very tough. And as you commented, your annuity was up, and your deferred growth accelerated. That server product line has grown about 5% constant currency in the last 12 months. I guess the question is, is there any structural reason why, going back to Keith's question, why that would decelerate more ex macro? And then, another question I just had that's related to this. Can you just remind us, in the server product ex Azure line, and in the commercial office traditional non 365 line, how much is transactional in those two segments? Thank you.", "It's good to see that you still expect profit to grow, because this seems like the new Microsoft, where you're balancing the need to invest strategically, but at the same time trying to grow profits in the near-term, versus the old Microsoft, where the investments were made, but with more of a longer term, quote/unquote, you never knew when the payoff was supposed -- was going to happen. So it's good to see you emphasize that you're still focused on profit growth, notwithstanding the mix of factors that you cannot forecast.", "Thank you. Amy, how much of the weakness in transactional has been caused by clients that otherwise would have bought a license now under annuity? In other words, are you driving the transactional weakness to some extent by driving the growth in on-prem? And then I have a quick follow-up for Satya.", "Two questions on the Office side; first of all, you obviously reaching very large numbers in terms of the numbers of seats that you have. Can you talk a little bit about what's the seat growth because, both for consumer and for commercial, it seemed to be coming down? Is that kind of the law of large numbers coming in or is there anything else? And then the consumer Office, the consumer Office performance was very, very strong and that almost needs to be stronger from transactions because otherwise I don't get to the numbers. Can you talk a little about the source of the strength there? Thank you.", "Okay. Thanks very much and good afternoon. Amy, you spoke about a slowdown in the Cloud CapEx growth curve in FY17. I assume you're referring to the growth in absolute dollars moderating and not just the rate of change in percentage terms? But any additional color that you could provide on the Company's CapEx requirements over the course of the next year would be appreciated.", "Yes, thank you very much. Satya, we noticed Office 365 commercial seat growth of 45% produced Office 365 commercial revenue growth of 59% in constant currency. So a favorable spread of about 14 points suggesting ASP growth. Wondering if you could help us understand the drivers, both now and into the future, particularly in terms of the initial response to the E5 plan, and also which products you think are driving the strength as you consider across Exchange, Skype for Business, Power BI, Yammer, SharePoint, et cetera.", "Thank you, guys, for taking the question, and very nice quarter. I want to zero in on Office 365 a little bit. 40% growth in commercial seats is a really nice number, but even a nicer number on the revenue line, I think 54% constant currency growth in Office 365 commercial. That seems to imply you guys are seeing some nice ASP increase as the platform matures. Can you talk to us about where we are in that cycle of guys moving from E1 to E3? Is E5 part of the equation yet; are guys actually moving there yet?", "Great, thank you. Satya, I know that Brent asked you about Azure, but I'm just wondering if you could share with us, you mentioned that compute usage on Azure, I think you said more than doubled or nearly doubled, something to that effect. I'm just wondering if you could share with us how you see paths coming along and where do you think we are in getting the easier workloads to the cloud? And are you now starting to see the inflection, given we did see an inflection in growth on a year-over-year basis this quarter where you are starting to see significant production workloads that are on-premise actually starting to move over as well?", "Amy, I am wondering on the segment operating margins, I know you don't guide those per se, but you have flat performance in operating income in PBP and declines in IC with growth in MPC. Do you expect to see, as we get towards the end of the year, that the two enterprise cloud segments move positive and MPC is not as much of a driver? How should we think about the evolution of the product contribution of the three segments over the year?", "Hi. Thanks, Amy. I'm wondering if you could talk about -- we're still seeing the majority, or really all the growth, in operating profits come from MPC in the year-over-year basis. And I'm wondering how we should think about the factors impacting and the timing in the handoff of profit growth from MPC to IC and PBP? Is that something that you expect? What are the factors and timing there?", "Yes. Thank you. Satya. I'm wondering what you think would be required to extend the hyper growth trajectory for Azure into the future. For example, are there incremental waves of activity on the horizon that you would tie to Tier 1 workloads, or large data center migrations, or serverless usage which would enable that? And separate from that, Amy, I'm curious just philosophically, how do you plan to handle price cuts for compute and storage when they occur? Do you think you're better off matching them, exceeding them? Or does it make sense, perhaps, warranting a Premium in many cases due to the differentiated IP that you have up the stack?", "Thanks for taking my question. I just wanted to focus back in on Office 365 on the commercial front. You have another strong quarter of revenue growth, obviously at 49% constant currency, but it continues to meaningfully outpace the seat growth, which is still strong, but 37%. That commentary that you all are giving about premium mix in the past -- two questions here. First, to Satya, when you think about where we are in the progression -- call it up to E5, so to speak, or E3. How do you think this plays out? And how do you think about the mix of unit growth versus that premium mix and translating it to revenue? And then to Amy, I'd argue that maybe we've done the low margin, or low gross margin parts of the Office 365 transition. And now as this mix goes up, you're actually not just increasing revenue, but the margin is better, too. Is that fair? And then, how do you tie that back to your commercial cloud gross margin expectations long term?", "Thanks so much, and congratulations from me, as well. Two questions. One for Amy first. When we look at CapEx, it actually declines year over year ex capital leases, but even with capital leases, the growth rate decelerated. And for the full year, it's obviously a pretty wide range, roughly 0% to 40% growth. I'm just curious, Amy, with LinkedIn, have you made any changes to your CapEx assumptions for core Microsoft? I guess I'm pointing to the fact that it did seem to decelerate quite a lot this quarter. I wondered if there is any additional color you could frame around growth rate for all-up Cap-Ex plus capital leases. Thanks."]}, {"name": "trend", "questions": ["Peter, just on the gross margin it's been under pressure for the last several years, but this quarter it did bounce back. Can you just give us a sense of how you think gross margins will trend? And do you expect this as a stabilization, we should it expect slow improvement from here, or expect more of the same in terms of where they've been the last couple quarters?", "Peter, as you look at the PC data over the course of the quarter, could you give us any sense of how that trended? And following up on that, as you think about the business upgrade cycle, which should be over by this time next year, do we risk a real fall off again in the PC business because the upgrade cycle has aided what's been a difficult PC market the last couple of quarters? And best of luck by the way.", "Thanks a lot. I have two questions. Just, first, on the device and consumer licensing business. Your forecast for Q2 suggests a moderating decline. And I was curious as to whether on the corporate OEM side, if you will, that is just a reflection of the ongoing stabilization trend. Or do you also expect to see improvement on the consumer OEM side? And related to that, how do you think about the impact of the end-of-life of XP on the corporate OEM side? Do you think that the improvement is completely unrelated to that end-of-life forthcoming or do you think there could be some impact related to that? Thanks.", "Sure. I was wondering about Xbox expectations there, but also the trends of commercial cloud adoption in areas outside of the US.", "Hi. Thank you very much, Amy. I appreciate the fact that you are trying to improve the margins in each of the commercial and the consumer businesses. But the margin differential between these two businesses is still -- is a pretty wide one. It looks like the consumer business is growing. The two dynamics that I can see are the of consumer business -- the three are: one is the margin differential is too wide. You try to improve it. The marginal difference is too wide. The consumer business trend-wise is growing faster than commercial. And third is that you have the shift to the cloud. Unless you do something like an Adobe or Autodesk where you force transition to happen quickly, there is the risk that you get a lot of growth, which is fantastic. There's a lot of progress to share, but the margin inflection point could be delayed for several years. I think that what one of the questions that was spurred behind, I think presumably Heather's question, was -- that's what I'm trying to get at. So how long you are going to get this shift to result in a way that we may not see the earnings growth rate, but we have to wait to some point in time? Or are you at the point where you can actually force this shift to happen much quicker? Thank you very much.", "Thanks, guys. I've got a question on the Commercial Other line. Obviously that continues to show strong growth. You've been calling out the cloud business, whether it be Azure or Office 365. I wanted to double-click on the Azure side. Wondering if you can help us parse through the infrastructure as a service and the platform as a service side, and the trends there, and any sort of joint benefit, I guess, that you're seeing in being able to offer both those two? Also Satya, as this business does scale -- and then Amy I'd love you to chime in here, too -- how do you think about the gross margin and operating margin characteristics, once again, as the revenue continues to grow here?", "I just wanted to follow up, Amy. Your Commercial Other business continues to have fantastic growth. I'm wondering when you juxtapose that with the growth in the commercial licensing business -- I heard you in terms of the headwinds that you face -- but when we think about it more than one quarter out, we think about the revenue transition as you guys continue to build market share in the cloud, how do we think about the trend in the commercial licensing business in the next year or so?", "Congrats on a great quarter. I wanted to double click on Office 365. You guys showed another huge quarter of growth in terms of consumer seat count and I think it was 86% growth on the commercial other side for Office 365. What have you just drill into the consumer and then the enterprise side, just the trends you're seeing there and obviously the guidance you all just provided looks like you expect those trends to continue in Q1. So any color there would be great.", "Excellent. Nice quarter, guys, thank you for taking the question. I wanted to drill into sort of the new strategy around the phone business a little bit. The revenue expectation for Q1, I think it was below our expectations, I think it was below what the street was looking for. Can you give us a sense of how you see that business trending over a longer period of time. There is significant restructuring going on. I don't think a lot of guys have a good view in their head of what your expectation is for this business on a revenue run rate, or what do you expect to sell this year on going-forward basis right now?", "Perfect, thank you. Amy, slightly different topic. Free cash flow grew 25% year on year, much faster than the other metrics. How should we think about this trend continuing?", "Just a numbers question for Amy. I noticed your long-term unearned revenue was up quite a bit. That is been a flattish trend, and it was paired with commercial bookings being much stronger, I think, than I was modeling. I'm wondering if you could help us understand what drove the unearned and how that contributed to those commercial bookings?", "Could I just ask a quick follow-up, Amy? That was great. Just on Windows, just so we all calibrate correctly. You've had this benefit from the RPL [columns] from last year. Should we think about Windows really now beginning to trend in line with PC units, or can there still be some variability around that? Thanks.", "Hi, thanks. Amy, I'm wondering, you saw very strong unearned revenue in the quarter, but I note that you saw contracted backlog that grew sequentially below what a typical June quarter does in commercial bookings that were up about 4%, off of a fairly easy comp. But, I'm wondering if you could just help us understand the dynamics between -- in new and renewal signings that drove that combination of really strong unearned but somewhat weaker trends in the bookings?"]}, {"name": "percentage", "questions": ["Thanks, guys, for the cloud data. We've been looking for a lot of this so it's very helpful. Let me ask I guess two related parts to that. Can you give us a sense on the growth metrics in terms of Office 365, which is what you're starting to give here, in terms revenue, users, customers, something that we can think about there? And the second half of it, can you give us a sense in terms of the percentage of Office 365 customers that are net new to Exchange? I know you've given just little bit of data on SMB and new SMB customers but any sense there would be appreciated. Thanks.", "I just wanted to ask a question about the mix shift to multiyear licensing across Microsoft, that's been a big part of the story. It's been up about 5 percentage points year-over-year each quarter in fiscal 2013. Amy, I'm just wondering, as we look forward to fiscal 2014, can we expect it to increase at that clip, or is the Software Assurance attach rate now getting high enough that that mix shift should start to moderate?", "Thanks a lot, and my congratulations, as well. Amy, you said that Office 365 Home Premium was more than 15% of total consumer Office licenses sold. And I wonder if you think about your commercial business. And we either think about it as a percentage of total Office 365 or as a percentage of what's traditionally been transactional, whether you have a similar metric in terms of percentage of total Office licenses sold.", "Thanks. Amy, this one for you. I wouldn't mind asking about the gross margin guidance. If I take the midpoint of your revenue guidance, the midpoint of your COGS guidance, it looks like you're guiding to another roughly 200 basis point decline in gross margins in the June quarter, which is about what you did in March. So if we look out to FY17, I know you touched on it a little bit, but just to be clear, it feels like you're guiding to a further year-over-year decline in gross margins. But it sounds like that will be offset in part by a continued good OpEx control. So is that the right way to think about it? And is there any way that you could sort of bracket what the gross margin percentage decline might be in FY17? You probably don't want to give specific guidance, but maybe some high level color? Thanks.", "Great. Satya, I had a question for you on Azure. I was just wondering if you could talk about the percentage of Azure revenue coming from ISVs? And then how do you see this helping you compete with AWS? And can you talk about why these partners may be choosing you over the competition? Thank you.", "Okay. Thanks very much and good afternoon. Amy, you spoke about a slowdown in the Cloud CapEx growth curve in FY17. I assume you're referring to the growth in absolute dollars moderating and not just the rate of change in percentage terms? But any additional color that you could provide on the Company's CapEx requirements over the course of the next year would be appreciated."]}, {"name": "inflection", "questions": ["Hi. Thank you very much, Amy. I appreciate the fact that you are trying to improve the margins in each of the commercial and the consumer businesses. But the margin differential between these two businesses is still -- is a pretty wide one. It looks like the consumer business is growing. The two dynamics that I can see are the of consumer business -- the three are: one is the margin differential is too wide. You try to improve it. The marginal difference is too wide. The consumer business trend-wise is growing faster than commercial. And third is that you have the shift to the cloud. Unless you do something like an Adobe or Autodesk where you force transition to happen quickly, there is the risk that you get a lot of growth, which is fantastic. There's a lot of progress to share, but the margin inflection point could be delayed for several years. I think that what one of the questions that was spurred behind, I think presumably Heather's question, was -- that's what I'm trying to get at. So how long you are going to get this shift to result in a way that we may not see the earnings growth rate, but we have to wait to some point in time? Or are you at the point where you can actually force this shift to happen much quicker? Thank you very much.", "I wouldn't mind focusing for a moment on the enterprise server-side. That's where at least for me much of the upside came. We haven't seen server product revenue growth in the mid-teens in a while, total Microsoft bookings, 20% ex-Nokia, haven't seen that in ages. Perhaps the answer to these questions are related, but what's happening with those two numbers to drive the upside. I'm sure a little bit came with Azure being strong, but that's relatively small. So clearly there was an inflection up on the on-prem server tools business. Maybe part of it was renewal rates, and if that's the answer how much room do we have to go on that? Thank you.", "Congratulations on a great quarter. I wanted to focus on Office 365. Several of those metrics really jumped out to us. It seems like overall revenue between your commercial and BMT for Office 365 is up over 100%. If you look at the consumer and user count, it was up pretty huge just quarter to quarter there. The question is both Satya and Amy. Satya, when you think about the positioning and where we are in the adoption lifecycle of Office 365 on the consumer side, and the SMB and enterprise, where are we in terms of the inflection point there? Amy, how should we think about going forward in terms of the guidance that you gave, how we should think about the financial implications of where we are in that transition from on premise to Office 365?", "Very nice quarter, indeed. I wanted to ask about the Azure, in particular, and the public cloud [forms] that you saw this quarter. Again, seems like you're seeing an acceleration in that overall business. More broadly, it seems like industry-wide, both you guys and [eight of us] are seeing something of an inflection point going on in terms of more and more business accruing to those public cloud environments. So my question is just that. Would you agree with that statement that there's been an inflection going on in the business? And if so, what do you think is causing that and is there a changing in nature in how people are using that cloud? And then maybe for Amy, is there something we should bear in mind in terms of your traditional business, the on-premise business that may be impacted as that infection takes place that we should bear in mind as you go forward?", "Great, thank you. Satya, I know that Brent asked you about Azure, but I'm just wondering if you could share with us, you mentioned that compute usage on Azure, I think you said more than doubled or nearly doubled, something to that effect. I'm just wondering if you could share with us how you see paths coming along and where do you think we are in getting the easier workloads to the cloud? And are you now starting to see the inflection, given we did see an inflection in growth on a year-over-year basis this quarter where you are starting to see significant production workloads that are on-premise actually starting to move over as well?"]}, {"name": "market share", "questions": ["I was wondering, Peter, if you can help -- we've heard Intel talk about Haswell and they mentioned it on the call I think it was last night, you obviously mentioned it. I guess I'm just wondering, what can you guys do to specifically help grow your tablet share, given you are reliant ex the Surface products on OEM partners to really hit a broad segment of the market? And I'm thinking in general given the OEM partners don't have much wiggle room on the margin side, what can you do to help stimulate your market share in particular in the mobility and then the tablet side? Thank you. And good luck in the future. We're going to miss you.", "Thanks so much. I had two quick ones. One was the SQL Server success continues to be very impressive, particularly relative to the field. So I'm wondering where you are seeing the most success there. Is that market share gains? Is that pricing's getting you into some new markets? If you could provide any color there that would be held. And then when is your expectation for the next update on Nokia?", "Thanks so much. Amy, you mentioned briefly in your comments some of the strengths you had seen in SQL Server. That seems to be taking market share. You highlighted a couple of the features, but what do you think is driving that market share gain? And a similar question over on the server side where you seem to have better server numbers than what we have seen in units. What would be accounting for that additional strength?", "I just wanted to follow up, Amy. Your Commercial Other business continues to have fantastic growth. I'm wondering when you juxtapose that with the growth in the commercial licensing business -- I heard you in terms of the headwinds that you face -- but when we think about it more than one quarter out, we think about the revenue transition as you guys continue to build market share in the cloud, how do we think about the trend in the commercial licensing business in the next year or so?"]}, {"name": "easier workloads", "questions": ["Great, thank you. Satya, I know that Brent asked you about Azure, but I'm just wondering if you could share with us, you mentioned that compute usage on Azure, I think you said more than doubled or nearly doubled, something to that effect. I'm just wondering if you could share with us how you see paths coming along and where do you think we are in getting the easier workloads to the cloud? And are you now starting to see the inflection, given we did see an inflection in growth on a year-over-year basis this quarter where you are starting to see significant production workloads that are on-premise actually starting to move over as well?"]}, {"name": "particular", "questions": ["I was wondering, Peter, if you can help -- we've heard Intel talk about Haswell and they mentioned it on the call I think it was last night, you obviously mentioned it. I guess I'm just wondering, what can you guys do to specifically help grow your tablet share, given you are reliant ex the Surface products on OEM partners to really hit a broad segment of the market? And I'm thinking in general given the OEM partners don't have much wiggle room on the margin side, what can you do to help stimulate your market share in particular in the mobility and then the tablet side? Thank you. And good luck in the future. We're going to miss you.", "Excellent. Thank you, guys, for taking my question; and nice quarter. I want to ask about the impact -- you mentioned on the call that going to subscription revenues does have a near-term impact on revenues. I was wondering if you can help us out and understand whether we're seeing that impact today and perhaps to what degree with the strong uptake of some of the cloud services, particularly like Office 365?", "Hi. Thanks, guys, and congrats on a great quarter. I just want to focus in on Xbox and Xbox platform. Amy, I wonder if you could give us maybe some color on how it performed this quarter. But, in particular, as you look into the December quarter here, obviously you gave that gross margin guidance but I was wondering if you could talk high level about how you're approaching the Xbox One launch, say, versus Xbox 360, from a perspective of how you're pricing it relative to COGS. And how the build of Xbox One looks versus 360.", "Excellent. Thank you, guys, for taking the question. You saw a real market uptick in the advertising revenue with the search advertising revenue. Any particular catalyst you could point us to in what really catalyzed that part of the business and how sustainable that's going to be on a go forward basis?", "Thanks so much. I had two quick ones. One was the SQL Server success continues to be very impressive, particularly relative to the field. So I'm wondering where you are seeing the most success there. Is that market share gains? Is that pricing's getting you into some new markets? If you could provide any color there that would be held. And then when is your expectation for the next update on Nokia?", "Great to hear you, Satya, on the call. I had a question about device and consumer licensing. First of all, the Windows Pro revenue is very strong, and Amy, I know you had alluded to receding impact of XP upgrades, but I wanted to get a sense of how sustainable you think that growth can continue? And also noticing that the particularly Office consumer revenue is improving on attach rates, and there had been a bit of a disconnect there, because of the transition to Office 365. Wanted to get your thoughts on how long that might be sustainable, or whether this is related to the broader XP expiration? Thank you.", "Excellent. Thank you for the question and a very nice quarter. I was hoping to talk a little bit about the growth strategy at Nokia. You guys look to cut expenses pretty aggressively there, but this is -- particularly smart phones is a very competitive marketplace. Can you tell us a little bit about the strategies for how you actually start to gain share with Lumia on a going forward basis and maybe give us an idea of what levels of share or what levels of unit volumes are you going to need to hit to get to that breakeven in FY16?", "Thank you guys and a very nice quarter. Perhaps a question for Amy. Really nice gross margin improvements across the board, but you did mention some one-time items. So I was hoping you could help us understand where you're seeing sort of underlying gross margin improvements, particularly if we look at sort of any improvements that you saw on the phone gross margins as well as the improvement we saw in the cloud gross margins. How much of that should we look at as durable on a going-forward basis?", "Congrats on another great quarter. Had a question on Office 365. Obviously ya'll continue to create growth, both on a commercial and on the home and personal side. But we also saw just Office commercial products and services continue to grow 5%, so one question for Satya and one for Amy. Satya, how do you feel right now about just momentum particularly on the commercial side that you're seeing on Office 365 and sort of how you're targeting large enterprises versus SMBs? Then Amy, obviously, you've talked about some cannibalization of end-period revenue from the success of Office 365; wondering if you can help us kind of frame that 5% this quarter on the product and services, and how we should think longer term about the revenue and the profitability there? Thanks.", "Okay. A quick follow-up, just on the reduction in operating expenses for the full year. Is this across the board, Amy, or is there a particular area that you are fighting more opportunity to cut?", "Yes, thank you. Over the last several quarters, particular Satya, you've opened up a number of the products to different platforms, Office and Android. With Minecraft and Skype, you've got a number of really multi-platform products and services. Could you quantify so far to what extent you have seen benefit? As this plays into the free upgrade for Windows 10, at least for a limited period, how you expect this to play out benefiting the business case of your products across the portfolio?", "Two questions, one was related to the success of the sub-$250 machines that you guys and the market have been seeing. What geos have seen the best uptake for those so far? And just if there is a little bit more color you could share about the drivers of the commercial licensing business. I recognize, obviously, that you guys just give guidance for Q4. But as we look out over the next year or two, what are the big puts and takes, in particular, maybe, on the server and tool side that we need to think about?", "Very nice quarter, indeed. I wanted to ask about the Azure, in particular, and the public cloud [forms] that you saw this quarter. Again, seems like you're seeing an acceleration in that overall business. More broadly, it seems like industry-wide, both you guys and [eight of us] are seeing something of an inflection point going on in terms of more and more business accruing to those public cloud environments. So my question is just that. Would you agree with that statement that there's been an inflection going on in the business? And if so, what do you think is causing that and is there a changing in nature in how people are using that cloud? And then maybe for Amy, is there something we should bear in mind in terms of your traditional business, the on-premise business that may be impacted as that infection takes place that we should bear in mind as you go forward?", "Congrats on a great quarter. I just wanted to focus in on commercial cloud and Azure specifically. Commercial cloud, as you mentioned, the run rate was up $9.4 billion. That's up like $2 billion quarter to quarter, 70% year over year. That's higher growth rate than even last quarter. Azure [similar, if not even] accelerating growth versus even last quarter. So a question, Satya, and I'll follow up for Amy. Satya, when you look at the growth rates there in commercial cloud, and particularly Azure, you talk about new customer wins but also existing customers transitioning more workloads to Azure. I hope you can give us maybe some more color there as far as what you're seeing and how you think about the growth going forward there? And then Amy, based on our calculations, it seems like Azure had a meaningful improvement in just the gross margin year over year. Wondering if you could help us with the two curves in that business, and sort of where we are in Azure's gross margin lifecycle? Again, the fixed costs and the variable costs and how you are thinking about that? Thanks.", "Thank you very much. Congrats on the quarter. I was curious to get your thoughts, Satya, on the Windows 10 upgrade cycle in the enterprise and also the consumer market, particularly after you anniversary the free offer for Windows 10. And secondly and finally, thoughts on Surface? It's off to a great start with the latest model. Could that play a more important role in the corporate computing landscape? Thank you. That's it for me.", "Excellent. Thank you, guys, for taking my question. Amy, when you're talking about the transactional declines particularly (technical difficulty) and the server portion of that, can you help us understand how much of that is due to maybe more macro factors, weaker overall spending environment, and how much of that comes from perhaps demand being reallocated towards infrastructure-as-a-service offerings that you guys have in Azure? Is there something of a cannibalization taking place, within that transactional business today?", "Yes, thank you very much. Satya, we noticed Office 365 commercial seat growth of 45% produced Office 365 commercial revenue growth of 59% in constant currency. So a favorable spread of about 14 points suggesting ASP growth. Wondering if you could help us understand the drivers, both now and into the future, particularly in terms of the initial response to the E5 plan, and also which products you think are driving the strength as you consider across Exchange, Skype for Business, Power BI, Yammer, SharePoint, et cetera."]}, {"name": "strategy", "questions": ["Amy, I was wondering if you could talk a little bit about the incentive pricing you've been doing, not just on your own devices, like Chris mentioned in his prepared remarks, but also in the OEM market. If you haven't done incentive pricing at the OEM level, is there a chance we could see this strategy going forward, as a way to help lower the price points of consumer PCs and just try and spur demand? Thank you.", "And Satya, again, thank you for joining the call. It's great to have your views and inputs here. One of the questions I get most often from investors is trying to understand sort of how you're going to approach the role, and what you're doing initially, in terms of, is there a strategic review that's going on? Are you reviewing the businesses, and should we expect any big changes in the strategy of Microsoft? So I'm going to pose that question to you, in terms of over the next couple of weeks, months, quarters, even, is there anything of a strategic review going on? Is there any big changes in the Microsoft strategy that we should be expecting from that review?", "Excellent. Thank you for the question and a very nice quarter. I was hoping to talk a little bit about the growth strategy at Nokia. You guys look to cut expenses pretty aggressively there, but this is -- particularly smart phones is a very competitive marketplace. Can you tell us a little bit about the strategies for how you actually start to gain share with Lumia on a going forward basis and maybe give us an idea of what levels of share or what levels of unit volumes are you going to need to hit to get to that breakeven in FY16?", "Excellent. Nice quarter, guys, thank you for taking the question. I wanted to drill into sort of the new strategy around the phone business a little bit. The revenue expectation for Q1, I think it was below our expectations, I think it was below what the street was looking for. Can you give us a sense of how you see that business trending over a longer period of time. There is significant restructuring going on. I don't think a lot of guys have a good view in their head of what your expectation is for this business on a revenue run rate, or what do you expect to sell this year on going-forward basis right now?", "Yes, thanks, just one last one just on M&amp;A. Maybe you could just talk through any change in the strategy, obviously what is happening with the peer write-down, the security acquisition, going into fiscal year, how you're thinking about M&amp;A in the scheme of everything, especially you guys have proved tight on cost control and everything else. Thanks.", "Hi, guys, thanks for taking my question. Satya, around the LinkedIn announcement there was a lot of discussion about some of the opportunities to use the assets and information there to help build your HCM and CRM capabilities, and then we fairly shortly afterwards got the announcement of Dynamics 365 and AppSource. Maybe given the amount of discussion here you could comment on the evolution of the strategy and your thought process around broad enterprise application?"]}, {"name": "price points", "questions": ["Amy, I was wondering if you could talk a little bit about the incentive pricing you've been doing, not just on your own devices, like Chris mentioned in his prepared remarks, but also in the OEM market. If you haven't done incentive pricing at the OEM level, is there a chance we could see this strategy going forward, as a way to help lower the price points of consumer PCs and just try and spur demand? Thank you."]}, {"name": "launch", "questions": ["You've just launched -- or Azure infrastructure as a service just went generally available this week. And I'd love to get some color on how much that's figuring in the long-term contracts, the growth in long-term contracts, and what your expectations might be for more traditional infrastructure as a service uptake over the next several quarters. Thanks.", "Amy, I'm wondering if you could talk a little bit about -- you talked about COGS in Q1 and you don't mention COGS for the rest of the year. Obviously, you have Xbox One launching in the second quarter. Could you give us some guidance about how we should think about that product having an impact on margins, maybe comparing it to the 360 or anything else you could do to help us directionally with the COGS impacts beyond Q1?", "Hi. Thanks, guys, and congrats on a great quarter. I just want to focus in on Xbox and Xbox platform. Amy, I wonder if you could give us maybe some color on how it performed this quarter. But, in particular, as you look into the December quarter here, obviously you gave that gross margin guidance but I was wondering if you could talk high level about how you're approaching the Xbox One launch, say, versus Xbox 360, from a perspective of how you're pricing it relative to COGS. And how the build of Xbox One looks versus 360.", "Thank you very much. Amy, despite the healthy gross margins, your XBox platform revenue grew $1.2 billion year over year, but your related cost of foods sold went up by $1.6 billion. I realize there may be additional costs related to launch. Wondering if you could talk to expected profitability levels for XBox for the balance of fiscal 2014.", "Satya, you mentioned a year ago that we are going to see a next generation of personal productivity software. I wonder if you could update us on what that means and when we might see that as just an extension of Office 365 or how do we monetize those products and when will we hear more about them? And Amy, we didn't see any tech guarantees in the quarter for the upcoming Windows 10 launch, and we also haven't heard anything more about changes in accounting for Windows 10 given that there is going to be a big undelivered element there. Is that something we should expect to hear more about next week?", "Good afternoon, Satya, the server business continues a steady out-performance and as Amy pointed out, better growth than your peers. Couple of questions as it relates to the Windows 2003 retirement and any impact you're seeing there. And secondarily if you can just comment on some of the new product launches. Seems like there is a stack of new solutions that are coming on the server side that look pretty exciting and your partners are excited about it. If you could highlight what you see as the most interesting from your perspective over the next several quarters.", "I just had two quick questions. I was wondering, Satya, if you could give us a sense for a high-level commentary about the split of IaaS versus PaaS and Azure? And maybe some color on the growth you see in each of those and how you see them evolving? Then the second question would be related to the launch of Windows 10. You gave the Bing example for the month of September and the solid pull-forward there -- or pull-along there. I'm just wondering if you could share with us any other areas where you're seeing a similar pull along with Windows 10 adoption. Thank you.", "Amy, I'm wondering if you could talk about, on the computing side, the Personal Computing side, you talked about this quarter seeing growth ahead of the PC market. You alluded to a diversity of devices coming in the second half. How do you think about that variable in the model, say, beyond this launch period where you have a little bit of a differing mix going on in devices? When you get to more of a steady-state out in years two and three of the Windows 10 launch, do you think you can grow ahead of the PC market, or do you think -- I know for the last few years, you've grown below the PC market. Just wondering how we should think about that?"]}, {"name": "launch", "questions": ["You've just launched -- or Azure infrastructure as a service just went generally available this week. And I'd love to get some color on how much that's figuring in the long-term contracts, the growth in long-term contracts, and what your expectations might be for more traditional infrastructure as a service uptake over the next several quarters. Thanks.", "Amy, I'm wondering if you could talk a little bit about -- you talked about COGS in Q1 and you don't mention COGS for the rest of the year. Obviously, you have Xbox One launching in the second quarter. Could you give us some guidance about how we should think about that product having an impact on margins, maybe comparing it to the 360 or anything else you could do to help us directionally with the COGS impacts beyond Q1?", "Hi. Thanks, guys, and congrats on a great quarter. I just want to focus in on Xbox and Xbox platform. Amy, I wonder if you could give us maybe some color on how it performed this quarter. But, in particular, as you look into the December quarter here, obviously you gave that gross margin guidance but I was wondering if you could talk high level about how you're approaching the Xbox One launch, say, versus Xbox 360, from a perspective of how you're pricing it relative to COGS. And how the build of Xbox One looks versus 360.", "Thank you very much. Amy, despite the healthy gross margins, your XBox platform revenue grew $1.2 billion year over year, but your related cost of foods sold went up by $1.6 billion. I realize there may be additional costs related to launch. Wondering if you could talk to expected profitability levels for XBox for the balance of fiscal 2014.", "Satya, you mentioned a year ago that we are going to see a next generation of personal productivity software. I wonder if you could update us on what that means and when we might see that as just an extension of Office 365 or how do we monetize those products and when will we hear more about them? And Amy, we didn't see any tech guarantees in the quarter for the upcoming Windows 10 launch, and we also haven't heard anything more about changes in accounting for Windows 10 given that there is going to be a big undelivered element there. Is that something we should expect to hear more about next week?", "Good afternoon, Satya, the server business continues a steady out-performance and as Amy pointed out, better growth than your peers. Couple of questions as it relates to the Windows 2003 retirement and any impact you're seeing there. And secondarily if you can just comment on some of the new product launches. Seems like there is a stack of new solutions that are coming on the server side that look pretty exciting and your partners are excited about it. If you could highlight what you see as the most interesting from your perspective over the next several quarters.", "I just had two quick questions. I was wondering, Satya, if you could give us a sense for a high-level commentary about the split of IaaS versus PaaS and Azure? And maybe some color on the growth you see in each of those and how you see them evolving? Then the second question would be related to the launch of Windows 10. You gave the Bing example for the month of September and the solid pull-forward there -- or pull-along there. I'm just wondering if you could share with us any other areas where you're seeing a similar pull along with Windows 10 adoption. Thank you.", "Amy, I'm wondering if you could talk about, on the computing side, the Personal Computing side, you talked about this quarter seeing growth ahead of the PC market. You alluded to a diversity of devices coming in the second half. How do you think about that variable in the model, say, beyond this launch period where you have a little bit of a differing mix going on in devices? When you get to more of a steady-state out in years two and three of the Windows 10 launch, do you think you can grow ahead of the PC market, or do you think -- I know for the last few years, you've grown below the PC market. Just wondering how we should think about that?"]}, {"name": "surface products", "questions": []}, {"name": "surface products", "questions": []}, {"name": "windows pricing", "questions": []}, {"name": "incentive pricing", "questions": ["Amy, I was wondering if you could talk a little bit about the incentive pricing you've been doing, not just on your own devices, like Chris mentioned in his prepared remarks, but also in the OEM market. If you haven't done incentive pricing at the OEM level, is there a chance we could see this strategy going forward, as a way to help lower the price points of consumer PCs and just try and spur demand? Thank you."]}]}
